[
   {
      "reviewerID": "AB9S9279OZ3QO",
      "reviewText": "I haven't gotten around to playing the campaign but the multiplayer is solid and pretty fun. Includes Zero Dark Thirty pack, an Online Pass, and the all powerful Battlefield 4 Beta access.",
      "overall": "positive"
   },
   {
      "reviewerID": "A24SSUT5CSW8BH",
      "reviewText": "I want to start off by saying I have never played the Call of Duty games. This is only the second first person shooter game that I have own. I think it is a lot of fun. Has good graphics and nice story line. It does take some skill to get through the levels. I think all players can enjoy this game. There are three levels to choose from based on your skill level. If your looking for first person shooter game that has current military type play than this is a good buy.",
      "overall": "positive"
   },
   {
      "reviewerID": "AK3V0HEBJMQ7J",
      "reviewText": "this will be my second medal of honor I love how the incorporate real life military stories in the game great",
      "overall": "positive"
   },
   {
      "reviewerID": "A10BECPH7W8HM7",
      "reviewText": "great game when it first came out, and still a great game",
      "overall": "positive"
   },
   {
      "reviewerID": "A2PRV9OULX1TWP",
      "reviewText": "this is the first need for speed I bought years and years ago.  I lost it so I bought this for a trip down memory lane.  Pretty tame by todays games.  It brought back memories of fun times.",
      "overall": "positive"
   },
   {
      "reviewerID": "AE7GUHCDQQ4UI",
      "reviewText": "Doesn't load after installation. Tried it on 3 different computers. Waited a while to receive it... was kind of excited",
      "overall": "negative"
   },
   {
      "reviewerID": "A48ABFDDRMKI8",
      "reviewText": "i love this game i have had the best fun with this game if it does not work try it on a laptopif u like racing game you might like this.It is kinda old so be expecting that but other wise other than graphics it is grait",
      "overall": "positive"
   },
   {
      "reviewerID": "A26B0P6K95SIKW",
      "reviewText": "Gift for my granddaughter.  Likes the game a lot, but prefers to just listen to the music & sounds.  We use it at my house on a separate computer (just for Lana).  Money well spent--provides hours of amusement & education.",
      "overall": "neuter"
   },
   {
      "reviewerID": "AZ3UWOC8QSO6C",
      "reviewText": "I have reviewed this software many times and I still think it isawesome.I continue to order more and more.The kids at my school love, love it.",
      "overall": "positive"
   },
   {
      "reviewerID": "A182S3ANC0W7DL",
      "reviewText": "I am an Ice Cream Truck Vendor (I lease out 20+ Trucks), and an the owner of a small business that distributes Good Humor Ice Cream in Dayton, Ohio. I purchased this program (as I do most Ice Cream related stuff) just to see what it was all about. I was pleasantly surprised... as there are exercises that allow you to run your own business within the game.  You have to restock, and consider expenses... and you either win or you can loose the day, in business, depending on your decisions. Great tool (game) to teach your kids business and some responsibility. It was also fun!",
      "overall": "positive"
   },
   {
      "reviewerID": "AY5Q951JAZAX9",
      "reviewText": "My grandson loves Thomas the train so this computer activity was just  right for him.  He dearly loves the activities that are on the program and takes joy in printing off his certificate when activities are completed.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1TL721YECDIM8",
      "reviewText": "Can not get it to play on my computer but works great on an old computer (xp or later). Otherwise fine.",
      "overall": "neuter"
   },
   {
      "reviewerID": "APDCEJMFDO2YT",
      "reviewText": "Such fast shipping, games is such great condition she even included two extra's so nice of her.Now all i have to do is start up my old windows 2000 to play it and ill be happy as a puppy with a chew toy :)i recommend everyone to buy from this company they are so nice, lovely little messages included and made my day so much better seeing how awesome this person/company is.",
      "overall": "positive"
   },
   {
      "reviewerID": "AFJ7A9CSEPZNY",
      "reviewText": "My son hates math!  But, he loves Star Wars and Jabba Math.  Would recommend it for other kids who find math boring and feel insecure in their skills.  It allows for several ways to solve the problems and appeals to the visual learner.",
      "overall": "positive"
   },
   {
      "reviewerID": "A14YVGE643TRJK",
      "reviewText": "I was searching for DS games and this somehow worked into the mix.This is a CD computer game.I did not play the game and cannot comment on it.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2H3TQWU51W1WE",
      "reviewText": "My son who hates doing math loves to play this game. I like the fact that you can also have two players so I can play against him to see his progress.You can adjust the voice and music volumes separately and it plays on my Windows XP which I know some have had an issue with.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3KO10N2ODLHBR",
      "reviewText": "My seven year old has had a lot of fun with this game while learning math at the same time! Bought it for him when he was in kindergarten and he still loves to play it. No problems with the noise of this game - no noisier than any other PC game.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1T98OCCYW6OBI",
      "reviewText": "The game doesn't save at all and that's really irritating because you can't turn your computer off without it completely deleting your progress. Also it turns on and off randomly so when you exit the game all of a sudden it pops back up again. My six year old  thinks it's fun but he gets frustrated with it.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3P758JGM12DD7",
      "reviewText": "Well, i remember playing this game back when it came out, i spent so much time just beating it over and over it was so fun",
      "overall": "positive"
   },
   {
      "reviewerID": "A1TBUSGCBTXWFC",
      "reviewText": "Came across this accidentally and took it home to play--thought it might be a good gift for a seven year old I know.  Games are fun, so far as I could stand the decibel level.  For me to hear the voices, the music was so loud that the total sound hurt my ears. If the relative loudness of the music and voices were reversed, this would be a better product.",
      "overall": "negative"
   },
   {
      "reviewerID": "A366EUKI8WMGYB",
      "reviewText": "I had wanted to complete my collection of NFS, and this pack just had a title that didn't have yet ... worth mentioning that for the price you sold it, was impossible not buy it, no matter if I already had two of three games.Regrets that only deliver in the USA but the shipping is fast!.With offers how are you, I always buy on Amazon.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2VBOZL2J83PCG",
      "reviewText": "i used to play these games all the time, downloading cars and all that business is fun but high stakes doesn't work on windows xp and nothing i've tried to fix it has worked but nfs 3 is cool too.",
      "overall": "positive"
   },
   {
      "reviewerID": "A31ZJPGGIEX3SV",
      "reviewText": "I really loved these games, and they were so much better for PC than for the old PS1.  I wish EA would resurrect Porsche for the new platforms.",
      "overall": "positive"
   },
   {
      "reviewerID": "A221V1CP1DVGRI",
      "reviewText": "I got this for my son so I have no idea how it was. He lives in Chicago now.It was a gift",
      "overall": "positive"
   },
   {
      "reviewerID": "ATNN4DDRIT7Y5",
      "reviewText": "The game arrived quickly and plays vey well on my machine. Bought this for my 5 year old, who is already a gamer! Thx much!",
      "overall": "positive"
   },
   {
      "reviewerID": "AI2SHH1PWGEUJ",
      "reviewText": "Had this game as a kid and figured it would be good for the little cousins. Plus it means I get to play it some more too.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1Z4X200ED17R4",
      "reviewText": "The CD is incorrectly stated as supported on XP but actually does not!  Waste of money. piece of junk never buy",
      "overall": "negative"
   },
   {
      "reviewerID": "A129SW886TYQ6H",
      "reviewText": "Wonderful logic and reasoning skills for children with puzzles, sound effects, and characters to motivate children.  I have used it with students for 15 years and they still love it!",
      "overall": "positive"
   },
   {
      "reviewerID": "A1SRVJNFWR0U9J",
      "reviewText": "I used to play this in Elementary School! It is a very fun game and even though I am 19 now, I still have fun playing the game!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2BY4WCZRIM2UM",
      "reviewText": "If you can get this to run, it is a fun and educational game.  This does not run on xp...a great dissapointment.  I wish this was indicated on amazon before we bought it.",
      "overall": "negative"
   },
   {
      "reviewerID": "A25C0NYV8WD775",
      "reviewText": "It was a good product and my children enjoyed it and it worked great was what i expected and i received it in the time they said i would get it!",
      "overall": "positive"
   },
   {
      "reviewerID": "A3Q9IUTBTBI7UH",
      "reviewText": "I have played Zoombinis since I was a child and I still enjoy this game very much, I just wish it didn't glitch on newer software such as windows 7.",
      "overall": "positive"
   },
   {
      "reviewerID": "A10CMR6B6QD60N",
      "reviewText": "I had this game as a kid in the 90s and played it religiously with my sisters around our Windows 95 PC. I recently bought it for my cousin's 6th birthday because I want her to build better computer and problem solving skills. Computers and games have definitely evolved since then, but this is timeless game that helps kids develop those skills in a fun way without math equations and spelling. Watching her play brought back really fond memories and made me want to play again. &#34;Whoever you are.... MAKE ME A PIZZA!&#34;",
      "overall": "positive"
   },
   {
      "reviewerID": "A2M64UKVOU9CWU",
      "reviewText": "The CD installs the game which doesn't actually run. You click the .exe file then they claim an error has occurred. I did this on three different computes, all with different operating systems.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1MYSISP73W2OZ",
      "reviewText": "These are the second and third installments in the Nancy Drew PC line and while they might not be as graphically stimulating as the newer games and little bit on the short (not too short) side, the originals have something the newer games sometimes lack; an in-depth intriguing mystery that actually takes place like an actual crime/mystery that you would need to put a lot of thought and logic into to actually solve; just like on CSI.The second and third installments: Stay Tuned for Danger and Message in a Haunted Mansion are a step up-- graphics-wise -- from the original Secrets Can Kill PC game, but pale in comparison to the newer games. However that's to be expected the late 90's versus the beginning of the second decade of the twenty first century.There have been some complaints as to the older version games not being able to play on newer OS, that would be incorrect.We have OS's Windows: XP, Vista and 7; we have Nancy Drew: Secrets Can Kill (original), Stay Tuned for Danger, Message in a Haunted Mansion plus almost the rest of the Nancy Drew PC line running on these OS's.If you computer's OS isn't smart enough to switch over to the formats for you you can try the following instructions below; otherwise the game will install, but will not play because it was intended to run a much larger file in a much smaller window (I know that doesn't make a whole lot of sense, but it is correct in the way I explained it).This is what you need to do if you have a newer computer/OS (Windows: XP, Vista, 7, 8) and you are trying to play this older model game: You need to first install the game. It will do a computer anaylisis and will tell you that your computer \"Fails\" under two categories 1.) Color Resolution and 2.) OS (Operating System), ignore and install the game anyway. If you click to play the game after the install and an \"Error\" message appears close it and manually change your computer's compatibility mode.To set your computer to run in Compatibility Mode: This can be accessed from the Control Panel; just type in \"Older Version\" in the Control Panel Search Bar and the link will show up. Click it. A Dialog box will pop up and ask which version of Windows you would like to run this program in, choose either Windows: 95, 98 or ME.The computer should ask you if you wish to save this profile for every time you use this particular program click \"Yes\" or \"Apply\".Also from the Control Panel or by Right Clicking on your Desktop under \"Screen Resolution\" switch your pixel resolution all the way down to 800x600.If for some reason you computer does not switch back to normal once you've ejected the game, then once again, just reset the changes manually. The same goes for the fact, if your computer does not automatically set itself back to an older version of windows and a smaller screen resolution when you play the game again; just do it manually, it literally takes two minutes, both ways.Regardless of how much the graphics may suck, any older model game can play on a newer computer/OS whether it's on a CD-ROM or a Floppy Diskette (as long as you have a USB enabled External Floppy Diskette Drive or you hard wire one into your Desktop).",
      "overall": "positive"
   },
   {
      "reviewerID": "A10N7L0GMRODUO",
      "reviewText": "I was impressed to find out that the game can be installed on Windows 7. I had problems with a previous install of the software. When registering it, the online feature does not work at all. Instead, you have to choose a different option of registering the product. Then once you complete the process, you can start playing the game. Chessmaster 9000 is by far the best way to learn how to be a more effective Chess player.",
      "overall": "positive"
   },
   {
      "reviewerID": "AFWPLXT2OD6H1",
      "reviewText": "seems to work on my xp machine, don't know why it doesn't work on other people's.  Only thing bad about this is that the graphics are not as good as the arcade version.  But what do you expect with a game this old?  Perhaps if it was written today, it would match the arcade graphics version.  Otherwise the game is pretty awesome and has many more configuration and play modes than the arcade version.  The instructions are pretty spotty, but if you press enough keys you'll figure out how and where things are (like F1 and F2 and F4 for example) if you use keyboard.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1P478YKNZYVXE",
      "reviewText": "This game actually has fair graphics and gives some decent 3-d endings but it really is short on characters. Scorpion, Jax, Sonya and Sub-Z return but that is basically it.The style of fighting is similar to UMK3 except that you can use weapons(somewhat)and move horizontally in the environment, which makes projectiles a bit less useful. The uber-boss, Shinnok, is actually a playable character and is far too easy to beat while the sub-boss, Goro, is next to impossible to defeat except with 1 or 2 specific fighters.Overall, I think this was one of the best MK games simply because it carries in the tradition of the glory days(MK 3).Note* This game did not work for me on Windows XP so beware, I also doubt that it will even run on Windows 2000. Unless you have a pre-historic operating system, you might do best to pick this game up on a console aka PS2.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1XOI72951IH9Y",
      "reviewText": "My Son is very happy, not only with the game, but with the quickness of service and delivery.  Than You .",
      "overall": "positive"
   },
   {
      "reviewerID": "A2890J1FHE76RY",
      "reviewText": "Ordered this for my son and was very disappointed when it did not work on our brand new CPU. It appears it was not compatible with our system software.  My son tried it on two relative's CPU, and it did not work on theirs.Good thing I paid only $4.",
      "overall": "negative"
   },
   {
      "reviewerID": "AJRHPTQ7TXPD6",
      "reviewText": "This game would not install on any of my seven computers. The installer is so dated that if it detects any hardware that it doesn't recognize (i.e. modern hardware), it aborts. Tried all the user forum tricks I could find.  None of them helped.  Even the publisher has abandoned this game and no longer supports it.  Complete waste. Needless to say, my son was very dissappointed.  Don't bother with this one.  It's deprecated software meant for deprecated hardware.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1J102IQ2SE7R2",
      "reviewText": "The only reason I gave it one star is because it arrived to my home in a timely fashion. The game itself didn't work and there was no assistance from THQ to get it to work",
      "overall": "negative"
   },
   {
      "reviewerID": "A14L9HK0DK3SAI",
      "reviewText": "wish I had known that my computer wouldn't support the game,  it is an old game and i have tried everything.  trying to open in different operating system etc....I should have checked.",
      "overall": "negative"
   },
   {
      "reviewerID": "A30W22RFAJSP4I",
      "reviewText": "We're happy with this game.  My son says that Gameboy games are harder than DS games, but he still likes to play it.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1VUPAQRYP1VAG",
      "reviewText": "My seven year old grandson loved this game as well as another.  What more can I possibly say?  Really  Really!",
      "overall": "positive"
   },
   {
      "reviewerID": "A34UGG0WDKRTQF",
      "reviewText": "This is a great kids game for finding hidden objects. it is even great fun for adults too! It is all the I Spy's tied into one to find hidden objects and to solve puzzles.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1WJW2OIR5BZ58",
      "reviewText": "This product arrived before it was scheduled to. However, the box was damaged and did not appear to be in new condition. It did look like it was unused though. The item only came with the box and disc for the software. No instructions of any kind. That was disappointing. Seller was excellent, product was good.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2NQXA21O64HDZ",
      "reviewText": "My 13 year old grandson thinks it's the coolest thing ever. Installing it was a massive pain in the arse. If you are going to save it to disc, make sure you have RW (rewritable) discs. We still haven't gotten that right. May need to initialize new discs? Anyway, he's happily working on a 3 part epic game and we'll get it sorted eventually. Just be prepared to be patient!",
      "overall": "positive"
   },
   {
      "reviewerID": "A261CI99KET69W",
      "reviewText": "I did a full review on my YouTube channel, but I'll review it here as well. Video Game Tycoon is a game where you're able to create your own video games. You can also burn them to a CD and show them to your friends. While this does sound awesome, the execution is not done all that well.The first thing you will notice is how dated the graphics are, even for 2006. Deus Ex (released in 2000) looks much better than this does. The animations are sloppy and the environments look bland.For the audio, the sounds effects are very stock and unimpressive. The music for the game is also pretty generic. However, you can put your own music into the game that you create if you change the format of the audio file.The game-play is decent enough. Being able to create your games from scratch is enjoyable. There is a good amount of customization you have when creating your games from the objectives of the level to the rewards for beating it. As you complete certain tasks, you unlock new features which give you much more customization to the various features of the levels.However, the mechanics are very limited. After testing out your games, you realize that the games feel very clunky. The controls are some of the worst in video games and there is absolutely no way to change the key bindings. Also, there is nothing really &#34;tycoon&#34; about it. You're not making games to sell them and there isn't any business aspect to it. It's very strange considering the word &#34;tycoon&#34; is in the title.Overall, I feel disappointed with this game. The concept is cool enough, but the execution was not up to par. However, I recommend you try this out for yourself and see how you like it. With the simplified mechanics, it's suited for younger audiences.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A1VJVU8YSBPAY7",
      "reviewText": "We had this before and lost it.  I bought it again because my son wanted to play it.  I know he loves the game so I gave it 4 stars but it is useless unless I can figure out why it won't install.  I have looked for troubleshooting answers but really can't find minimum requirements on it or anything to help.  I obviously need to find someone under 22 years of age to tell me what the problem is.  Feeling old and out of my element.  This should be easy so that is frustrating but I don't think I ordered it wrong or anything is wrong with the product.  I'll find out.",
      "overall": "positive"
   },
   {
      "reviewerID": "A25M791P4YG471",
      "reviewText": "DO NOT BUY!The package inside was the wrong game? Save  yourself the money. You won't be playing civ city rome any time soon with this buy",
      "overall": "negative"
   },
   {
      "reviewerID": "A1E2ODNEYJ1UWX",
      "reviewText": "So much fun helping sick animals! You get to work with a variety of animals, not just dogs and cats, which I really appreciate. You get to work with reptiles, amphibians, birds, at some points, even a pony, a fish, and a spider! This game has it all! It also very educational, as you can learn a whole ton about the many different things that can go wrong with pets.",
      "overall": "positive"
   },
   {
      "reviewerID": "A11DR0TXTI0P0L",
      "reviewText": "I am a huge Civil War buff - I wrote my senior thesis on the military occupation of New Orleans - but even I found this game difficult to grasp. The AGEOD system needs a lot of streamlining and, though I prefer substance over style, could use a little more flash. A battle involving over a hundred thousand men should be depicted by something more satisfying than a green progress bar and a report full of poorly presented stats.That said, I respect the game's ambition and wish that there were more grand strategy games that tried to have this much fidelity to the period.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A214Z566V6QEDF",
      "reviewText": "I don't know about the game because I can't play it.  I have widows vista and I can download the instructions, but error comes up when I try to play the game. I contacted Ageod and they said I am the only one haveing trouble. The internet says that Vista has a lot of game problems.  I just wasted my money on this game.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1NC9PQCE3NOGA",
      "reviewText": "It won't run on the new operating systems, so if you ever had the chance to play it, just keep the money and the memories.",
      "overall": "negative"
   },
   {
      "reviewerID": "AJRJ8E38CRB7C",
      "reviewText": "If you started playing computer games in the early to mid nineties (e.g. Myst, Zork Nemesis) and think that most contemporary games are too violent, too \"real\", and too technical, then you're going to love this! No idea why I never played this back in the day, but it's awesome! A nice, puzzle-solving, dialog-driven, humorous (one of the voices is John Cleese!), not too linear game where you walk around inside a giant spaceship and figure stuff out at your own pace. It runs fine on Windows XP 32bit, but you might need to download the Cinepak codec to make some of the videos work.",
      "overall": "positive"
   },
   {
      "reviewerID": "A27QRTHZLBA61M",
      "reviewText": "This is a very interesting game. It has a very neat art style and plays a lot like Myst. The main difference being the insane logic in this game. You will need to be in a &#34;Hitchhikers guide to the galaxy&#34; mindset to get anywhere in this game. The crazy events, and wacky humor in this game make it extremely entertaining. I would recommend this to any Douglas Adams fan. if you do get it, prepare to think WAY outside the box .( or find a walkthrough online...)",
      "overall": "positive"
   },
   {
      "reviewerID": "AVTLLY67TSLU3",
      "reviewText": "Nowhere in the description does it tell you that it won't run on any program newer than Windows 98. I built a gaming computer that would have cost over $3K if you could buy anything close to it in a retail environment so I know it isn't my machine. VERY disappointed as I am a very big Douglas Adams fan.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3DYVJC57FX8EH",
      "reviewText": "Great soundtrack, great graphics, amazing AI game commentators. As for playability I still prefer Pro-evolution Soccer for Nintendo Wii, because we can manage the whole team actions just by pointing at players and dragging their positions to where we want them to run to.",
      "overall": "positive"
   },
   {
      "reviewerID": "ADOCLYEFV2PKH",
      "reviewText": "I consider its not your fault but a game from this time 2012 and 2013 must work for Windows 8",
      "overall": "negative"
   },
   {
      "reviewerID": "A3P2DVO3OG6MIN",
      "reviewText": "I liked this game a lot. I ordered the Limited Edition which has some extra NFS Edition cars and Challenge Series.If you are looking for some real thrill and real life driving, go buy this game.Amazing graphics ( courtesy of Frostbite Engine)Amazing soundtracks and effects.",
      "overall": "positive"
   },
   {
      "reviewerID": "AX0VECEWD77TF",
      "reviewText": "Got here on time and got here a day early before they said it would and came in nice packaging.",
      "overall": "positive"
   },
   {
      "reviewerID": "A31K5W6NWK68OA",
      "reviewText": "Not as good as X-Box version but I hear that in 2014 all games that are for a PC will be exactly l;ike the X-box and Play Station versions. I sure hope they improve.",
      "overall": "neuter"
   },
   {
      "reviewerID": "AQ6WW45IHO83P",
      "reviewText": "This is the best RTS game thats come out for a while. Solid game that keeps you interested and having fun that said its a Citysim type which won't appeal to everyone.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2M8JTIST6FPZZ",
      "reviewText": "4 Stars because they like it and play it often enough so don't feel like money is wasted. I got them one each so they can multiplay with each other.",
      "overall": "positive"
   },
   {
      "reviewerID": "A6XUMA60GD7OZ",
      "reviewText": "I have been unable to play this game.  Unisoft has made it unplayable if you are not a techno whiz. ( I have tried several times to get it up and running.)  I just want to play in my home not on the internet and for some reason it will not load on the computer.  I probably will never buy another UNI-SOFT game or product..",
      "overall": "negative"
   },
   {
      "reviewerID": "A2IU72XM9F49P6",
      "reviewText": "This game is not for everyone.  If you only enjoy constant fast paced FPS games, this is probably not for you.  But, if you've dabbled in Empire Earth, AOE, Age of Mythology, and enjoy these economy based warfare games, definitely give ANNO 2070 a shot.There is a learning curve, particularly if you are a newcomer to the series.  Essentially, this game is about meeting the needs (food, drink, belongings, entertainment, community, etc.) of your citizens, which become increasingly demanding as they rise from the ranks of common workman to something equivalent of CEO.  With their progression brings higher taxes income, yielding a stronger economy capable of building and supporting an impressive military.  Warfare is not necessarily the focus, or even the majority of the fun, in this game, but it still gives the option for ship, submarine, and aerial combat, with several units of each type available.  You can even go nuclear.  It's pretty sweet.There are three \"races\" of people.  It's a bit like Starcraft in that they can each build their own units, and have their own specific needs.  The first group is the ECOS - they are the liberal hippy tree huggers who care only about thee environment, and turn unhappy if the ecobalance becomes too polluted.  The 2nd group, the TYCOONS, are the seal clubbin' oil drillin' conservatives who care only about making money no matter the cost.  Finally, you have the TECHS, a faction only concerned with technological research.  The TECHS are featured moreso in the expansion (ANNO 2070: Deep Ocean), but are still important for development of ECO and TYCOON needs as they advance.  I highly recommend the expansion if you play this and find you like it - it adds so many new ways to develop your cities.I love this game.  I've always been a fan of city builders, but this one (like ANNO 1404) has really drawn me in.  I've put in weeks worth of hours on it and am still playing.  The campaign missions are fun, but the real joy lies in a continuous game.  Once you are comfortable playing, you can spend literally hours on a hard continuous game with 3 AI players, a pirate base, and a warship hellbent on your destruction.  It is still a challenge even after playing for over a year.  I think a lot of what makes it fun is that no two games are ever played the same way.  There are different ways to power your city, different upgrades to utilize, different ways to destroy your opponents.A quick note about DRM: It sucks that this game must be played with a constant internet connection.  There is a multi-player faction, but honestly I've never even tried it.  Single player is what I enjoy, and there's no reason to be online for that.  Still, I give it five stars, because the game itself warrants it IMO.",
      "overall": "positive"
   },
   {
      "reviewerID": "A8SSL0QMV2VY1",
      "reviewText": "I finally broke down and bought this game.  I have played all of the other titles in the Anno series so I was reasonably confident I would like this installment.I did, but...First off: no CD-KEY printed on the manual cover (a .pdf file to boot).  I spent the next 3 days exchanging emails with Ubisoft to get one.  This entailed screen caps of receipts, manual covers and proof of a real CD (they were very helpful).  Ok, Now I can play... NOT!  Every time it loaded, it Crashed To Desktop (CTD).Ok, so now I have spent another day looking up info on the web about that.  I had to lower my computer resolution to 800x600 AND change some of the graphics settings to low AND had to turn off stuff in the uPlay settings.Ok, finally got a profile setup (and you only get 1).  Now, I get to play... NOT!  Every time I accept a side mission it CTD's and I have to kill the proses just to exit the game.I can put up with a lot of stuff if the game runs, but I cannot deal with having to save before every quest, mouse over on the info tabs, etc just in case my game crashes.  Hell, I cannot even play single missions without it crashing.  I was hoping the expansion would help stabilize it, but I have decided to send them both back.I was willing to put up with uPlay, even if the DRM sucks.  What do you mean I can't change my hardware?  Ok, I have a laptop and thought that would be ok.  Till I found out that 3 is the limit.  I do plan to get several new computers over the next decade.I really wanted to play a more modern feeling Anno.  From what I have played, its a fantastic game, but...At least I still have 1404 Gold.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3HR8L31S8AFF6",
      "reviewText": "I picked this rating because, although this game is redundant in build, the scenarios do change. It is challenging in both multiplayer and single player. You get a world even every so often and only a limited time to do the event. You get mad experience points for it as well.So if you like builder games that come with some serious challenges, unlike its predecessors, this game will keep you busy for hours and hours and hours. Once you start you keep pushing to get to that new level, that new tech, that new fleet of ships. Ubisoft did good by this one. Pick up a copy and if you want to play together? Just coment and we certainly can arrange that.",
      "overall": "positive"
   },
   {
      "reviewerID": "AA9LU15A9PX9E",
      "reviewText": "Game can be fun, challengeign, and everything on the box, but its not easy to learn, not even with the manual(which is online)",
      "overall": "neuter"
   },
   {
      "reviewerID": "ATI21V0A8K25G",
      "reviewText": "Good game. Good graphics. A bit of a learning curve. It arrived way before estimated time. High speed connection and newer gpu for best outcome.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1JPYSVXO2PV36",
      "reviewText": "The DRM is atrocious.  No one should buy a game with such a cynical and invasive wrapper.The game itself seems solid.  The interface is extremely cluttered; their UI/UX designers didn't do nearly as good of a job as they did with previous Annos.  If hell freezes over and Ubisoft decides to buck the AAA trend of putting their games in garish, grotesque cages, I'll be first in line for the DRM-free rerelease.",
      "overall": "negative"
   },
   {
      "reviewerID": "AFVETWC6I3BLJ",
      "reviewText": "too much work to set up and play requires internet to play and too many items to set to play.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1EO9BFUHTGWKZ",
      "reviewText": "I liked it and had fun with it, played for a while and got my money's worth.  You can certainly go further than I did but I got frustrated with the fact that here we are in this new start and still taking from the earth rather than living with it. Better than simcity in that respect and maybe the best we could hope for.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2RYQIFIOUDCPF",
      "reviewText": "This was actually for my boyfriend, but he loves it. He enjoyed Anno 1417, & this one did not disappoint either. You do get to go under water this time which was fun. And the graphics are very stunning.",
      "overall": "positive"
   },
   {
      "reviewerID": "ADIFU04E5VS5",
      "reviewText": "Awesome game, but all the DRM issues really have made some issues with the game. You have to have it attached to a uplay account in order to even play the game... so, similar to Diablo 3 you're forced to have internet access in order to launch the game, even if you want to play single player.At one point I've also had an issue come up that said the game was &#34;incompatible with my current OS&#34;... if you run into the same problem, launch the game as Administrator and it will work fine. Also... THE GAME CODE WILL NOT ACTIVATE ON STEAM. I got this on amazon to try it out and if I didn't like it I wanted to sell it, but having it required to attach to your uplay account basically didn't allow me to do that. So I'm stuck with a game with insane costs for any DLC...If you like sim city style games, I'd pick this one up... but wait for a steam sale and get it through there so that the dlc's are also at a reasonable cost as well.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A23LPWYLCEXQ4U",
      "reviewText": "Great game. Very complex and can get hard to handle with larger cities but i like the challenge. Interesting missions",
      "overall": "positive"
   },
   {
      "reviewerID": "ABU5YE20PHC8R",
      "reviewText": "Definitely one of the best products UbiSoft has released.  The game is very similar in its interface to its predecessor: Anno 1404 but its story line and the scope of the game is far more developed.  The player is able to vote in world council initiatives that directly affect in-game play as well as participate in random missions that earn the player career points enhancing the player's game play.",
      "overall": "positive"
   },
   {
      "reviewerID": "A6Q1IUFSN2E2D",
      "reviewText": "I got this game on Amazon because it had a very good price, but upon receiving it i downloaded the game, but it would not run. It said it needed updates but the auto updater would not work. I was able to get a full refund very quickly and I am happy about that but very disappointed that the game i had anticipated so long would not run.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3KSKDF6K48NU6",
      "reviewText": "A bit of a snoore-fest. I played it for a few hours but felt like I was back in kindergarten.Perhaps I didn't give it enough of a chance, but when I have nearly nil motivation to keep playing it, I just cant waste the time on this title that it may need or deserve in order to want to keep going.",
      "overall": "negative"
   },
   {
      "reviewerID": "AHHPSZAVRAQ9D",
      "reviewText": "I love the Anno Series from the first one to this one, but holy crap that whole Uplay login process is ridicules.I mean what happened to just playing a game on you computer separate from the internet.other than that this is a great time waster, the hours fly bysome of the newer ways of this game are confusing for even long time anno players.Anyway I do kind of miss the old school 15th century styleAnyway I would really only recommend this for Anno allums that have to have an Anno fix.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A2L939JSLGHBP6",
      "reviewText": "If you buy this game, you will regret it.  If you change any major component in your computer 3 times, the game will stop working permanently. And it will never work again. So, if you plan to play this game a few years from now, you will not be able to do so.  Is this some horrible bug? No - this is intentional. It is a scheme to get people to buy the same game over and over again.  This should be illegal.  So, if you want to actually play games you buy, DO NOT BUY THIS GAME!!!!!!",
      "overall": "negative"
   },
   {
      "reviewerID": "A2VLH0R0UP9ULJ",
      "reviewText": "This is a great real-time supply chain management game.  However, the play is novel and there is a steep learning curve.  Some reviewers have criticized the campaign for being too restrictive.  That is not a fair criticism.  The first 3/4 of the campaign is basically a tutorial.  The campaign holds your hand from objective to objective so that you can get a feel for how to succeed.This game really eats up time.  1 hour is about the minimum amount you would want to spend per session.If you like tinkering and optimizing and losing yourself in a complicated game, then you might really enjoy Anno 2070.I think this game should really appeal to people with an inclination to programming who like developing and optimizing algorithms.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3UNTT3TJ8RC45",
      "reviewText": "This is a very fun game single player is difficult but the multiplayer makes you feel like you lived a sheltered life.  It reminds me of first generation Sim City with awesome graphics.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1LMJ9W8UX1H5B",
      "reviewText": "I've bought and played ALL of the ANNO games since 1602, and spent more hours than I can even count building massive empires with extremely complex trade routes. I was thrilled to see another installment released, but I absolutely will NOT pay for something that limits my hardware changes and installs.Wake up UBI, look at all of your other software title reviews, both here on Amazon and on gaming sites. People are not as stupid as you think, and will simply find a different game to fill their time with and throw their money at if their freedoms are inhibited by your software.By adding DRM you've actually promoted the use of piracy instead of reduced it, because those that really do want to play it will find a way.",
      "overall": "negative"
   },
   {
      "reviewerID": "A29BCFRLQ33TY2",
      "reviewText": "Well, I read some ratings before i purchased this game. I watched video on youtube, and  figured I could figure out how to play. Well, I could  not. And as the other reviews state...there are no instructions inclueded.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3IPBPB0Q9O5ZR",
      "reviewText": "I can&#8217;t stop playing my wife is going to through it out soon. It was worth the money to buy it.",
      "overall": "positive"
   },
   {
      "reviewerID": "AV969NA4CBP10",
      "reviewText": "I have played the old anno 1701 AND 1503.  this game looks great but is more complex than the previous versions of the game. I found a lot of things lacking such as the sources of power and an inability to store energy with batteries or regenertive fuel cells as buildings in the game need power. Trade is about the same. My main beef with this it requires an internet connection. Other than that it has wonderful artistry and graphics. It is the same as anno 1701 but set in a future world where global warmming as flood the land and resource scarcity has sent human kind to look to the deep ocean for valuable minerals. I recoment the deep ocean expansion or complete if you get this. I found the ai instructor a little corny but other than that the game has some real polish. I wrote my 2 cents worth on suggestions on anno 2070 wiki and you can read 3 pages on that for game ideas I had.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1WK5I4874S3O2",
      "reviewText": "I bought this game thinking it would be pretty cool and that i might play it for a  week or two and be done.  Boy was I wrong! From the moment I finally got the gamed Fired up (the other commentors on this are right, it takes forever and u are forced to create an account) I watched as it booted up I could tell right off the bat that ALOT of thought went into making this game. If you have ever played Sim city, then this game is a must try as you will easily navigate thru it and its multi layers. I have been playing htis now for a month straight, and I am STILL discovering layers of complexity in the game. There are a few things in the game that could used tweaked, but all in all this is a 5 star game.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1EHUIMKXQ45NX",
      "reviewText": "It was a lot of fun at first but after a few days it quickly got repetitive and really unsatisfying. There isn't much gratification in playing this game. I haven't touched it for months now. No real incentive to replay.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A2HD75EMZR8QLN",
      "reviewText": "Installing the game was a struggle (because of games for windows live bugs).Some championship races and cars can only be \"unlocked\" by buying them as an addon to the game. I paid nearly 30 dollars when the game was new. I don't like the idea that I have to keep paying to keep playing.I noticed no improvement in the physics or graphics compared to Dirt 2.I tossed it in the garbage and vowed never to buy another codemasters game. I'm really tired of arcade style rally/racing games anyway.I'll continue to get my fix from Richard Burns Rally, and you should to. :)http://www.amazon.com/Richard-Burns-Rally-PC/dp/B000C97156/ref=sr_1_1?ie=UTF8&qid;=1341886844&sr;=8-1&keywords;=richard+burns+rallyThank you for reading my review! If you enjoyed it, be sure to rate it as helpful.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3UR8NLLY1ZHCX",
      "reviewText": "If you like rally cars get this game you will have fun.It is more oriented to &#34;European market&#34; since here in America there isn't a huge rally fan party. Music it is very European and even the voices from the game very &#34;English&#34; accent.The multiplayer isn't the best but it works just ok.",
      "overall": "positive"
   },
   {
      "reviewerID": "AE5R88W48E02C",
      "reviewText": "I was in punchdrunk love with the concept of DIRT. I loved the dirt tracks and the specialty racing vehicles and chopped up pickup trucks. I was deliriously giddy with racing garbage trucks in the desert! I H+A+T+E THE STIFF PRECISION LEVEL AND SKILL REQUIRED OF GYMKANA and racing on blacktop! This game is the stupidest ripoff ever foisted on a trusting consuming public. I even hate the dirt sections in this pathetic lame hurting loser. Go someplace far away.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1INA0F5CWW3J4",
      "reviewText": "1st shipment received a book instead of the game.2nd shipment got a FAKE one. Game arrived with a wrong key inside on sealed box. I got in contact with codemasters and send them pictures of the DVD and the content. They said nothing they can do its a fake DVD.Returned it good bye.!",
      "overall": "negative"
   },
   {
      "reviewerID": "A1DLMTOTHQ4AST",
      "reviewText": "I got this version instead of the PS3 version, which turned out to be a mistake. Console versions of games look 95 percent as good as their PC versions, but you do not have to deal with driver issues and the numerous things that can go wrong with windows. First off the installation takes about 30 minutes, which is ridiculous. I have never had a game take this long to load, Shift 2 took about 20 minutes which seemed too long also. Next many of the latest games for PC are forcing you to have an internet connection in order to install the game, regardless of whether you want to play only offline single player games. Shift 2 unleashed is also like this, so be forewarned. Internet requirements are not prominently displayed on the boxes. The game pushes you, but does not require you to, sign up for a Games For Windows Live account, which is required to get the game patches and updates. More time wasted signing up for that. Finally after about one hour the game was up and running , but the menu screen text had red blocky borders, and the sun in the game screens was ugly pink red, with red reflections on the car and everywhere. So more time spent googling to find a solution to this. I had to download a hot-fix driver update for my AMD videocard driver, which solved that red text and sun problem. Finally after nearly 2 hours I was able to play the game, which is perhaps the prettiest racing game I have ever played. Magnificent graphics, and fun excellent gameplay. Good forcefeedback effects with a steering wheel, and excellent sense of speed and immersion, makes this a top notch sim racer with just a hint of arcade feeling to it.I was really, finally enjoying the game , when suddenly about 30 minutes in to a race the game suddenly crashed. No error message or anything, it just hung up and crashed to desktop, under windows 7. I later tried it with Windows XP on the same machine, and it crashed less frequently, usually only when exiting the game, but random crashes really kill the fun of a racing game, since it might not crash during an entire 20 lap race or it might crash on the 2nd lap.It is a great game when it works, and if you are lucky enough to have a machine that it runs stably on then by all means get this game. But hang on to your receipt just in case.I am tired of fiddling with my computer trying to find a totally reliable setup for this game, so I think I am going to buy a copy for my PS3, which has never crashed, in over 3 years of game playing. I have been buying the top notch PC versions of videogames and spent thousands of dollars over the years on faster videocards and cpu's , but I have finally grown tired of fiddling with incompatibilities of hardware and software, and now game publishers demanding that you have an internet connection as well as providing a long serial number, utilizing gigabytes of harddrive space, 30 minute or longer installation times ( it takes less time to install Windows 7 ) , and requiring you to sign up for their online service and game store, and still you have to put that stupid little DVD in your computer everytime you want to play a simple game to relax. I am pretty much done with PC gaming, since the consoles are so much less hassle, and they have \" good enough \" graphics that the diminishing returns of costly higher resolution better antialiased higher framerate graphics is not worth it. When the PS4 and Xbox 720 come out, I think the law of diminishing returns will be even more evident.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A25K6I70BEHL1W",
      "reviewText": "Pros:The game is about driving all sorts of vehicles on all different terrain, and at that the game does very well. There are a number of different vehicles to unlock in each vehicle category and the tracks range from asphalt to dirt to snow, some mixing the various terrains in a single course. If anybody has played any of the Colin McRae Rally games, or naturally any of the previous Dirt games, they should feel right at home* (see Cons for *).The game basically has the player build up his fame to gain more sponsorships and be invited to tournaments and open new seasons. In the first season you are shown all terrains types and give the opportunity to learn gymkhana (~stunt driving~).The graphics are polished and high quality, especially on the vehicles, and engine audio is up to par.Gameplay is fairly straightforward, yet quite entertaining. Smashing your and opponent's vehicles is a ton of fun and damage modeling is well done.Its just fun to drive and crash in the game. The game is very \"modular\" and can be picked up to play for just a short while or you can go all out and spend hours and hours.Cons:Gameplay can get repetitive, and even if the type of event is switched nearly every other race, you get to replay the same tracks, a number of times in different events (which are \"different\" really only by name).Car feel is somewhat bland, most cars in the same group feel very similar or nearly identical, the biggest difference you will feel is the stopping distance increase with more horsepower of the car. By contrast, this also makes it weird when a car actually behaves quite differently than the others, such as Ken Block's car or the Original Mini Cooper.In conjunction to the above, car handling is a bit weird at times, might be me, using a keyboard, but, during a normal dirt rally stage, you pretty much cannot recover from a real handbrake turn. Not sure if it is because of car tuning or abs still on (abs should not matter, but it's the only thing I have on) but once the car's back-end has slid around past say 20 degrees off center, the slide is irrecoverable. Does not matter if you apply full opposite lock, does not matter if you break, accelerate, or just let go of the gas pedal, does not matter what type of turn it is (shy of a hairpin), your call will keep sliding in the same direction, potentially getting more sideways, until you crash or slow down to 10 km/h (6mp/h).Games for Windows Live - whenever you see this logo, be afraid, very afraid! In Dirt 3, you will HAVE TO have or create a Windows Live account, or you WILL NOT BE ABLE TO SAVE THE GAME. Or play online for that matter. This is just some crappy DRM scheme and I was quite sad to find out about it, as this, plus having to always have the dvd in your drive, makes just booting the game an annoyance. Once all is set up, its not that bad of a hassle, but still, why punish players that buy the game?The menus and animations, and introductions will drive you up a wall. The are cool the first 100 times, -_- , not allowing me a way to skip them is just cruel. You will notice this the most when you enter a race: unskippable animation to show you your car, 1 second pause, menu pops up with \"Race\" and \"Mod car stuff\", etc, and then another 5 second animation to show you your car again, but on the starting grid, 1 second pause, and then its time to race, 3 second countdown till you can actually drive. Also every time you select an item from the race menu (those triangle things) again, animation, 1 second halt, here is what you ordered, oh new selection, sorry that need another animation.* People that were used to the Colin McRae games might be wondering where real rally went in the game. The one with the stages, and having to spend time in between races to repair damage, having to complete a few stages of a race with a half broken car. The special feeling of being part of the WRC is mostly gone. Now most races are on the short side (they do get longer as you progress), can be restarted at any point and no previous-race progress is lost, and even more there is the rewind feature. Naturally you do not need to use these mechanics, but just being there spoils the mood.Other Thoughts:It may seem like I slammed the game pretty hard, but then gave it a strangely high mark. The point is that the game is good, quite good, despite all the above issues, which all in all are actually fairly small things. Plus the cheap price bumps it up a notch.You will want to immediately turn off all assists (keep the driving line and abs at first, then decide for yourself) else the car basically drives itself.The loss of a true rally mode may be a make it or break it deal for somebody. The game is really fun, the driving is very fun regardless of the issues stated above, yet you will miss good ol' Colin.I would have given the game 3.5 out of 5, just because of the great stuff lost over the years, but I realized that it was not fair to compare it with something that (unfortunately) it is not anymore.For $12 it's a great deal.",
      "overall": "positive"
   },
   {
      "reviewerID": "A361M14PU2GUEG",
      "reviewText": "I had Dirt 2 on Xbox 360 and it was an okay game. I started playing games on my laptop and bought a few new games to build my collection. This game is very fun to play. It is so much better than Dirt 2. If you like racing games you should check this out. The graphics are perfect on my compter.",
      "overall": "positive"
   },
   {
      "reviewerID": "AW1X78QFLX7WL",
      "reviewText": "Yeah, well, the interface on D2 is way more immersive, but D3 gives you many more and way cooler cars. The problem is you gotta pay for some of them. Now that ain't right. Anyway, this is a furiouse game with lots of eye candy and exciting race action (wow, I sound like a commercial.) You don't want to skip buying the xtra cars cuz they're way fine, but jeez man, that's more moola. So the camera work is still weak. Like why can't the playback just playback a good TV view. You miss a lot of action cuz you're getting a close up of a wheel spinning -- big deal (same with the playback on D2.) I'd buy it if I were you, but then there's no one like you... Right?",
      "overall": "positive"
   },
   {
      "reviewerID": "A2UTRVO4FDCBH6",
      "reviewText": "Overall this is a well done racing game, with very good graphics for its time period. My family has has enjoyed playing it a great deal. I personally think a steering wheel controller is almost a necessity for this game, but an x box type controller would probably work. The keyboard would be almost impossible, and not very fun. The \"windows live\" system detracts greatly, since you must log in and be online to play or save game progress. There was a mees up with my \"Live\" log in and the game would no longer accept my activation code and I had to rebuy the game if I wanted to play. There is no customer support at all. Dirt 2 suffers from this serious flaw as well. 4 1/2 star game 1 star Windows Live feature.",
      "overall": "positive"
   },
   {
      "reviewerID": "A37DL3ZB4BKUDB",
      "reviewText": "I have been a fan of Dirt 3 ever since Dirt 2; (my fav). In Dirt 2 I have 100% of the game completed & on level 73. I plan to do the same with the 3rd game. Racing in snow is interesting. the ONLY thing I'll miss in Dirt 3 is my favorite car from Dirt 2; the Nissan 350z",
      "overall": "positive"
   },
   {
      "reviewerID": "AN3YYDZAS3O1Y",
      "reviewText": "Loved playing Dirt 2 and I thought the graphics were good.  Purchased Dirt 3 as an addition to the other...and the graphics are absolutely \"Gorgeous\"  If you liked Dirt or Dirt 2...you are going to love Dirt 3.  The game was easier to configure with my Logitech wireless rumblepad...and with my EVGA GTX 580, and all detail set to full on graphics at 1920 x 1080 I get over 100 fps.  The game looks good, plays well and is a blast!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2J53LRNT6T656",
      "reviewText": "I bought this game for my husband about 2 years ago. He likes it because the graphics and the control is very realistic.",
      "overall": "positive"
   },
   {
      "reviewerID": "A19WBAPXGFSFVR",
      "reviewText": "I recomend this game to any racing fan or rally the game has a great gameplay the servers online are great and the graphics are good rate it 4.5/5.0 because you need to make a 1GB update :-)",
      "overall": "positive"
   },
   {
      "reviewerID": "AQTC623NCESZW",
      "reviewText": "I can't tell you what a piece of dog**** this game is. Like everything else Microsoft makes- it doesn't work. When are they going to take a cue from Apple and make things that actually work the first time and every time. To log onto this game they make you jump through a series of hoops that takes like 15 min. to accomplish. If you want another disappointment from Microsoft, buy some \"Games for Windows Live\" games.  I just wanted a simple arcade like driving game when I have a young boy visiting. If that's what you want, don't buy this. If you want to hire a consultant to help you run this game, then buy it.  oh, one more thing, every time I do get this game to play my joystick stops working (there's Windows 7 for you)",
      "overall": "negative"
   },
   {
      "reviewerID": "A3GB9OF65GKZF7",
      "reviewText": "i ran it and had to fix 2 dills. then when it did run it crashed in the developer creditsDO NOT BUY THIS.",
      "overall": "negative"
   },
   {
      "reviewerID": "AZQ5WJ6236H2N",
      "reviewText": "I first owned this game on XBox then PS3 and was extremely impressed with the fun factor. The realism isn't all there however. The issues I have are Group B is horribly slow and weak. Playing the game with a sim wheel is impossible because of the preschool degrees of steering. So I thought I'd buy the PC versionAs for the PC version, I can't even get it to play. My pc is more than capable of running this it just has an error every-time.For someone with any interest in rally I suggest Richard Burns Rally. Its so good it has me actually doing real rallys in real life.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3MJ7GZ3GQNLZX",
      "reviewText": "I have a decent gaming computer-I7 CPU  w/ cross fired 5770s , 8 gigs of ram , etc.  I like using it for Flight Simulator X which is quite demanding but works flawlessly.  I wanted to check out DirectX 11  graphics so I purchased. DIRT3 . This game freezes all the time-especially when using the camera view from inside the car. Switching to DirectX 9 works but the graphics aren't as good. I went online and found ALOT of frustrated users ; I hate Games for Windows Live anyways so this game is heading for the trash.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2P90LXYXG2DNY",
      "reviewText": "I'm not sure why Codemasters didn't release the PC DVD in retail stores in the U.S., but the game is very fun. I could have ordered the PC DVD from a couple of places for $49.99, but the seller at Amazon had it at a great price. I really like racing games and this is a different format for me, because I usually choose road racing games. The in game trailers for this game, and the option to play Gymkhana in a Rally game is great.",
      "overall": "positive"
   },
   {
      "reviewerID": "A4ZP6L59MJJ16",
      "reviewText": "I Had been looking forward to this game for a long time. I own all the previous versions and all still are good games. I was somewhat disappointed in this version. I expected allot better game play and graphics. The game play is somewhat boring compared to previous versions as well as the graphics. DIRT 2's graphics are much better as far as detail in the particles such as dust and rocks during game play.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A1QJJU33VNC4S7",
      "reviewText": "I initially gave this one star because it was crashing on me constantly but I recently narrowed it down to a plug-in I was using for my porsche wheel. Game plays well and looks gorgeous when image spanned across three monitors. I would have given it five stars if it wasn't for the annoying Microsoft Games for Live application that makes you go through hoops to set it up and causes problems of it's own (occasional crashes)",
      "overall": "positive"
   },
   {
      "reviewerID": "A2JLT2WY0F2HVI",
      "reviewText": "I still haven't figured this one out. Did everything as instructed but the game never installed. Strange. Since I don't like to rate on something I couldn't get to work, I'll just say that I didn't like it because I couldn't get it to work :P For those that did manage to get it installed, I'm sure it's a great game. I had the first Dirt and it was a scream! Too bad this one bombed. Maybe a bad disc...",
      "overall": "negative"
   },
   {
      "reviewerID": "A1KJG366JWVMGX",
      "reviewText": "I play this game with friends via LAN. It works well, and is a lot of fun to race. I like the fact it's not super serious, and the tracks are varied. It is fun to race in the snow, or on gravel, during rain, sunshine, snow, or night.I've played some of the single player campaign, but just prefer to play it via LAN with friends. It is more fun to me, to race against people I know than computer controlled cars. Especially as the computer controlled cars don't always seem to realize that you're right beside them, and will hit you, causing you to spin out, wreck, or generally have problems.One of the more annoying things about this game is that you have to sign up for Microsoft Live, or something like that. You get a predetermined name, which is generally nonsense. And every time you want to play this game, you have to sign into Live. The other complaint I have is that if you want more cars, you don't earn them by being good at the game. You buy them. It seems like every company is going for purchasable downloadable content route.",
      "overall": "positive"
   },
   {
      "reviewerID": "A9Z8RBTJT4R28",
      "reviewText": "Very good quality, excellent graphics, very complete game, the car can personalis And you can play online, I recommend it.Muy buena calidad, excelentes graficos, muy completo el juego, se puede personalisar el carro, ademas se puede jugar en linea, lo recomiendo.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1125BZR4DT8RR",
      "reviewText": "Muy buena sensaci&oacute;n de realidad, visual y en el volante. Recomendad&iacute;simo para cualquier fan de los Rallys y de los juegos de conducci&oacute;n. En orden hist&oacute;rico tengo GRID, F1 2010 y DIRT 3 de Codemasters, y se nota en cada nuevo juego un avance real en el concepto, en lo parecido a conducir realmente.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1NCF8YOK4YVY8",
      "reviewText": "Seriously, the game is amazing fun. It has a learning curve, and I recommend you have a really good system to make the framerate playable (I have a Pentium D 3.0, 3.5GB RAM, Radeon 4650 and I have to have it almost set to \"Ultra Low\"), but I have already convinced others to buy this.Favorite feature: YouTube publishing right from the game. Awesome.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1S6Z0KZQ8XZYJ",
      "reviewText": "It works as advertised.No issues or problems.The product was received as expected.The product worked as expected.Excellent product.Well done.",
      "overall": "positive"
   },
   {
      "reviewerID": "A38NXTZUFB1O2K",
      "reviewText": "I'm not quite finished with the game's DiRT Tour mode, but I believe I've experienced the bulk of what the game has to offer.  And I'm happy to say that the game is indeed awesome.  Great cars, great tracks and racing modes, excellent gameplay and graphics.  The highlight has been racing in the snow on various tracks in Aspen.  There are also some really cool obstacle courses on pavement, which are new to the series.At first, I felt that the game was plagued with the same difficulty spike DiRT 2 had, where you can win any race without trying on casual difficulty, then lose big time on medium.  Then I found the custom difficulty settings where you can choose from 5 levels of challenge, then pick and choose from all the other assists and handling options.  Basically, you can let the game play itself by just holding the throttle and steering, or take gradual steps to reach what you feel works best for you.  Love this feature!  Sadly, there is no option to increase the 360 controller's dead zone or adjust the sensitivity.  I'm doing ok as is, but some tweaking would be ideal.Much like the previous two games, the handling is a bit flighty.  But that's speeding on loose ground for you.  Still, I feel things have tightened up somewhat since DiRT 2.  Still no cigar, but it's a step forward.  The game runs as smooth as silk on my 560ti wih all the settings maxed.  No issues whatsoever.  If you enjoy racing games, this is not one you should ignore.  It's the best DiRT so far.",
      "overall": "positive"
   },
   {
      "reviewerID": "A34G2LFWPEHQMQ",
      "reviewText": "So much fun, so little time. Runs great on Win8, unlike sooooo many of the other great racing games. When buying Dirt3 be sure NOT to buy off steam or you miss out on all the extras from the complete edition on DVD. (You can get the extras on steam, but it costs more).",
      "overall": "positive"
   },
   {
      "reviewerID": "A39EMMLBW6SLSB",
      "reviewText": "I bought this and Shift 2. Neither will run on a i5 Dell Inspiron E6420 Windows 7 Pro!? Wasted hours trying to install. I build computers and install networks, let that be a clue. Garbage when complete installation instructions are NOT included. I purchased these for my grand kids. Nothing is said about having to create an full disclosure account. Sorry, my kids privacy is more important. These go back to Amazon",
      "overall": "negative"
   },
   {
      "reviewerID": "A1P8ZSUIPHPSRJ",
      "reviewText": "I insert the cd into my pc and I have being waiting  35 minute and it only install about 25%",
      "overall": "negative"
   },
   {
      "reviewerID": "ANW6EGY12V5XS",
      "reviewText": "I have been playing car racing games since their early beginning on PC. I currently have a logitech G25 force feedback wheel to play with.I have played most of the Colin Mc Rae, Need for speed, Grid and Dirt2 games before. I also tried my hands at more simulation oriented games like GTR, GTR2, GP Legends...Dirt2 came in as a nice and pleasant surprise. Dirt3 tops it off.As I am sure many will detail everything about this game, I will limit myself to the most important points for me.Pros:- Amazing graphics- Amazing physics- Challenging but entertaining racesCons:- Gymkhana- InterfaceWhat went through the conceptors mind about gymkhana? Racing is not easy for most but gymkhana is really a pain in the neck.I saw the videos of Ken Block on Youtube and indeed he is really impressive. Am I even dreaming of doing the same? No!Racing require good racing skills to start but Gymkhana requires a perfect control of the vehicles and most of us will never achieve such level. So I find the attemps slightly pointless and extremely frustrating.Now, what about the interface? Simply put, it does not remotely compare with Dirt2's interface. It is messy, I had to search online to figure out where to find my best times. There are not enough info about the cars, the races, the sponsors... It leaves a lot to desire. A complete miss.Conclusion:As far as rallye racing. This game is the best out there today.If you are one who needs crazy challenges, try the gymkhana and good luck!In spite of my criticism, I definitely do not regreat this purchase.",
      "overall": "positive"
   },
   {
      "reviewerID": "AHT34BRYFBFT1",
      "reviewText": "Dirt 3 on DVDi collect racing games so had to add this to my collectionSon wated one also",
      "overall": "positive"
   },
   {
      "reviewerID": "A12YFU8YNY11AW",
      "reviewText": "can somebody tell me how to set this game on the pc with the logitech G27? i connected everything very well but still the game failed to play, i mean the car couldnt move anywhere",
      "overall": "positive"
   },
   {
      "reviewerID": "A1FCCOP8TYX8GD",
      "reviewText": "I don't do multiplayer games, just single player against the artificial racers.  I like the realism and interaction with other cars.  I'm not used to the Xbox 360 keypad-- I wish my old Microsoft Force Feedback joystick worked with this game, but no such luck.  Also, there is too wide a gap in skill level between beginner and intermediate modes.  Unless I buy another controller, I can't do much in the tour.This game doesn't come close to the fun of Need for Speed: Most Wanted, but it uses the full capability of my laptop video card and Windows 7 64bit.",
      "overall": "positive"
   },
   {
      "reviewerID": "A5GEGX2JHHDC0",
      "reviewText": "This is a wonderful game.  The best game out there for rally and off road style racing.  Would be 5 stars if the single player campaign lasted longer without having to purchase a download, but still a fun experience.",
      "overall": "positive"
   },
   {
      "reviewerID": "A16ZD5N1HH8Q76",
      "reviewText": "This game is by far the best driving game I've playing great graphics, incredible handling and relistic damage. The online play was also pretty good for me. Only issues I had were really minor, I prefer dirt 2 user interface, and dirt had a better soundtrack, but those are just personal preferences and not really relevant to the review. The replay and upload feature is very cool as well. I'm Jason and I drive Manual. Definitely worth the buy.Gigabyte GA-890FXA-UD7AMD Phenom II X6 1080T8GB Corsair DominatorAsus HD6970Creative Sound Blaster Xi-Fi Titanium Fatality ProLogitech Z5500",
      "overall": "positive"
   },
   {
      "reviewerID": "A1T7FRUU6ZHFD7",
      "reviewText": "Super fun game, graphics are fantastic! To play at highest settings including 4x anti-aliasing,(at playable frame-rate of 30+)  I would recommend: Minimum Specs- i3 & gtx 650 ti (2gb).",
      "overall": "positive"
   },
   {
      "reviewerID": "ATAR8VWAR9U7D",
      "reviewText": "Too hard.  Takes 50 trys to pass level on highest difficulty.  Not fun.  Times and scores are impossible to achieve.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2XKDRH3XXU78C",
      "reviewText": "Don't like Windows live feature , I am not able to save the level I reach in the game, every time I play have to start new game",
      "overall": "negative"
   },
   {
      "reviewerID": "A2265TRTMU00QH",
      "reviewText": "DVD came from England so took a bit long to arrive but as was described. Had a bit of an issue with not being able to access Windows Live account, but after a few re-installs and 2 repair installs finally got it to work. Great follow up to Dirt 2.",
      "overall": "positive"
   },
   {
      "reviewerID": "A248LSBZT4P38V",
      "reviewText": "I bought this and the key didn't work.  It was a gift, and the recipient wasn't able to solve the problem.  It might have been a good game, but I never found out because the key failed.",
      "overall": "negative"
   },
   {
      "reviewerID": "A228QXX35ISH3K",
      "reviewText": "Amazing graphics, Always better with a Wheel & pedals!Did not like the MSN connection option or the comparisonsbetween other fictious drivers",
      "overall": "positive"
   },
   {
      "reviewerID": "A3QFHP7AMI54IX",
      "reviewText": "Unplayable at this time, hopefully steam will pick this game up for the online functionality.Cannot save game without the online verification which is impossible at this time.  Frustrating, yet the game play seems fun.",
      "overall": "neuter"
   },
   {
      "reviewerID": "AFS6WERAP409A",
      "reviewText": "Crashed in Vista.  Codemasters told me they don't support it in Windows 8.  Couldn't get it to work even after looking on the Internet.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2484E3RRRUAUS",
      "reviewText": "the game always want to start with the CD, even after i installed it.i dont know how to fix that.it sucks...",
      "overall": "positive"
   },
   {
      "reviewerID": "A1BT09YVO3AXAJ",
      "reviewText": "This game is full of extra DLC'S to buy.I really enjoyed dirt 2 and just wanted to keep playing .This game is expensive. I already payed for it. Stop telling me that I have to freaking buy more stuff.",
      "overall": "negative"
   },
   {
      "reviewerID": "AJNFY0DGTHLWW",
      "reviewText": "As an avid SCCA rallyx driver, I was hoping to get something that was even a little bit like actually rally driving, but was severely disappointed.  There is absolutely no relationship to driving this \"car\" to anything in real life, other than when you step on the gas it goes forward.In actual rally driving you use throttle steering to actually steer the car; its the defining quality of racing on dirt.  To do that you need to be able to keep the steering wheel straight, and use the brake to shift weight forward and back to control car rotation. But in the game the car is impossible to steer straight going 5mpg on a straight road, let alone hit racing speeds.  I tried every single possible controller setting, and even bought a brand-new wheel. Both had the same problem: turning the wheel 5 degrees results in the steering inputs reacting as if I turned the wheel 10, or 15, or 20, or 30 degrees depending on the speed.The only workaround I could find was the \"dead zone\", making the wheel inoperable while centered, and then it violently overracts when turned outside of the dead zone.  Using that I could steer straight and then sharply turn, then go straight, then sharply turn.  Ridiculous, yes, but if you watch videos of people driving on youtube.com that's how the game was apparently designed.You'd think that a driver-oriented game would have a multitude of options for the most important aspect of driving: controlling the car.  Instead, the game is horribly slowed down by useless eye-candy graphics and a ridiculously obtuse interface.  Just starting the game and getting to the point of driving a car takes 10 minutes while you frantically hit the enter key trying to tell it to skip the fancy graphics and storyline and get on with the darn game.If its racing you want then iracing.com is still the only realistic option.  This is worse than even Mario Kart!",
      "overall": "negative"
   },
   {
      "reviewerID": "A3BQMSVKFEZHLU",
      "reviewText": "I've been playing Dirt2 on PC a year now and crossed over to D3 almost a month and it looks soo good! I recommend using DX11 video card to see all the great detail in the game! I'm using a MS/PC Xbox controller ($45.) for now and I like the game enough that I'm going to buy a really good Driving Wheel and pedals! Maybe Logitech G27 or? This is really a fun game you must buy! Time to Race!!",
      "overall": "positive"
   },
   {
      "reviewerID": "ADQ6DTQHH6VA",
      "reviewText": "First of all, I bought this game for 49$ and would do so again in a second. It has amazing graphics, awesome looking tracks, and the cars handle extremely well. The only thing I am not a fan of is the gymkhana events. It is frustrating to me because I will win races to get to the end of an event, but to progress I must beat a gymkhana event. For those who don't know, gymkhana is an event where you drift through corridors, do donuts, jump ramps, and so on. I don't practice it because I don't like it, so those events tend to be frustrating. Otherwise it's a great game, I just wish they had done a gymkhana only track that could be avoided.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1557F2E781ULM",
      "reviewText": "I bought this game earlier this year and was working ok, but when I filled out the xbox live profile this game runs on. It already had a profile name. I thought it was odd, but didnt think too much into it since the game was shrink wrapped and all and was still playing on my pc. It was my first time using xbox live and existing account name had some racing type ring to it, I figured it was part of the game set up for you to personalize screen name if you wanted to change it. Either way the game stopped working, wouldnt load anymore, and a window telling me that game copy was not origanal. So to me, with the other reviews saying game will not load. Im wondering if people are paying attention to windows saying why it will not load. Im guessing the seller or somebody who works there is taking the games number pass code and making copies. With the low  price of the game whos gonna go through the hassel and demand a refund after 3 or 4 months of having this game. I never bothered to bring this up to the seller, because in the end with the games low price I can see the seller accuse me of the copying. Try and google the seller and its reviews (its been some time since I did this. Dont know if they still have origanal name). I did and they were not good. Who knows this review could have been different if I had contacted them, but with the games low price and what came up after google'n the seller. I doubt it.",
      "overall": "negative"
   },
   {
      "reviewerID": "A14L115LBOB0A5",
      "reviewText": "This game was a rip-off.  It has less terrain, less tracks, and less features than DiRT 2.  The graphics are about the same.  Not worth the money, at all.",
      "overall": "negative"
   },
   {
      "reviewerID": "A20DRRKAN5Z9Q",
      "reviewText": "In today's game market it's easy to miss racing games that aren't part of the license-heavy Forza or Gran Turismo franchises. Dirt 3 for PC is in an even worse boat than most since it's been a giveaway for a couple years now with every DX11 compliant ATI video card. As a result a lot of people who get it send it straight to eBay and most people who do play it have not bought it new.This is a shame because Dirt 3 is a fun little game. There's a great assortment of multinational tracks, and a wide array of classic and modern rally cars to choose from. As a rally game, Dirt 3 ditches the comfortable confines of tracks and sends you headlong across snow and gravel in a world where keeping control of your car is a greater skill than making it around the turns. Dirt 3 wears a veneer of noisy, fun arcade-style game play, but under the hood it calls for quick reactions, a good understanding of road surfaces, and nerves of steel. Sadly, it also calls for a gamepad or wheel- you will almost certainly find the keyboard too all-or-nothing for serious racing.PROS:-Visually stunning engine that makes full use of DirectX 11 effects-Soundtrack is an appealing mix of classic prog rock and modern music that does a good job of being vaguely European and not too intrusive-Successfully models an arcade-like complexity of play with a surprisingly deep simulation of track conditions and vehicle handling-In-car camera gives a stomach-churning stream of nonstop thrills as you launch over crests and 2-wheel hairpins-Probably the most realistic depiction of drifting/powersliding to appear in a video game (it's frightening, nauseating, and usually a bad idea)-3D support!CONS:-Lower difficulties aren't much fun, highest difficulty is brutally hard-Small fanbase of hardcore racing nuts may make multiplayer a bit hard for newcomers (Dirt 3 players seem pretty nice though)-Essentially requires some sort of analog input-May confuse players who aren't familiar with the rules and conditions of rally-style racingOther thoughts:-You need to plug your youtube credentials into the game to let it export your highlights to YouTube. I don't think CodeMasters wants to rip you off, but if it makes you uncomfortable, create a new Google identity for use with Dirt 3. Easy!-LEARN THE TRACKS. Learn the tracks, learn the tracks, learn the tracks.-If you want to win, employ a Fin!",
      "overall": "positive"
   },
   {
      "reviewerID": "AIOQYO1HHLMBV",
      "reviewText": "I wish I had read the forums before purchasing this game.  I bought the DVD version because I didn't want to deal with downloading on slow internet, but I see similar issues reported on steam forums.  I buy games on Amazon or Steam because I don't want to deal with the hassle of pirating.  I thought it wouldn't be worth the time, but this game makes me have second thoughts.  This game was not worth the time, and I've yet to be able to actually play a full race.It took two evenings from when I got home from work until after midnight just to get this game installed.  I wanted to try playing video games, so I bought a computer and some games.  The installation takes hours, crashed my computer multiple times, required many dependencies (like \"MS games for windows live\") that must be installed separately.  The only way to find out you need this other software is to search the forums... If you don't have some dependency, after an hour of waiting the install finishes but the game doesn't start.  I even had to edit XML configuration files to get the program to start at all.The game can't be played unless I am *both* logged into xbox live *and* have the DVD in the drive.  I find that DVD's scratch easily, I consider them transfer media not a reliable way to store data.  Since they already have the DRM of a mandatory windows-live service, I don't see why they would cripple the game even further with the disk requirement.  For this reason, if you ignore my advice, at least get the downloadable version.  I'll probably copy the dvd image to disk as an iso with CloneDrive, but it's an extra 7gb of data that has already been installed on my hard disk for a game that... can't be played anyway.Once I finally ironed out the installation issues, and was actually able to get the game started, 2 minutes into each attempt at a car race the entire computer would crash.  Black screen, unresponsive, numlock doesn't even change the lights on my keyboard, needing a hard-reboot.I know some will assume I just don't know how to install software, or that I have an old computer, or that I have viruses.  I'm a software engineer with over a decade of software development experience.  All of the other games I bought on Amazon or Steam worked fine (including one other that also required the windows live service).  My computer is two weeks old and fast, i5, 8gb of ram, a discrete graphics card, nearly brand new.  Even if this was a resource issue, the game shouldn't consistently crash my entire computer to the point of needing a hard reboot.  The price for the game isn't high, but don't waste your *time* on the PC version of this game.If you're a young kid and you've got all of your summer vacation to play around with figuring out installation issues, maybe this will be a good learning experience for you.  If you have a job, and just want something fun to to do once in a while on a PC, look elsewhere.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2YBU04TEXCASM",
      "reviewText": "So you just want to buy and play this great rally racing game?  Good luck.  I have a typical Windows XP system with an nVidia video 8600 series card and 4GB ram.  Decent but nothing tricky. I am also quite resourceful and capable of doing things like \"deleting .dll files\" running special installers from third party websites, etc.YOU MAY VERY WELL NEED TO BE AS WELL.If your install does not work and the game gives you and error, you may be on your own.  Codemaster's tech support?  Responded twice total. I spent another $30 on a registry and .dll fixer, nothing, then they told me to uninstall a bunch of other stuff I had on my machine and then when I did, wouldn't return my response that their help did not resolve my problem.  Poof, gone.There is no phone number and their home page is on Facebook.So I used Google and found their official forum and posted a lengthy message with the details as requested by their forum guide and got NOTHING, no help.I was able to eventually get it to run through more Google searching for related problems in other games.  Problems that should not exist in today's games.  I had to download and run special installers from a sound card manufacturer and \"drill into\" the Dirt 3 game folder and delete a specific file.How stupid is this?  And nothing?  No help?  No FAQ?  No fix or patch?  Even more remarkable is that their forum is filled with demands that Codemasters fix the bugs.  Demands for many months now, apparently gone unanswered, literally.This IS THE FIRST AND LAST CODEMASTERS GAME I will ever buy or help someone with.I gave it one star for the horrible \"welcome aboard, have fun installing\" for this game and \"one star\" for game play as it has been a week and countless hours spent, with no help from Codemasters, getting it to run, which is not much \"fun.\" So One star for fun.It now works, maybe I'll come back and reassess my fun score, maybe not.Good Riddance.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2VYL51WQXC5KK",
      "reviewText": "This really is a step up from Dirt 2. Better graphics, cars seem a little more responsive. Overall it was worth almost the money, but of course, I wait till the games are \"old hat\" and buy them cheaper.The really bad thing is having to buy tracks and cars. Nope, I'm never going to do that and I think it is a crappy deal, but that's life. If I had known about the lack of tracks and cars, I would have passed. There's no real reason to finish the game, as it's just more of the same without paying a bunch of money to get all the \"extras\", that should have been in the game to begin with.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A10AYT89XSCE46",
      "reviewText": "This game is bug landFirst had problems installing because it required some windows market software. Then it did not have any voice sounds. Then it was running on windowed mode only. Now, everytime I end a track it just crashes the computer (BSoD).I give up. Codemasters, next time, dont rush a game out just because you have to. Test the game! If not for yourself for Colin himself. If he was alive he would be embarrassed.And don't buy the game using Steam because if it does not work, Steam will show you the finger :)",
      "overall": "negative"
   },
   {
      "reviewerID": "A279DB4S5P2GQP",
      "reviewText": "This might be a decent game if it didn't start a massive stutter every few minutes that requires alt tabbing to get out of. This is a widely known issue and I have tried numerous suggested fixes to no avail. I have never had an unfixable issue like this with a game before. If I could return it for my money back I would.",
      "overall": "negative"
   },
   {
      "reviewerID": "A29KT7UP7DLM1J",
      "reviewText": "DiRT 2 was like this.  I'm becoming more & more suspicious of games like this that require a continuous open Internet to play.  It just seems like bait set out for some young naive prey to fall for.  Does anyone honestly believe that personal information is collected for no particular reason?  I don't care what they say publicly.  Any assurances of privacy protection are quite hollow without close oversight, and nobody's looking.  It's quite a different thing to knowingly step out into a multiplayer server where you know you're being tracked, but this type of continuous spying is something more.  That aside, this carrot on a stick has more problems than just security.CONS - Requires open Internet (Windows Live) to play.  Annoying interface.  Continuous reminders to upload and download things you already selected not to do.  Most settings don't keep between sessions.  Setting up a race takes way too long.  Irritating \"music\" you can't turn off (it keeps coming back).  Takes too long to unlock things.  Entire career mode is pointless when the game setup is so irritating I just wanted out.  Video stuttering (possibly my equipment).PROS - Eye candy.  Plenty of game modes.  Enough tracks to get going.  Fairly good variety of cars.  Scaled difficulty levels from casual to advanced.I think this franchise, like many others, continues soley for the purpose of farming user information; where it seems the real money is.  If I can't turn it off, and some else controls the on-off switch, that's a problem.  Sometimes it might be worth it, but not here.  I found some entertainment value, but very briefly.  Anyway,  just my opinion...",
      "overall": "negative"
   },
   {
      "reviewerID": "AZ7N0TLPDP156",
      "reviewText": "Look I think all game making companies are rip offs, that's why people rather download pirated games. This game sucked Ba**s to install, error after error.After researching on the internet for a while the solution that worked for me was copy whole game from CD to desktop folder and then installed the game. If I have to do so much work to play a game then why should I have to pay so much for it.Game developers blame it on CD ROM. I don't think so.After that problem fixed the game ran smooth, graphics and sound track is awesome and it looks great on eyefinity after I set it all up. Why too much work has to be down by the customer to run these fu***n games, and yet you get charged so much money, it should be cheaper.Sapphire HD 7970 [Single]3 samsung xl 2370 LED lcd monitors.Its a fun racing game but you have to have a windows game log in ID for their online server or the game will not auto save and blah bla blah. bottom line is you must remain connected to the internet at all times to play this game I think.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1Q80TZVF5TCY2",
      "reviewText": "I greatly enjoyed Dirt 2 and picked up Dirt 3 for more dirt racing action (truck racing is my favorite).  I actually found this rather duller than Dirt 2, less \"game-like,\" the locations a bit monotonous, and way too much emphasis on gymkhana, when what I really want is land rush, rally, rally cross.Requiring gymkhana to advance past the first level is annoying, to say the least, and may be a deal breaker for some people.However, it is possible to modify the database file to completely unlock the game. In fact, you can modify the database to unlock all the cars, all the races. Just google \"dirt 3 unlock mod.\"  The file is a replacement for \"database.bin\" - so all you have to do is search for that file, save the original file as backup and replace it with the unlocked database. (And, after you play through to the next level, you can put the original file back.)  It's a fairly easy fix even for the so-so computer literate.The upshot though is, Codemasters could have included an option to bypass gymkhana for those just wanting rally and not screech-braking in a parking lot.This game did work without a problem on Win 7 64-bit with a Thrustmaster Ferrari GT Experience wheel.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A3J9C2WMW0TZYB",
      "reviewText": "I really enjoyed the Dirt series of racing games.  I actually started with the Colin McRae Rally 3 demo, which came before Dirt.  Dirt 1 was a nice game with lots of different types of races in varied environments, including Pike's Peak.  You got to race semi trucks, cargo trucks, trophy trucks, SUVs, and rally cars in Dirt 1.  The advancement was like a pyramid, unlocking levels as you go. I have a Toyota Tundra, so it is easy to like a game that has a Toyota Tundra to race in it.  Dirt 2 made it more radical with nice music and an attitude.  The races were longer and became more X-Games like. I enjoyed the Baja races very much. But, I did not like the Microsoft Live part of it where it takes a long time to get initiated, patched, etc before you can actually play for the first time. Once you get past this, things get better. The choice of vehicles were more limited, but the liveries try to make up for it. Dirt 3 keeps the same attitude and cool music, but also has the same Microsoft Live treatment: sign in, patch , etc. before the first game time.  Once you get past this, it does get better.  At first, I could not get used to the way the game downshifts automatically in the turns to automatically slow you down.  I moved the difficulty up a notch to intermediate and it was much better and more of what I was expecting.  I use a gamepad to play on the PC.  I was pleasantly surprised that my 9800 GTX 512 MB plays this game rather well at 1680x1050 (no AA).  The races are largely rally with some interesting winter-time truck races in the snow.  The cars are not quite as varied as I would like.  I also hate that there is in-game content that can be purchased additionally from Microsoft Live.  Come on! I already paid for the game and there are some levels that are pay to play, so you won't really finish the season until you pony up more funds to Microsoft Live.  Many of the cars are available to purchase too.  That is cheesy and not appreciated.  You don't need to purchase these to advance though.  The gymkhana events are interesting and challenging. Being a hoonigan takes practice, patience, and many banged up cars. The Ken Block videos on youtube really inspired me to practice as I had no idea what gymkhana was before Dirt 3.  I do miss the Baja style of offroading from Dirt 2.  Dirt 3 seems to have a focus on other things, but it is still fun overall. For $12, I got my money's worth.  Maybe I will get Dirt Showdown for some demolition derby excitement, or maybe not.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1ZPG1Z2EDGJWM",
      "reviewText": "The game hangs after the Dirt 3 logo comes up so I couldn't tell you how the game is.  I couldn't find any solutions on Codemaster's forum that actually worked for me either.Codemasters also got hacked so I can't register to ask questions on their forum.  At least the game was free when I bought a particular video card.Edit:I finally got the game to run after I deleted some sound driver called Rapture 3d that the game automatically installs.  I ran a race and the game worked well with my Fanatec wheel.  I left the game and came back later and none of my controller settings were saved so as I started a race I suddenly had to use the keyboard.  I fixed the controller settings again and then I had no force feedback in the wheel.When the game works it's great.  I've got the graphics completely maxed out and they look nice.  The surround sound is nice as well.System specs:AMD Phenom II X6 1100T2X Radeon 6870 1GB in Crossfire mode16GB DDR3 1300 RamHT Omega Striker sound card",
      "overall": "negative"
   },
   {
      "reviewerID": "A2J4RY1WHVEK3T",
      "reviewText": "I have never in my life paid money for a game this buggyFirst up, my computer is awesome, it crushes anything I though at it with ease.  I have an AMD II X4 925, 4GB RAM with Raedon 6900, my computer IS NOT the problemProblems with this game:#1. The DVD doesn't read properly.  My DVD drive, which has NEVER had an issue with anything before takes about 2 minutes to register the DVD.  Clearly whatever factory they used to burn this disc along with the DRM rubbish did a real fine job.  You must have DVD in drive to play game, so need to wait 2 minutes before can play - assuming it reads disk, which it only does 1/3 of the time ;-/#2. Windows Games for Live was a friggin nightmare to get going.  By the way I'm a computer programmer by day so I know how to operate technical things.  Ended up disabling anti-virus software, good luck getting a non-technical person to realise they must do this#3. Game absolutely fries my computer.  I have a friggin Raedon HD 6900!!!  My GPU went to 85 degrees and my CPU to 105!! WTF!?  Ended up turning down graphics level right down to stop my fans going mental#4. You win a race in career mode and you get spoken to like you're a 12 year skate boarder.  \"That was awesome driving dude, you should totally upload your replay to youtube!!!\".  Um, how about get lost?#5. Get up a short distance through career mode to a snow track with other cars on it - graphics start stuttering like crazy even though i have graphics on \"low\" on a Raedon 6900!!!! wtf!!?!?  Getting about 10 FPS.#6. Give up on career mode.  Decide to only play time trial.  Oh game automatically downloads ghost replays of \"world record holders\" - they're all cheats who hack!!  3 minute races won in 26 seconds ummm hello??#7. Finish a time trial, OK that was fun, now replay it.  Oh graphics start stuttering again!!!  Not as bad as snow race but still annoyingn as hell.  Only way to fix is to exit to main menu and then reload entire race, so can't use replay.Un friggin believableWORST GAME I HAVE EVER PURCHASED",
      "overall": "negative"
   },
   {
      "reviewerID": "AZHL13Q7MSZC6",
      "reviewText": "I have several racing games, including Need For Speed the Run. Dirt 3 has been a very big disappointment. The reaction times with the controler a not responsive at the least. Graphics are shabby as well. Do not purchase!!!",
      "overall": "negative"
   },
   {
      "reviewerID": "A64A14YBQOD2H",
      "reviewText": "Installed the game. Then clicked to launch/start the game. An error message appeared saying game cannot start because \"xlive.dll file is missing\". They should have displayed a message advising the user to install \"Games for Windows Live\" program first (a free download from Microsoft), but instead they just give you an error message and leave you to figure it out on your own. Small print on the game box mentions Games for Windows Live being needed to activate your online profile and multiplayer gameplay but does NOT make clear you may need this just to get the game started!So, installed Games for Windows Live and launched Dirt 3 for the second time. This time it says game update needed to proceed otherwise it will sign you out. Clicked OK/Proceed to get the game update. This took almost 30 to 40 minutes on my 12Mbps high-speed internet connection just to download the game update. Then you go through a fairly quick install of the game update.Launched the game for the third time and they ask you to create Windows Live profile for online stuff then create a player name, etc.By the time I was able to run a race in the game it was midnight and I went to bed ............Maybe I'll add to this review if I ever get to play it for a while!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2O4BNJ83J4WHM",
      "reviewText": "I havent finished it but if you like racing game you will like this one.Lot's of fun,good graphic. You will have hour's of fun and be looking for the next one to come out!",
      "overall": "positive"
   },
   {
      "reviewerID": "AFA6MBQU0C2GH",
      "reviewText": "I bought this because I read in a review that it was the best car game of 2011. The graphics are good, the car handling is good althought with a small delay from my steering wheel. I had to eliminate the force feedback and tweak it quite a bit to have it to a point where the delay would have a minimal interference with gameplay.The competitions in the game are lame and it is not a game that invites you to play. The career mode is lame in that they make you do all sorts of challenges like spinning your car and making it skid, and then different styles of racing (rally, tarmak, race with others on dirt) with lame cars. If you like one particular style of racing, you are really forced to do all styles so it gets old.I must say, the driving engine is good, but the game is just boring and doesnt entice me to keep playing. Every since I bought it, Ive played it 7 times (believe me, I gave this game a fair chance and that is most I was willing to play this game)",
      "overall": "negative"
   },
   {
      "reviewerID": "A15PIAQT55GNCA",
      "reviewText": "lot of people don't like RALLY because they already tried gran turismo game. to tell you the truth gran turismo RALLY physic is just boring boring boring. gran turismo only good for racing simulation but RALLY part is suck!!!!  dirt 2 amazed me how much fun it was and now dirt 3 with 3 time more race tracks than dirt 2.  MUST BUY!!!!!!!!!!",
      "overall": "positive"
   },
   {
      "reviewerID": "A3G3DZ77DA2JUR",
      "reviewText": "Perfect for me. I used to do a lot of sim racing but it has been a while. This thing lets me gradually shed assisted driving. Easy to tune for good challenges, new skills and constant fun. I might even put another DVD drive into my computer so DiRt3 is always ready to go.",
      "overall": "positive"
   },
   {
      "reviewerID": "A49LKEZ55KKL9",
      "reviewText": "This is probably the best racing game out there at this moment. Nov. 2012. It's got a lot of fun party modes, and multiplayer modes, along with some very realistic driving. But to get the full experience get yourself a good steering wheel. Im not talking about those cheap $50 wheels that only turn half way. I got myself the Logitech GT wheel for PS3 and for PC's and it's amazing!",
      "overall": "positive"
   },
   {
      "reviewerID": "A18YFCLL3GBD0T",
      "reviewText": "I would like give this game 4 or 5 stars, if I could get it to run. Like others the game crashes on start-up or in the game and Codemasters has been absolutely no help in correcting it. Why they can't get their asses in gear (pun intended) and fix it I don't know, but with so many folks reporting the problem it isn't just occasional. I assume they either can't replicate the problem or just don't care. Lacking any help from Codemasters, I've tried the various fan fixes, including uninstalling Rapture 3D. Also tried installing on Vista and Win 7 and that didn't help either, which is a shame since from the other reviews it seems like a great racing sim.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1BHRNLW2L8KLD",
      "reviewText": "The game itself is great, but Games for Windows Live is such a frustrating piece of garbage.  I wish it would just die and stop bringing down my PC gaming experience.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1CB8HH9YJ2YZE",
      "reviewText": "This is a pretty fun game, but you have to buy most of the cars and tracks from the online store. The game claims to provide so much more content, however, the \"scam\" is, that you don't get that content with the game. You need to buy it. If you win races you will get a message saying \"YAY! You can now purchase your new car from the online store!!!\"OMG REALLY??? I CAN SPEND MORE MONEY ON A GAME I ALREADY PAID FOR??? NO WAI!!!!But overall, if you don't mind playing with the same default cars all the time, it's a pretty fun game. I really only play online mode, which allows you to race against other people. The computer on this game is WAY to easy so single player isn't any fun. You could drive backwords and still beat the computer.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A1WWEZTVXQKC8Q",
      "reviewText": "This is a really fun game to play but I hate the new Microsoft Live formats being added to the newer games. You can't save game progress or a profile unless you are online & have a Microsoft Live account. When I purchase a game I should have the ability (and rights!!!) to save game progress & profiles without having to be online & tracked by Microsoft. There's also all kinds of track & car add-ons that you are encouraged to buy for additional money. Overall a rip off in my opinion. No more Microsoft Live games for me!!!",
      "overall": "neuter"
   },
   {
      "reviewerID": "A2LQCBLLJVVR5T",
      "reviewText": "This is a must have for any gamer. Codemasters really hit a home run on this one. I would like to see F1 2011 be this good using the ego engine 2.0 and the physics model in this game is right on the money. This game is the reason everyone should buy the best graphics card they can afford. I am using a nvidia 460 overclocked, and I have on order a 590. I want to run this game with everything on highest level. I swear to you that even with the 460 + , the graphics are very realistic and I really enjoy racing at ground level. This game makes Codemasters the king of graphics realism. BUY THIS GAME !!!!!December 6, 2011  I saw my review of the Internet and wanted to update it for you. First of all anyone with this program, BUY the extra environments and cars. It is money well spent and a first class job of an addon. I wanted everyone to know that this program is still the top of the heap in graphics. I bought Battlefield 3 and it is good, but not the standard of the ego 2 engine. Codemasters are the king of graphics so far and I find that the more realism a game has, the more adicted you will become. No other program running with all variables to the max, looks like Dirt 3. Thank God for codemasters and I can hardly wait for GRID 2 in the summer.",
      "overall": "positive"
   },
   {
      "reviewerID": "A13X4KZB56N49J",
      "reviewText": "Although this game is an amazing real to life representation of rally racing their choice in not hosting the log in servers was a bad idea. i loved this game and played it everyday until Microsoft live f'ed up and my account was deleted. sad to say i cant play this game anymore, due to the fact that Microsoft's support may as well only apply to people living on the moon because it is that bad. codemaster should have choose somebody else to host their servers, that is why my overall rating is at 3 stars. The game is great, support is non existent. so now i will have to buy a completely new game thanks to Microsoft.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A3GHPNOJPBJS2Q",
      "reviewText": "I particularly like the stadium trucks.  Fun game.  My wife likes it too.  I use a 28 dollar steering wheel and pedal set.",
      "overall": "positive"
   },
   {
      "reviewerID": "A22RKVML3IJMAS",
      "reviewText": "Great graphics, great career mode.  Multiplayers ok.  Overall great game.  Make sure you have Microsoft Live installed before installing game.",
      "overall": "positive"
   },
   {
      "reviewerID": "AD4IGRSR4TGF0",
      "reviewText": "I loved Dirt 2 and was like a Coke fiend with a couple of 8 balls when I purchased Dirt 3, the game has much more polished look and the tracks are more challenging. The snow driving is pretty realistic due to my own experience of hitting the ditch myself while living in WI. But if you loved the soundtrack on Dirt 2, you will hate the Dirt 3, I turned the music off. The Gymkhana portion of the game needs to be deleted, worst part of the game. It's fun and worth a buy, but I still prefer Dirt 2.",
      "overall": "positive"
   },
   {
      "reviewerID": "ABOL28AI6FKPT",
      "reviewText": "Wish I could review this product.  Problem is, I can't load it onto my laptop.  Tried it in compatible mode, but that doesn't work either.  Oh well, the other Jack games are fun.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2JN6SFNKAUAKH",
      "reviewText": "It's a OK game I thought it was going to be something else that what it is.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A209UAWPEUF3J3",
      "reviewText": "A little detail they 'forgot' to include:IT ONLY WORKS WITH WINDOWS 95 OR EARLIERSince I (and most of us) run Windows XP or later, this game would not run on my computer. I assumed (stupid me) that games being sold as 'new' would run on current platforms. Lesson learned.IMHO, the operating system specs should ALWAYS be given. Why should I have to do research on a game to see if it will run on my computer? The sellers already know that piece of information. Why would they withhold it?",
      "overall": "negative"
   },
   {
      "reviewerID": "AMF547B0UMFC8",
      "reviewText": "How can you sell a game and not know the platform? whats up with that?  let me guess you cannot read English is that correct? well look on the box idiot and see does it say XBOX? OR PS3 OR WII OR MAC OR PC.. IS IT THAT HARD TO LOOK AT THE BOX? . OR MAYBE TRY IT OUT TO SEE IF YOU ARE SELLING A WORKING COPY OF THE GAME.. SO IN THE LONG RUN YOU WANT SOMEONE ON HERE TO BE A TOTAL IDIOT NOT KNOWING THE PLATFORM AND SAY YA KNOW I HAVE NOTHING TO DO WITH MY MONEY TODAY SO I AM GONNA BUY A GAME THAT I HAVE NO IDEA IF I WILL EVER BE ABLE TO PLAY BECAUSE NO ONE KNOWS WHAT PLATFORM IT IS, AND BEING THAT NO ONE SEEMS TO BE ABLE TO READ AT THE SELLERS OFFICE .. I WILL GET IT AND THEN WHEN I GET IT FOR WHAT 39.00 I JUST MIGHT HAVE TO SHELL OUT ANOTHER 200.00 OR SO TO BE ABLE TO PLAY IT.. AMAZON SHOULD STOP YOU FROM SELLING ON HERE...",
      "overall": "negative"
   },
   {
      "reviewerID": "A60V7MCDBSTIQ",
      "reviewText": "I tried your product and it didn't work. It just kept on saying this cd is not compatible for this computer.Can you please help me out with this,cause I love this game and would love to have it.  My new computer is:Inspiron 620windows 764bits  6.00GBThank YouNicholas Santiago",
      "overall": "negative"
   },
   {
      "reviewerID": "AFBN93AVL10P1",
      "reviewText": "This game is a good time.  Especially if you have friends playing along.  Answer all kinds of movie trivia.",
      "overall": "positive"
   },
   {
      "reviewerID": "A96K1ZGW56S2I",
      "reviewText": "The \"You Don't Know Jack\" game series is kind of like a sarcastic version of \"Jeopardy!\"  The game is set up as though you and other players are playing an actual game show.  Instead of the kind, warm, and friendly voice of an Alex Trebek or Regis Philbin, the host of  \"You Don't Know Jack\" is more reminiscent of  Anne Robinson from THE WEAKEST LINK with his sarcastic comments and snide asides.  It makes for a fun, entertaining, and educational experience.  This is the YOU DON'T KNOW JACK MOVIES and the questions all have something to do about film.  Don't be fooled by the playfulness and multiple-choice options, some of these questions are extremely difficult to get, even if your mind is a walking encyclopedia of film knowledge.  The game can be played in two different formats: a seven question round and a twenty-one question round.  The seven question format takes about fifteen minutes to play while the longer version takes almost forty-five.  Most of the questions are in multiple choice, but there are different types:  picture questions, fill in the blanks, whatshisname questions, gibberish questions, dis or dat choices, and the final round of the game is called Jack Attack (an association question).  I've found the gibberish questions the most difficult because it takes me a little longer to remember movies that sound like what appears on the screen.  Also, if you play the game with more than one person there is a \"screw your neighbor round\" where you can force someone else to answer a question instead of yourself.  This is a wonderful game that I thoroughly enjoy playing.  Highly recommended for trivia and movie buffs that own a computer.",
      "overall": "positive"
   },
   {
      "reviewerID": "AC7Q3WNF8OY3Y",
      "reviewText": "Let me preface this by saying I freaking love YDKJ. I'm going for the entire series. Yet I see one-star reviews of this great game because why? \"THE GAME DOESN'T WORK!\" Now, I can get that not everyone's a computer-savvy person, but I got dang near the entire Jack series working on Windows 7, 64bit. How? By using Microsoft Virtual PC and Windows 98. (NOT Windows XP Mode unless your have a high-end version of Windows). Anyway, the way I got these to work is use Virtual PC with a legitimate CD of Windows 98 (still love it, baby!) and install '98 on the virtual computer. (You have to have Win98 AT LEAST to get this trick to work. '95 and 3.1 are both no-goes. I'd assume any other Windows version that supports 16bit apps will work for you.) Next, make sure you've installed Virtual Machine Additions, and enable hard drive sharing. That allows you to access the physical hard drives on your that you tell Virtual PC to share in the settings. Next, put your YDKJ CD or ISO image in, capture the drive, (this trick works with any Jack game save for 5th Dementia...you'll just have to install and play that one on the virtual machine), install the game, then copy the entire contents of the Jack CD (save for the setup files), overwrite anything and everything, then try running the game without the CD. If it runs, then copy the game's folder on to your computer's physical hard drive. Then in your newer Windows system, make sure that you apply the 640x480 resolution compatitbilty setting to the game. That prevents the game from being a tiny window in the middle of the screen. Now, create a shortcut if you so desire, and run the game. I've gotten this to work on a Toshiba laptop, 2Ghz Celeron dualcore, 2GB RAM, Win7 64bit.",
      "overall": "positive"
   },
   {
      "reviewerID": "AFNUL9W3Q1FV6",
      "reviewText": "This is a really useful tool to learn meditation and quieting the mind in the midst of an active stimulating environment. The whole point is that you're racing a car and trying to beat other computer controlled cars around the track. With the skin conductance and heart rate monitor (which attaches to your fingertips) you control the car's speed. You increase your speed by slowing down your breathing, heart rate, and skin conductance and getting into a meditative state. Yet the faster you make your car go the louder the music becomes and the more exciting the games gets (i.e. the competition with other cars and drive to achieve the goal of finishing the race increases). And thus the better you do at racing the car the harder it gets to increase its speed due to the increasing difficulty of relaxing. This is directly applicable to test anxiety which is aided by learning to relax even in stressful situations.However, if you are new to biofeedback (or don't have a lot of practice) consider starting with a program such as Healing Rhythms first. Dual Drive Pro is VERY challenging and takes practice before you can succeed. It may be discouraging at first, which isn't ideal when learning relaxation. Part of the difficulty though is also part of the appeal as the game is incredibly sensitive and gives almost instant feedback on the slightest increase in tension or excitation. It's fun.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2U7Y0V6241IGU",
      "reviewText": "I went to [...] and downloaded the free trials for Dual Drive, Tropical Heat & Inner Tube 3 so my son could try all 3 and see which he liked best.He didNOT like Tropical Heat.He thought Inner Tube 3 was FUNHe enjoyed Dual Drive the BEST...earning the knew cars and tracks are right up his ally :)He is 9 years old with ADHD & Sensory Processing Disorder so I am always looking for ways to help him to learn to calm down and teach him to be calm in everyday life situations. I bought Wild Rhythms a few years ago but it is just not intresting enough for him to keep him engaged long enough to be effective so I was VERY excited to see these games come out! Biofeedback is very effective for many things in life!",
      "overall": "positive"
   },
   {
      "reviewerID": "A3BL4B5OIOITK2",
      "reviewText": "I have used Healing Rhythms (Wild Divine), Particle Editor and Inner Tube (Somatic Visions) and I would rate them all highly.  But this one is different, less relaxing with cars crashing and speeding, etc.  Also not relaxing is the Somatic Visions procedure of requiring you to deactivate the program on one computer before putting it on another.  At these prices this code annoyance has not been appreciated.  The programs do work to reset one's nervous system.  I just didn't enjoy crashing car therapy.",
      "overall": "negative"
   },
   {
      "reviewerID": "A18L4OWYCH9R2E",
      "reviewText": "We purchased this product for our local bow hunting education classes.  What appeared to be a fun and education tool was boring and contained inacurate informative especially for shot placement. We would reccomend not using this software.",
      "overall": "negative"
   },
   {
      "reviewerID": "AK52O9NN8EQ27",
      "reviewText": "Haven't been able to get into the content of the materiel but the book is well produced, graphics and drawings are top notch.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1BGT2AJOBGLHK",
      "reviewText": "Some I did not know. If you are addicted to Flight Simming...especially FSX you will eventually purchase this book.",
      "overall": "positive"
   },
   {
      "reviewerID": "AZO5C4BX4T6QQ",
      "reviewText": "This book does not tell you much more than already exists in the FSX help files.It is very expensive and did not help me more after reading it.Definitely not worth $36 +S",
      "overall": "negative"
   },
   {
      "reviewerID": "A2IEBEVHTWY0LJ",
      "reviewText": "This game was never really a fan favourite. I can see why, but it's also clear to me why it was one of my cherished games as a late teen. The collective of writers, graphic artists and composer(s) in Bloodnet are nothing short of brilliant when it comes to setting a particular mood. I would label this unique mood as urban-dystopian-futuristic-cyberpunk-gothic-mystic that ends up being both oppressive and enchanting at the same time, quite a feat. It's amazing what Microprose can bring out of the dedicated player with little more than a mixture of pre-rendered and handdrawn futuristic stills and peculiar midi music to match. Especially back as a teen, Bloodnet's distinctive atmosphere engulfed my very spirits and managed to linger around me even when I was not actually playing it. Few games (or movies, or books) are capable of this as it takes a certain kind of giftedness, one that this staff happened to possess. VTM: Bloodlines comes to mind, and a couple of others.I also like the fact that Bloodnet is a game of alloys: alloying classic adventure with RPG, distant future with Medieval vampire myths, a bright and loud metropolis with a dark and silent mystery, a detailed and possible future with implausible supernatural goings-on. This aspect was accomplished well.On the bad side, the game feels like it is not interested in letting us actually play it, but only showing off its great graphics, ambient music and, above all, writing. At the same time, it has high ambitions of attempting to merge the genres of point-and-click adventure and strictly stat-based RPG. The end result is a weird mishmash of endless conversations, heavy turn-based combat, and wandering about on motionless landscapes. Weirdness can be a good and a bad thing, and in this case it's both. Part of the appeal, I think (at least for me).My biggest beef with the overall experience is the pre-scripted, absolutely non-interactive dialogs. Again, the sprawling, gritty conversations in this game are masterfully written and are more memorable than the ones in most big-time movies I've seen, but leaving them non-interactive is the biggest deal-breaker, a missed chance for an additional layer of depth and player involvement.Bloodnet is not a good game. It feels static and almost non-interactive. It is, however, a good experience. So good that it ended up as one of the very few games from the early 90's that I actively revisit from time to time. The ultimate praise I can give the game, I think, is that it is a spiritual and atmospheric precursor to the Deus Ex series and VTM: Bloodlines, which are of course much better games, but Bloodnet holds its own against them in terms of mood, writing and originality. No small feat for a 1993 DOS game.",
      "overall": "neuter"
   },
   {
      "reviewerID": "AXT1BQ2LAJ1G9",
      "reviewText": "I wanted computer crossword puzzles for brain health.  I don't like crossword puzzles but love Sudoku and knew that meant my brain was resisting gaining needed skills, much as physical development meets muscle resistance. The ease of playing these and the various levels of helps and difficulty make them winners for anyone - those who love, like, or hate crossword puzzles.  They both load easily and quickly and do not require an internet connection to play. They are always ready and do not waste paper and pencils, nor damage carpal tunnel like books would.100 Mind-teaser Crossword Puzz  [[ASIN:B003CGK6PS Lyriq Crosswords Gold Edition Vol 2 (Jc)es]] GO GREEN!!!  I am so pleased to find just what I was looking for!!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2Y113PST5WPPF",
      "reviewText": "The book is great, the inclusion of the RIFTS Space helps a lot.  Specially the space section it is worth it.  I am having a great time.  Especially since I have been adding stuf from the Rifts section with My ROBOTECH Game.",
      "overall": "positive"
   },
   {
      "reviewerID": "A28DMUKZ1EXGYE",
      "reviewText": "I liked this issue, but certain segments were a bit of let down. Only thing that would of fixed it were a more technical view of the material and not inserting Kzinti Aliens from Asimov into Rifts.",
      "overall": "positive"
   },
   {
      "reviewerID": "A7NJVEL9E3L0H",
      "reviewText": "It's amazing! The dragon couldn't even touch me! And neither could my players when I toasted them with said dragon! And it is only made of cardboard! -- An excellent addition to your arsenal as a DM if you are running a &#34;Kingdoms of Kalamar&#34; campaign setting based adventure.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1Q4ZU2Y929N0A",
      "reviewText": "The Kingdom of Kalamar DM's screen can actually be a little daunting at first.  Four page fold out screen with several extra pages either stapled in or able to fold over revealing even more tables and charts that a harried GM might want when running a Kalamar campaign.  Kenzer & CO outdid themselves on this one, and for them that's saying a lot.  Just a few selections from each of the 16 pages of this well built folio...1) Treasure - broken down by level!...2) Weapons, shields, and armor...3) Mundane items and XP rewards...4) Ranged weapons, concealment, and turning undead...5) Diseases, poisons, and firing patterns...6) Actions in Combat (Do they provoke an AoO?)...7) A huge page for skills...8) Coinage of the realms...9) Combat basics, maneuverability, and more...10) Object hardness, Ability mods, and Morale checks...11) Skill Check mods, alchemical mixes, doors, and walls...12) Spellcraft, sleight of hand, Bluff, and knowledge...13) Tellene Deity Names...14) Carry Capacity, Movement, and mounts...15&16) A comprehensive look at the deities of Tellene...And that's not all of the features...Plus a nice dock scene and player maps for the players to look at.I'm planning a Kalamar campaign now, and the charts on this GM's screen are sure going to save me a lot of work in looking up the various factors that might come up during a game.  There's even a chart for ordering pizza! - A nice very funny touch, which I have come to expect from Kenzer & Co's main product, the Knights of the Dinner Table.If you're thinking of running a Kalamar campaign now, or you're already running one, and you don't own this product, my suggestion is to grab one of these while it's still available.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3TGHJJ3ZE8KCH",
      "reviewText": "The Fate Freeport Companion offers a great setting (who doesn't love a fantasy pirate theme?), however, the reworked skillset kind of limits the game somewhat. It seems like every other creature or NPC has a main stat that is great (+4 to rolls) or better for combat. This is countered by them not being able to take consequences like your character can, but it makes combat encounters pretty much a straight forward affair and the game is obviously based off a D20 type playstyle. D20 is great for what it is, a crunchy rule system for straight combat systems with little room for sway, however the Fate system is way more story focused and is about applying your characters strengths and weaknesses in unique ways. Combat and dice rolls are a very small part of the Fate Core experience and the Fate Freeport Companion seems to miss this concept. I still like the FFC because of the world, the characters, the ideas, and the overall concept and I can appreciate that Brian Engard and Clark Valentine were trying to combine these two systems in a way that made for a kind of 'common ground' feel, but it isn't freeform enough for one (Fate) and not rule specific enough for the other (D20).If a retread were attempted to remove the more crunchy elements and the system were to focus on the pure Fate aspects of the city and gaming sessions, I could easily recommend this as must have for a resource book for people wanting a fleshed out fantasy setting for Fate sessions. As it is right now though, I wouldn't recommend this book for Fate fans or D20 fans on the whole. If you are looking for settings for a Fate game, the Fate Worlds books are a better value in that they give you a setting, a general concept of what is going on, examples of characters, main players, etc. while leaving enough open for you to customize your gaming sessions and I feel they are much better values for your money and time. That said, I really do hope this setting is revisited and more refined for the Fate system because it is a very, very nice setting and I will still be pulling stuff out of it for my gaming sessions, but I would recommend newer players avoid this book because the skill change and combat heavy elements might turn you away from what Fate is all about.",
      "overall": "negative"
   },
   {
      "reviewerID": "ABN4ZDRME8P4J",
      "reviewText": "I've always loved the Enemy Within from WFRP 1st edition and basically classify it as one of the top 3 campaigns of all time.  The intrigue and role playing that it brings is amazing and I was worried when purchasing this product.Needless to say, I was very pleased.  As always the components from Fantasy Flight are durable and all accounted for.  The book was also quite hefty coming in around 190 pages.  Considering There isn't really any messing around in the book, 190 pages is a lot of information.  The quality of the pages, binding, and organization was also great and I don't see myself having to rebind and cover the book like many other companies role playing products, Steve Jackson Games have the worst binding!The way the campaign flows is very smooth and I like how the option to use Hero's Call material is open if you choose to.  I also love how they do the \"bad guy\" ;)  No spoilers!The only negative thing I can bring are that it's not a full reboot of the original which I was hoping for as the original was a ton of products 5 in total with 2 other option 1/2 products you could add in if you wanted to.  Overall though, I am still satisfied with my purchase.  But at the same time, if this was a reboot of the original I'd probably be very disappointed as I already have them!  Overall, it has the same feel as there is an enemy within, but the story is completely different and pulled off very well.Comparing this to other campaigns, I honestly would have a hard time doing it.  It's basically a long adventure (30-40 gaming sessions depending on what you do), not a full campaign setting that introduces new things.  But as a whole, I would throw this next to Ptolus and say that I'm just as satisfied with this purchase as that.  If you're not familiar with Ptolus, you're missing out!  In terms of an adventure on such a grand scale, I can't really think of any that are as truly epic as these.If you want something to spice up your game, use this and you'll have enough for a year!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2WLHOEEA9IHA1",
      "reviewText": "This was written as well as I expected it to be, the art was as great as I expected it to be, and over all its a worthy successor to the originals.",
      "overall": "positive"
   },
   {
      "reviewerID": "A31L2LNWHSJ3KG",
      "reviewText": "It was a pretty good read, but i was expecting much more from a 192 pages adventure.  There is a lot of background, which i feel is more than half the material and could have been reduced to make the adventure as epic as the original one.  I am still pleased though.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1YSLO4979DVQE",
      "reviewText": "Simple the best resource to teach chess for kids that I could find. Step by step learning. Compared toEl Pequeno Fritz (Learn to Play Chess with Fritz and Chesster), this is the best, no doubt. Grafically it's poor, but you dont need good graphics, you (and your kids) need good teaching!El programa tambien trae sus instrucciones en espanol: \"Escuela de Ajedrez para principiantes\". Simplemente lo mejor para ensenar ajedrez a tus ninos. He quedado definitavemente cautivado con la calidad del software de Convekta (tengo varios de ellos ya!), sin ocupar grandes recursos de la PC (graficos sencillos, no hace falta mas caramba!) cumple sus funcion a las mil maravillas: enseniar ajedrez sin rodeos. Comparandolo con el premiadoEl Pequeno Fritz (Learn to Play Chess with Fritz and Chesster), no lo dudo, me quedo con \"Chess School for beginners\" por lejos.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3R7ZGW6V2LECD",
      "reviewText": "Hello, a hoax has just been pulled either by AMAZON.COM on us or by CHESS CENTRAL on AMAZON.COM.First, none of the reviews relate to the actual product \"Think Like a King Chess Workout Family Package\".  All of these reviews are reviews on another chess product- Convetka's \"CT ART 3.0\".CT-ART 3.0I recognize this because I own both pcs of software.  Actually, the review by the \"GAMESMAN\" is an absolute schill. This fellow actually describes the \"CT ART 3.0\" product using the \"Think Like a King\" verbage like 'workouts' etc.  That's a real shame.Now I will discuss the product \"Think Like a King\".  It is strictly a scholastic teaching pc of software.  It is basically an interactive E-book reader.  The graphical interface opens 1 of 7 E-books, the 'workouts'.  The graphical interface shows a board and a chess position; the text is on the right describing the subject, such as 'en prise' and the problem on the board.  The user follows the directions of the text and often gets to make a move on the board.This is not a Michael Dela Maza style tactics drill software like CT ART 3.0 is.  It is a beginners introducutory course on chess which focuses on tactical elements.  There are series of 10-20 chess problems for the user to answer at the end of each chapter (or lesson) in the books.  It's a fine pc of software for a child.  Please go to [...] to find out about the product.I don't want to tear the product down, but AMAZON and/or Chess Central is engaing in false advertising here.  It's a shame because myself and many others use these reviews as a guide for purchasing products.AMAZON.COM please fix this!!!!  Chess Central has made a mistake (or a deceptive calculation) AMAZON Pull the previous reviews from this product now.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A12AVK1ZQDSOUZ",
      "reviewText": "This is an excellent training tool for players of over 1300 USCF. Additionally, it offers exceptional value for your money providing 100s of hour of valuable training for a very modest price.General comment on Tactical Training:Mastering the Tactical training consists of fast and accurate recognition of standard tactical ideas (motifs) and ability to calculate. Your training should be split in two parts - learning the motifs and then improving you ability to calculate. In the early positions you will have to go through simple 1-2 moves tactics involving double attack, deflection, attraction, and other basic tactical motifs. As you progress - you will have to deal with multiple tactical ideas, longer variations and more resourceful defense.The rating you get is more generous than it should have been, but nevertheless a good indicator of your progress.This tool is ideal for practicing! I use this software regularly so do most of my students. In my new book \"Chess Exam and Training Guide: Rate Yourself and Learn How to Improve\", I provide more information on how to use this tool as well as how to identify other suitable products for your training.Good luck!Copyrighted by me!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2PS12AD6LPBB6",
      "reviewText": "I really like the way this program drastically improved my tactical vision by just solving about 100 \"Grades By Difficulty\" puzzles a day for a period of a few weeks (!). My rating on ICC went up about 100 points and, equally important, my confidence grows accordingly. Wonder what this will do to my future otb-rating (ELO).Only two complaints:1)When taking a test there's no \"counter\" visible, so you don't have a clue how many puzzles you still have to go (I like the way other programs of theirs - like \"Intermediate Tactics\" give information like \"#5 of 50\").2)When you make a few mistakes, a small window opens up, showing you a similar position as the one you're trying to solve, which you can practice on, but... where the \"main puzzles\" have the (option of showing the) color you're playing at the bottom of the board, these small \"help boards\" always show the position from the White side.I find the above mentioned \"shortcomings\" annoying, but maybe it's just me...Overall, definitely a program worth buying, although I'd suggest you get \"Total Chess Training\", which not only contains CT-ART 3.0, but also 4 other interesting programs (Encyclopedia of Middlegames, Encyclopedia of Opening Blunders, Studies 2.0 and Strategy 2.0) for about $95. There's also a newer version of this product (\"Total Chess Training 2\") available for the same price, here on Amazon.com",
      "overall": "positive"
   },
   {
      "reviewerID": "A1FV87KBVYICLU",
      "reviewText": "If you want to improve your chess playing, buy this program.  In short, it will make you a better player.Under a master standard level (2000 ELO) tactics is the name of the game, and this teaches them.  There are over 1200 examples which are beautifully laid out, and there are friendly hints to guide you in the right direction should you not initially find the right solution.In my opinion, this is one of the best purchases you can make if you want to improve your chess.  Although after reading  Michael De La Mazza's Rapid Chess Improvement I was already a convert.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2BYPXW5Y0APQP",
      "reviewText": "First, the scoring system is a real modivator: depending on how you do on a problem your (estimated) ELO goes up or down.  I work harder on the problems because I want the gratification of a higher score, and if I am not paying attention I get hit with a score penality!  This constant reinforcement keeps me focused.  Second, chess combinations are well tested, and one can check his or her own solution using the built in Craft chess engine.  Finally, the system provides hints if you make a wrong move, allowing one to gradually work up to harder problems.  This software does not have a 3d graphic interface, but this software has all the other options that will facilitate your study.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1B72VETXUBPKZ",
      "reviewText": "I've played go for a decade.  since moving to the mainland, I've been unable to find live opponents, so I've been looking for a computer program.  I couldn't be happier with the program, except it showed me that I was a weaker player than I thought.  Fortunately, it allows me to set the levels and time to my needs.  Still have hardly gotten into the other facets of the program except it's play. If you are a beginner or a 2 dan, you'll be happy with this  program.",
      "overall": "positive"
   },
   {
      "reviewerID": "A22GUJTK1DM4BL",
      "reviewText": "The basics of the game of GO a very simple (think Othello) - but has more intricacies than chess.  Yes, there are plenty of free games on the net - and a downloadable version of Many Faces of GO is available. SEARCH I GOWIN.  For a newbie like me, I highly recommend learning the basics of GO and many important classical moves from the free software IGOWIN.But when you have the basics down - you can try a book. I'm more visual and the software has been easier way for me to learn \"hands-on\" with a Hint button.  Plus, when I play on the software, I learn more of the basic strategy which has been hard to learn from the books.I love the game of GO more than chess.  I play with my 23 yo son who understands the strategy better than I do - so, between games, I am learning with this software which is very user friendly. Since this is a game that will take a life-time to learn, I find that the software gives me patient learning that the even the lowest ranked on-line players can't give me - including the time to think things over and take back dumb moves.If you want to learn the game of GO - BEWARE, it is VERY adicting.  Try the free 9 x 9 version to learn the basics.  Then graduate to this program. It is good enough for beginners and higher levels of play.",
      "overall": "positive"
   },
   {
      "reviewerID": "A12FLZG7HJS393",
      "reviewText": "Hello,I have not bought this product, but anyone who was considering purchasing it in order to get an introduction to the game of baduk (or go) should first look at [...]The reason that I say this is that, a big selling point of this software seems to be that it includes an Internet Go Client that allows you to play over the Internet.  There are many freely available such clients.  All you need to do is follow the above link for a pretty good introduction to the game, a free Internet client or two, and a free server with many fellow players, of all skill levels, to play against.This is not to say that this product does not do an excellent job of getting someone involved in the game of baduk, I am in no way trying to discourage anyone from buying it.  After all, as I have said, I have never even set my eyes on this product.  I am sure that it offers a very nice experience, but at $89.00, I am almost as sure that the same sort of experience can be gained by freely available means.Cheers.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3340QE1QZ13J8",
      "reviewText": "You've got to check this one out.  Do you like war games?  You'll love this one.  The price is almost the best part.  You will love it!",
      "overall": "positive"
   },
   {
      "reviewerID": "A22730SIGH56JU",
      "reviewText": "The fact that I can finally play this with the soundtrack playing and play it at 30fps makes it perform and exceed better than the n64 version ever could! and I love The Turok series so this was a collectible as well as a childhood re-experience in the best form ever!! Windows 7 by the way for any of those who have questions on how to get it running",
      "overall": "positive"
   },
   {
      "reviewerID": "A2E5QU6JTC9LQF",
      "reviewText": "very fun, action packed, and difficult. I highly reccomend this game and skymom. you will not be dissapointed with this purchase",
      "overall": "positive"
   },
   {
      "reviewerID": "A22T07B9PMBO6K",
      "reviewText": "Quoted from the readme: \"This version of Turok will run only on 3Dfx-based Voodoo Rush cards.\"If you do NOT own a system with this card, do NOT buy this game.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A12E0Y0J6584RT",
      "reviewText": "This is one of a handful of classic PC games that really delivered. A powerful first-person shooter style game that includes some incredible battles with the ferocious beasts we have come to know as Dinosaurs. First released back in 1997 this program garnered many awards through leading gamers magazines. This spawned an equally successful, but less critically acclaimed program titled --Turok 2 : Seeds of Evil. Still unsurpassed , this program offers 14 incredible weapons that you can use to hunt down your hunter. A fully interactive environment Where trees crash to the ground. Waterfalls boil with foam. Bullets Ricochet. Bubbles form water rings. Cobwebs move. And SO MUCH MORE! A truly great program that will keep you on the edge of your computer chair.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2LM1QAD7577KN",
      "reviewText": "Good content with easy to follow directions.Interesting and stimulating game.You may end and start a new business whenever you want.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A26A2T909G5VIN",
      "reviewText": "Allright, I had purchased this game to accompany the textbook that was required for my Introduction to Entrepreneurship class at my local college.  The game is relatively interesting, and is quite comprehensive in some regards.  The goal of the game is to teach you skills necessary in running a business, and it is one of the most accurate business simulation games currently on the market.  Yes, it isn't perfect, but it does get the point across.  Can it be improved?  Yes, but I'm sure that will come in subsequent versions.  I wouldn't necessarily purchase it just to play for fun, but as required for class, it was a break from the norm.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1DDGFKPJSJLGE",
      "reviewText": "This product is required for a class I am taking and it won't allow me to play the simulation.  I am able to log on to my profile online but when I go to play the simulation it won't let me log on.  I only get on once and a while.  It has got to the point where my grade is being effected and it is out of my control.  I have contacted them multiple times before I got a response, and when I did get a response it was a call during the morning during class.  I haven't been able to get back to them and still wait for a call during a time where I can answer.  Terrible product, and service doesn't live up to what my teacher and their site makes it out to be.  Very disappointed, waste of money, beg your teachers to come up with an alternative assignment.",
      "overall": "negative"
   },
   {
      "reviewerID": "AL47NO4I5RNKN",
      "reviewText": "Very good game,easy to play very  interested and challenging.i would recommend this game to every one and all.Bla,bla bla,bla, very good.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2X9LA7PHNXFBW",
      "reviewText": "I purchased this game disk as a Christmas gift for my mother. When loading the games, it installs all the games with a single tile in each game. This means you have a screen of 50+ tiles all the same. There is no way to play it. I tried contacting Viva Media and SelectSoft to find out if this was a defective DVD. I cannot get a response from them. Don't waist your money.",
      "overall": "negative"
   },
   {
      "reviewerID": "AV8YPDH3KS6TS",
      "reviewText": "World of Mahjongg is a TERRIBLE product. When I got the product (which claims it has 2 discs and truly only has 1), I was unable to install it on any computer. The version of windows that I have (on all 3 computers) is XP and that is supposedly the most compatible with this product...I have a DVD ROM drive as well (also on all 3) and the program still would not load on any computer that I tried to install it on. When I asked the seller for help, they refused and when I contacted the manufacturer they were also of no help. I do NOT recommend this product to anyone. What a WASTE of time and money!",
      "overall": "negative"
   },
   {
      "reviewerID": "A3FP0Q1G4L2FJ1",
      "reviewText": "I enjoy the game but have not found the familiar version of Mahjongg that I played on my old computer.  In time I will figure it out and enjoy it more.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A25VARPBQ4CXDR",
      "reviewText": "Software didn't install properly, I tried 3 times, then put software aside. I guess I won't be playing Mahjongg with your product. I'm using Vista. But product said I could use it on this system.  Not a happy camper! Price was right, that's all I can say!Jo",
      "overall": "negative"
   },
   {
      "reviewerID": "A2WMBFIYGK5C45",
      "reviewText": "I just bought this game and I agree with the other one star reviews.  There is no way to play this game.  No way to change the layout or the tiles.  It's nonsense.  I'm uninstalling it right now.",
      "overall": "negative"
   },
   {
      "reviewerID": "A17TJMEPU8TRCG",
      "reviewText": "I have tried to install this game twice.  There are not two discs.  The instructions say that there are a million layouts.  I can only find one.  The \"edit\" file is empty.  I can't find any information.  I followed the instructions and there is nothing in any of the so called edit files to either install a different layout or create one.This game and the creators as well as the publishers of this game are committing fraud and theft.They should be investigated.Amazon is doing its customers no favor by selling this item or anything by this creator of games.I was forced to give it one star.  I wasn't going to give any stars.  It doesn't deserve ANY star.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2GZ5P1Y5K47S6",
      "reviewText": "This software has endless game variations and layouts to keep a player inerested and challenged. I highly recommend this product for hours of fun!",
      "overall": "positive"
   },
   {
      "reviewerID": "A20JBRSRRBMM70",
      "reviewText": "I agree with the other one star reviews.  I have now uninstalled this PC game after many attempts of loading it. It seems you can't get into the different tiles or layouts it claims to offer.  It also states two discs when infact, there is only one disc.  It is a waste of time and money.  The price is right if it only worked.  I am really wanting a Mahjongg Holiday PC game anyway.  I guess I will keep searching.",
      "overall": "negative"
   },
   {
      "reviewerID": "A22XHJSABFUF9Q",
      "reviewText": "It is very, very hard! I bought this game for 20 bucks, and it is worth 50 cents.The cover makes the game look all glamorous, but on the inside, it stinks. The differences on the two pictures are so minor, that they are half a millimeter thick and tall. Also, they give you SO little time to find all 5 DIFFERENCES! Only 15 seconds to find so little differences? Plus, when you find differences, it takes away over 5 seconds of the time you have! This game is stupid. Don't waste your money.",
      "overall": "negative"
   },
   {
      "reviewerID": "A38INDU55D5VTV",
      "reviewText": "get this game figured out! It was a huge waste. I thought we would be able to do the puzzles it advertized, but it makes you find hidden things in pictures .. very difficult.. this is not a wheres waldo level. This is really hard! Very unhappy!",
      "overall": "negative"
   },
   {
      "reviewerID": "A2VQM4ZG09A6LE",
      "reviewText": "This was purchased for a 5 year old.  She enjoyed it for a fair amount of time and then it has been enjoyed by a younger brother.  Now 6 and 8 they don't play much, so I would reccommend 4-6 age category.  As a side note at 6 and 8 they both still enjoy puzzle type games, but play Mario more now.",
      "overall": "positive"
   },
   {
      "reviewerID": "A14BKH5NL3W7V5",
      "reviewText": "I enjoy the &#34;Spot the difference&#34; puzzles, but then there are the puzzles in between, which I don;t enjoy,  And you have to complete these puzzles in order to move on to the next level,  Basically, I played it twice, and haven;t picked it up since.",
      "overall": "negative"
   },
   {
      "reviewerID": "AQ8C3JEIL0Q9Z",
      "reviewText": "My wife saw our grand daughter playing this game so she got one for herself. Her sister saw her playing it and liked it so my wife bought this copy for her sister. It will give you hours of enjoyment with a little bit of frustration.",
      "overall": "positive"
   },
   {
      "reviewerID": "A21WVMM3FA60QO",
      "reviewText": "I am great at solving games i get within either a day or a couple of days so i am constantly buying new games. Well this one has me stumped. I can't get past this certain level so right now I am giving it a break. LOL. The game is fantastic. More for tweens, teens, adults. Not little kids.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2Y3QK6HVK01XU",
      "reviewText": "I absolutely love this game.  You may think it is easy to find 5 differences in the pictures but it is really a challenge.  This game will entertain you for hours.  I play it every night. I am still playing the Rookie level which offers just the right challenge for me right now.  Ameteur level is a little more difficult.  I love the Frantic pictures in between and the slider puzzles that you have to complete in order to open more levels of pictures. Get this game. You won't regret it.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1OHFCZGB07RMV",
      "reviewText": "amazon asks a lot of questions , but I just wanted you to keep your high score cause that's how I base a lot of what I buy. Thank you.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2KBL5XP89LR9R",
      "reviewText": "it was fun finding the differences in the pictures, but it got boring when the same pictures kept comming up. it would have been better NOT to have a time limit on these games.  that just makes it harder and frustrating for beginners like me.  i am handicapped and disabled and don't move that fast.  also i just turned 61, so i'm not that fast mentally either.  there should be an option to choose if you want it to be timed or not.  there should be that option on ALL games.",
      "overall": "positive"
   },
   {
      "reviewerID": "AGKHQA6OATS1E",
      "reviewText": "This game is way too easy for adults.  For kids, it's great.  I wish they made one for adults though with more difficulty levels.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A29H36FBJFJL1C",
      "reviewText": "It was okay i really didnt like the fact that if you don't get everyone right you have to start over",
      "overall": "positive"
   },
   {
      "reviewerID": "A3929CLL1M1CKB",
      "reviewText": "I didn't enjoy this game nearly as much as I hoped to. It's repetitive, and the Nintendo DS screen is often much too small to effectively seek out the differences in the the two images. I can't recommend this game for the Nintendo DS format, not in good conscience. It's a headache-maker.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2VZZOJU97NFUJ",
      "reviewText": "I loved this game so much that I bought my 65 year old father a Nintendo Ds game and introduced Photo frenzy to him... he is addicted, he loves it!",
      "overall": "positive"
   },
   {
      "reviewerID": "A3LVQW0AOLB87V",
      "reviewText": "This is a very fun game if you like the photo hunt type of games !! The easy levels can still be hard and it is very addictive and hard to put down .Tons of replay value and it is an awesome game to just zone out to . Kids will have fun with it too ! I am new to the DSI and it has been hard finding games that are fun to play for an adult, that last over 2 hours .. This was a good find and even better for the price",
      "overall": "positive"
   },
   {
      "reviewerID": "A2FA4FBRYJ7IQG",
      "reviewText": "If there was a way of turning off the timer or adjusting it, I'd give this game 4 or 5 stars. It's VERY irritating to be timed constantly especially when you get to the hard puzzles. I wonder how they came up with the amount of time they give you? It's NOT enough. And that's a deal breaker for me. Sometimes I just want to relax and take as long as I want! If this would bother you too, DON'T buy it!!",
      "overall": "neuter"
   },
   {
      "reviewerID": "A2XT3Q34EC59TO",
      "reviewText": "my kids really love this game.  There are so many of them on the game and even i like to play it.",
      "overall": "positive"
   },
   {
      "reviewerID": "A22NJSAGGE9VNQ",
      "reviewText": "This is the find the difference in two photos game.  If you like that sort of game, like I do, it's fun to play.  The only thing I don't like is every once in a while to pass the round you have to solve this puzzle (remember the cheap puzzle toys when you were a kid where you had to slide around 15 blocks to make a picture in a 4x4 block frame), and I never liked those puzzles, even as a kid.  Because of this \"bonus\" feature, I didn't give the game 5 stars.",
      "overall": "positive"
   },
   {
      "reviewerID": "A835UVXZ9QMPN",
      "reviewText": "I like this game it keeps you going for more. As you start thinking you know where the difference is it will give a scene that has'nt been played at all. You do need to take 20 minutes break, this game does make my eyes get blurry, but it is so fun to play.",
      "overall": "positive"
   },
   {
      "reviewerID": "AK8JKV2ITQLGD",
      "reviewText": "If you can find previous versions of Fritz, buy them. They are cheaper and can do everything that Fritz 10 can (for a hobbyist player) and don't require a CD to be present in the drive at all times. Beginning with version 8 (and updates), ChassBase introduced a very nice feature when you can watch their video demonstrations with synchronised pieces movement on the board.",
      "overall": "positive"
   },
   {
      "reviewerID": "A15ZWA1ISGRTSD",
      "reviewText": "This software is fast and can help quite a bit with preparation as well as going over your games. It doesn't need to be said that this program is ridiculously strong as an opponent.",
      "overall": "positive"
   },
   {
      "reviewerID": "A18926L7ZBLJAV",
      "reviewText": "This is very easy to use and is worth the price. But it has a few small errors which have been fixed in the latest edition.I would not pay a huge price for this upgrade.Fritz 10 is value for money.",
      "overall": "positive"
   },
   {
      "reviewerID": "ABERJSY2U5YJL",
      "reviewText": "This product may no longer be available, but I had to get my 2 cents in.  I am a fan of the Fritz series for analysis, but I didn't want to pay almost $70 (with shiipping) for Fritz 11.  Fritz 10 was about $20 and is a big improvement over Fritz 8 for analysis.  By improvement, I mean that it does deeper searches much quicker.  (This is useful for analyzing opening lines.)  Besides analysis, everything else is pretty much the same.  The Fritz programs are probably not the best for playing for anybody rated below 1900.  The modes for weaker players are not very interesting because they are designed to make random gross blunders.  It is not as fun when the computer plays like a Grandmaster and then hangs a piece.  Why can't we have a hundred levels that go evenly from absolute beginner up to Grandmaster?",
      "overall": "positive"
   },
   {
      "reviewerID": "A219P4I3QXS2FB",
      "reviewText": "If you're new to chessbase engines, Fritz is absolutely the one to get.  It has all the features you want: great database, an engine you can customize to your level, great analysis function, a computer that can beat the socks off you if you need it.  And of course, the program is designed ideally for Fritz.  If you go for one, only get Fritz.Here's what I thought about some of the new features: The 3d improvements are great for a few games.  Then you go back to 2D because it's still easier.  I've run this program against several others on my computers.  It matches well against Rybka and is superior to everything else.  If you already own another recent chessbase engine, though, you won't find anything really new here.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A34VRVI4CSI5RQ",
      "reviewText": "Fritz 10 is the latest and greatest version of the German chess program put out by ChessBase, a specialist in chess database and playing software. It boasts a set of new features and improvements over its predecessor, and all indicators suggest that it delivers. That said, Fritz 10 may or may not be a wise purchase, depending on why you want it.I will start off by saying that if you are interested in this package as a playing partner and you already have a very strong chess engine to spar with, Fritz 10 is likely a waste of money for you. As another reviewer stated, the engine is so strong that it will crush all but the top grandmasters in the world, so casual play will be frustrating for hobbyists. However, if you want it because you plan to do some serious analysis work and you want the latest engine, it is worth more consideration, though there are stronger engines such as Shredder and Hiarcs. Fritz 10 does a nice job of automatically analyzing games, adding some natural language notations with the move notations, although it is debatable whether or not these notations are very useful.The improvements over its predecessor are mainly in the GUI, not the engine (although the engine shows some promising improvements as well but does not drastically demonstrate strength over its predecessor, Fritz 9). There are some new training features such as showing the engine's plans, which is a solid tool in the toolbox when trying to improve. The sparring and friend modes are also very helpful, though I must concur with the previous reviewer in that the engine makes some silly moves when you \"dumb it down\" to meet the player's skill level.The graphics ability of this package are much improved, offering better piece rendering and display. This is not necessarily a very important feature unless you like your eye candy.As a UCI client, ChessBase seems to have ironed out the problems of the past. The GUI even seems to have a fairly good idea of how strong imported engines are, which is made clear when playing rated games. In testing a few imported engines, Fritz 10 did well in managing these engines and everything was stable.Updates to the PlayChess interface include weather reporting. I have to ask: How useful is this in a chess program?Overall, Fritz 10 is a very nice package and is worth the money if you want a strong program that can analyze games and can connect you to other players on the net. There are stronger engines out there (and some of them are free downloads) so if you are looking for the very best engine on the market, this isn't it. Also, if you have an earlier version and you want it because it's \"the latest and greatest\" in the hopes of getting a hugely improved playing engine, you'll probably be disappointed. However, if you want pretty graphics and an intuitive interface or if you are looking for a good training tool that can help you to understand your game a little better, Fritz 10 is a good choice.",
      "overall": "positive"
   },
   {
      "reviewerID": "A353B5OAAU2IP5",
      "reviewText": "If you love playing chess and are interested in getting better, Fritz10 is definitely the one to get. There are a couple of stronger engines, like Rybka 2.1 and Hydra,but any engine strong enough to defeat the world champion isstrong enough for me. (Note: Kramnik recently lost to the Deep versionof Fritz 10, but basically the difference between the two is lessthan 30 elo points. And that's on the slowest time control. (On anytime control of an hour or less per game, any of the top 5 chess programsdominates Kramnik and Topalov, the 2nd best human chess player.Where the (world grandmaster strong engine) comes in handy is not in playing against it, (A most frustrating endeavor to be sure),but in helping a player \"see\" what the engine is thinking. No human or even chess program can play perfectly, but today's top engines comepretty darn close, as Kramnik can attest to.You can of course tweak the engine to play weaker, but onebad point of Fritz is when it \"dumbs down\" it's engine, itdoes so at the expense of realistic play. I.E. leaving a pieceen prise, which doesn't happen often even among \"mere\" experts.at slow time controls.The user interface on Fritz 10 however is very user friendly. The browser like icons on top of the picture is one example.If you're not sure what an icon is for, just hover the mouse overthem and it will tell you. Everything is customizable from thelook and feel of the board to the sounds, even to such minutedetails like the look of the fonts on the notation.All very intuitive.There is an updated database (to 9/06) which includes thecontroversial Topalov-Kramnik match. You can search among1,100,000 games by name, opening, position, even endgame pieces.You can play some historical games by such great playerslike Fischer and Capablanca, and you can see how many \"inaccuracies\"they made. And brilliant moves as well.But for me, the best part of Fritz 10 or any chessbase compatiblechess program, is the play server. That alone is worth the priceof the program. It's simply the best place to play. At this server,you also get to watch grandmasters play blitz and whenever there is abig tourney like Linares or a world championship match you can watchevery move LIVE. And unlike most chess servers, here all your gamesare kept on a separate database that you played online, and studythem with the help of your world class analysis partner, Fritz.This is very long I realize but I haven't come close to touchingon all the features like training modes, 3-D graphics, chess variantslike giveaway and chess 960, importing chess books etc.If you have Fritz 9 and your one year subscription to it's playchessserver has not yet expired, then perhaps you don't need to get Fritz 10.But if you're anyone else who plays chess and loves following thegames of great players, then you won't go wrong with Fritz 10.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2QNYO5VK24YE4",
      "reviewText": "I purchased this item thinking it was Deep Fritz 10 because of the picture, but it is NOT Deep Fritz 10.  It is simply Fritz Chess single core version 10.  If it was advertised as Fritz Chess, I would not have purchased it since I already have that version.  The program itself is nice, 5 stars!  But the advertising here is misleading.  As such, I only gave it a 2.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2BY2QHB6S6ZCO",
      "reviewText": "First off I would like to point out that Windows Vista users may experience a hassle installing this program to their device, but this can be remedied by inserting the disc, navigating through Windows Explorer to the disc drive (usually drive d), right-clicking said drive and 'Explore', then locate the 'Setup' icon and right-click that and 'Run as Administrator' and you've avoided the hassle that I went through, but anyway that in no way influences my take on the product. Secondly, I would think that anyone who would install a chess program on their device is serious about chess, so this product review is not for, and will not be recommend this product to beginners. However if you are opened minded about learning new software and you casually like chess I say give it a go.  In a nutshell, why I would not recommend this to beginners is that I think that's a necessary for a demo of this product to be available for them to get a feel for the software, as it would obviously help beginners and novices understanding the training sections without having to pay for it first.  The training section is a little underwhelming for someone over 1800 USCF ELO, especially the tactical training - there should be more puzzles added from time to time perhaps or the ability for user created puzzles to be shared through the servers, as the puzzles included are not really all that challenging.  The Opening training is pretty decent and you can learn an Opening on the fly, say if you are at a tournament and you just want to whip up something new right before you play your next game, you can definitely benefit here, and the included ECO theory is quite handy, especially for fast chess. The Endgame training is OK for 1600 USCF ELO or less players, and it should include access to 3,,4,5,6 Men Tablebases, Pocket Shredder has this is if this is what you are looking for, but it doesn't and its not that big of a deal, but for the more serious players such as myself it would be greatly appreciated.  Another feature that I would like to see in Pocket Fritz 4 (the next version of this software) is DGT compatibility, again the more serious player would gratefully appreciate this.  But to make up for its shortcomings there are two things that help make for it being a great pocket chess companion that I'll I point out, and the first being the instant access to chesslive.de, the complete game database of Chessbase (over 4 million games), so you can search, and play over any player's games that you wish at anytime, and the second thing is the ability to set-up the board with random positions to train yourself with, say you could play a handicap game with Knight odds for example. There are other little touches, cosmetic and functionally, that make it a great program, but what do you want such a program for in the first place? As a pocket chess companion and it does that quite well. I would highly recommend this program for casual to serious chess playes only, and by serious I am not suggesting you need be a certain rating to be serious, but one that does study and plays chess quite regularly.",
      "overall": "positive"
   },
   {
      "reviewerID": "AFGUAKBFCQL4H",
      "reviewText": "Bought it to replace the  problematic Chessmaster program. So far so good!  I recommend buying  this product and you will be pleased.",
      "overall": "positive"
   },
   {
      "reviewerID": "A7DWJJNT62IA9",
      "reviewText": "Very hard to learn the interface, but I knew that going in.  I bought this because I use a laptop, and heard that the copy protection software used by the next-best competitor required you to have the DVD in every time.  This can be really tough on a laptop DVD player, so I went with Fritz.  Note that this is an old edition, but you get 95% of the good stuff for a song and a dance.  Unless you are planning to go pro, this is all you need.",
      "overall": "positive"
   },
   {
      "reviewerID": "A31PCCSMDTQ1PU",
      "reviewText": "The Fritz 12 Graphic User Interface is infinitely easier to use and understand than the Aquarium GUI, and you still get that totally cool 3D board option which Aquarium doesn't have.I totally agree with all the excellent things other reviewers have said, but do consider this: On June 10, 2011, World Chess Champion Viswanathan Anand told Chessvibes.com his preferred engine was Houdini over both Rybka and Fritz.Deep Fritz 13 (not 12) now has Houdini 3 installed into it and is the ultimate way to prepare for an OTB tournamemnt by weeding out any inconsistencies in your favorite openings.Deep Fritz 12 is still important however since you can install the free Houdini 1.5 download (ELO 3250) or the Houdini 3 Pro version (current CCRL rating 3347) in the Fritz engine management tab under the:\"create a UCI engine\" option.Why is a high ELO rating so important?Because when you go to your next OTB tournament, rest assured at least one of your opponents will have his openings down pat with many new ideas and  all inconsistancies worked out well in advance and approved by the worlds strongest engine which is Houdini.If you prefer to rely on the weak main lines and sloppy analysis found in both the \"Secrets of Opening Surprises\" or \"Dangerous Weapons\" books then you may learn the hard way (as I did)by losing many games after reaching terrible positions during the critical opening stages of the game. So I agree with all the good things said about Deep Fritz 12, but its really the excellent GUI(Graphic User Interface) provided that makes Fritz invaluable in creating a truly powerful opening arsenal that will give your opponents something to think about.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2TQ7XHDPCMYMR",
      "reviewText": "I'm using an older laptop with an XP os .That means there is no Microsoft Chess Titans game installed .I was having Chess withdrawal symptoms and needed a Chess game in my laptop.So I purchased Fritz 12.Excellent program with a large amount features. Inexpensive and a lot of bang for the buck.You will not be disappointed.",
      "overall": "positive"
   },
   {
      "reviewerID": "A4XPK8I9S14WA",
      "reviewText": "This is a classic. And is at good Price! Recomended for people who want to buy a very powerful chess program at a very affordable Price! Maybe is not so &#34;user friendly&#34; and it is not in spanish, but it is OK. Recommended.",
      "overall": "positive"
   },
   {
      "reviewerID": "A15E81V83A4N5I",
      "reviewText": "I bought the $14.99 Fritz 12 edition.  It is the same as the more expensive edition except that it does not include the premium membership to the online playchess.com.I have used Fritz 8 in the past and was not too satisfied with it.  I decided to try this edition after reading the hype.This is a good program for the money.  It installed flawlessly; it is strictly a Windows program so I had to run it on my Mac using VmWare.It is still a little glitchy as in the past, but the new interface helps a lot.  The 3d is excellent and lifelike and a great step up from what I used previously.I am not a great player (1400) and the computer's response seems to be more realistic when I tone it down to my level.I don't doubt that a few people were not satisfied with it, but, if I can run it on my Mac, they might seek a solution to their problem instead of giving up.",
      "overall": "positive"
   },
   {
      "reviewerID": "AYT7L3WEL419G",
      "reviewText": "This is the old edition, but it's great and a great price.  I've come from a background of playing Chessmaster and this old version is cheaper than the typical Chessmaster offering and much more of a power-user type of software.",
      "overall": "positive"
   },
   {
      "reviewerID": "A20F5QE8T48JQO",
      "reviewText": "Since Fritz 13 was out, I decided to gamble 15 bucks on Fritz 12.  What a frustrating mess.  It's as though the software engineers sat together and tried to design the most user-friendly interface they could dream up.All I want to do is save a position or a game into a database.  I'm now hours and hours into internet research, saving online manuals, and rewording my Google searches just to figure out how to save a game.  Still can't do it.Make a new database?  Great!  Did it!  But how do you find it?What garbage.  These people should be ashamed of themselves.",
      "overall": "negative"
   },
   {
      "reviewerID": "ATHGLESMEL4UI",
      "reviewText": "After I opened this I set up an engine tournament with Fritz 10 and 11 and Crafty 24 and Stockfish 2.2a.  I expected Stockfish to win because it used all 4 processors on my computer while all the others were restricted to one processor.  Fritz 12 won the tournament by 1.5 points.  To test this further I set up a 12 game head to head tournament with Stockfish and one processor Fritz 12 tied four processor Stockfish 6-6.  This won me over.  I use Fritz 12 to analyze games almost exclusively.  The major disappointment was the Fritz trainer samples which were cut down to about 2 and one half minutes each.  They became more like advertising \"teasers\" than real instruction videos.  If you are primarily interested in the training aspects of a chess program, I recommend that you get Fritz 10 or one of the latest Chessmaster programs.",
      "overall": "positive"
   },
   {
      "reviewerID": "A37NNZQQVDAEH3",
      "reviewText": "I'd love to be here giving it a great review, seeing as I wanted a chess program that Fritz advertises itself as being, but Amazon is pretty much selling a worthless DVD.  I have to register everytime I use this DVD.  I have to remove the whole program and then re-register everytime I want to use it.  What's the freakin point of including a registration number that won't work?  Basically, I have a $20 cup coaster.Yeah, this isn't exactly a review of the program, so take it for what it is, but beware of the trash you're likely to receive.",
      "overall": "negative"
   },
   {
      "reviewerID": "AWWQVZ7EYH00Y",
      "reviewText": "Item was as described but I was one day away from going through steps to get my money back as it was nearly three weeks late.  I was really worried.  I chose the cheapest shipping to Canada so if you are in that boat you may want to look elsewhere if you need the product within a month.  Other than that, great product in perfect shape.",
      "overall": "positive"
   },
   {
      "reviewerID": "A46GXHRSUR2K1",
      "reviewText": "I Purchased this software to continue my membership at Playchess.com server. Unknowingly that Playchess states it is good for only 6 months membership. In the past it has been 1 year, and there is NO place in the description it says anything about that issue. As a matter of fact in the Manual on the dvd disk it clearly states 1 year single account membership.Buyer Beware.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A3JL3YQYI7OR5O",
      "reviewText": "I have run old versions of Fritz 7 and Fritz 9 and decided to take the plunge on 12 since I didn't care about the group analysis feature of 13. I am glad that I made the change. Fritz is notoriously difficult for a beginner to use compared to something like Chessmaster. The advantage of Fritz 12 is that it incorporates the now standard ribbon interface. This groups together commonly-used features, which makes finding what you need much easier.It still feels more or less like its predecessors, but it looks nicer. I really enjoy playing this on friend mode because it gives me a good game that will beat me if I don't play well, but will reward me with a win if I do. I like the instructional videos in Chessmaster a little better and I think that the 3D boards are nicer in Chessmaster (at least they will run on my old netbook whereas Fritz has some problems), but I'd rather sit and play Fritz. I also use Fritz to keep a database of all my OTB games.I am very glad that I spent a few bucks and picked up this version. Overall, it is a fine front end for some good chess playing.",
      "overall": "positive"
   },
   {
      "reviewerID": "ASROVJ5DQ3TER",
      "reviewText": "I just installed this a few days ago; already I love it. I've found the user interface fairly intuitive: So far I've learned how to set playing levels, find and play the tutorial videos, play tournament-style, view and print score sheets, and more. When I ran into confusion with the user interface or options, the help system provided the info I needed.I'm running the single-core version on a dual core Thinkpad under Windows 7 Pro. Some people had trouble installing or running it on Win7, so I hope my experience will help:To install, I ran the installer (setup.exe) in administrator mode and selected the \"allow this application to modify the hard drive\" option.To register, I entered the product serial number from the label inside the case and the validation code displayed in the licensing dialog box. (NOTE: This step could have clearer instructions I suppose, because it took me two tries to get it. The first try, I just entered the serial number and clicked OK. That resulted in an error message but the program ran anyway. The second time I ran the app I again got the licensing dialog box, and again entered the serial number, but this time realized that the dialog box was displaying a code in large funky letters. Entering this code in the field next to it--after entering the serial number--worked.)Now I can run the program with no license dialogs popping up, and I don't have to run it in compatibility mode either.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2VOP0VUOWAVPO",
      "reviewText": "This product should only be purchased by a serious chess enthusiast. It's a bit difficult to navigate the software and it didn't come with any instruction manual. I wouldn't recommend it for a casual player.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1PAGBU5YFMI4R",
      "reviewText": "As a very casual chess player, I decided to give Fritz 12 a try. The program is smart enough to obliterate just about anyone, but you can play the game at several different difficulty levels. It even has a friend mode where the computer determines how strong a chess player you are and plays at close to your level. This is one tough opponent - even in the friend mode. There are also several \"personalities\" you can play against. Each personality has preprogrammed strengths and weaknesses (including how badly it blunders). You can also change several of their attributes to make them a stronger or weaker player.Fritz 12 is packed with training tools. You can set the game up so it suggests opening moves; warns you if a square you are about to move to is under attack; give you hints or suggested moves; tell you what your opponent is planning to do; and much more.The free beginner training videos are good. There are also several sample videos for other topics included, in hopes you decide to purchase additional training videos.Even at full price this is a terrific training tool and should certainly help you improve your game, even though you may get a bit frustrated if you like to win.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2GHKKR26TQ4CX",
      "reviewText": "I recommed this software, it's very good to play and learn from, it's good for all people. Is necessary improve some things, like the 3D configuration options and real clock view.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1XS2BTMVNE7IN",
      "reviewText": "Been trying to play this program for about two weeks.  Everything about it seems overly complicated yet poorly programmed.  Difficulty levels seem to vary wildly no matter what settings you choose and the tournament games keep freezing up.  Then I realized the game was not freezing up, but that I could move my opponents pieces but not my own.  Tried doing the online update to see if this would fix the problems and the update kept crashing whenever I tried to install it.  Very frustrating.",
      "overall": "negative"
   },
   {
      "reviewerID": "A4TRW9IKMK66A",
      "reviewText": "For a chess program that has been around so long I expected much more. the program is hard to use - an on-line manual or tutorial would be most helpful. In my opinion Brain Games Chess is far more enjoyable.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2LLMEZXJISTPZ",
      "reviewText": "This game is the best chess program out there that I know of. It plays excellent chess and the pieces look nice. However, when you move the ELO slide to the minimum, it plays really hard, about 1100 ELO rating. I played it at this level using Online Chess Kingdom and Chess master (PSP games) at the highest level vs. fritz set to the min level, and so they lost to fritz. It was easy to tell Fritz wasn't playing at 1100 ELO, but closer to 2000. The PS3 version of Fritz doesn't have this shortcoming, you feel drastic changes at different ELO ratings, but this computer version you don't feel much ELO change. Another shortcoming is that the game freezes if you choose the \"render light\" option, it slows down significantly if you improve all the graphics in the option menu, and the game flashes once in a while. Some windows don't close despite they have the \"x\". The clicking sound can be deactivated, but it takes some googling time to find out how. On the positive site, the sense of humor is a unique touch, since playing chess can get really quiet. This game could use more chess sets and picture wall papers like in Chess Master. Everything else, I wouldn't change.",
      "overall": "positive"
   },
   {
      "reviewerID": "AUY2WTV2468AJ",
      "reviewText": "Fritz Chess program, has everything you can think of,for a complex chess game. But it's not a fun chess game to play. It's not user friendly when you're wanting, to play for fun.I have used Spark Chess game on line. It's fun, easy to see your chess board pieces, not a complex chess game,it display your game pieces movement on the board,and has different levels for players.If you're wanting to be a Grand Champion, Fritz is your program.",
      "overall": "negative"
   },
   {
      "reviewerID": "ARCNQPEO58JWW",
      "reviewText": "Fritz is tough. It has a rating of 2800! Only the top 10 chess players I think could beat it.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3G65W1QDUO4CG",
      "reviewText": "I use to own Chessmaster and I liked it a lot better. I found the ability to adjust the playing levels difficult to understand. I also find the comments made by the program annoying.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A27XPVJ5E5XF8G",
      "reviewText": "Fritz Chess is the best for learning and enjoyable because the program comments lend to the atmosphere of playing against someone. If you even dabble at learning the game, you'll appreciate this software.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3FZSU10LY0L29",
      "reviewText": "I purchased this for my husband who love to play chess. He can't seem to put it down. truly recommend if you love chess",
      "overall": "positive"
   },
   {
      "reviewerID": "A34VRVI4CSI5RQ",
      "reviewText": "Fritz is arguably the most commercially-successful and popular chess package available. I started using Fritz at version 6 and have purchased most of the upgrades, up to version 10. With each successive version the whole package has gotten better and better though some of the upgrades were more worthwhile than others (one reason I never purchased version 11). Version 12 is a quantum leap forward, though it is still not perfect.Installation from the DVD was painless and uneventful. However, there is one issue with the installation that bothered me - the installer never installed a desktop icon or a program group, so I needed to navigate to the installation directory, from which I made a shortcut to the application binary on the desktop. After this step, everything has worked smoothly and I can launch the application without issue.The interface has gotten a huge facelift - this is not a color scheme change or rearrangement of the menus and toolbars, but rather it is a complete overhaul with Windows ribbon controls serving up the components. Normally, I would be wary of such a large change to the overall interface, but ChessBase has done an excellent job of designing the interface and it is very well-organized. There is a learning curve, though, for people who have grown very accustomed to the older ChessBase interface, as some things are a little difficult to find unless you have familiarity... Given a couple of hours of exploration, the interface becomes second nature and finding things becomes easy again.The Fritz engine itself is a strong one, able to crush practically any human player (including seasoned grandmasters) with ease when used at full playing strength and it holds its own against other top-drawer engines. It is not the strongest engine available, but for the vast majority of players it doesn't need to be the strongest. When using an engine this strong, playing against it is not the most useful activity; where engines of this strength are most useful is in the analysis of games.Fritz includes several analysis modes, my favorite being full analysis for post-mortem scrutiny of games. The full analysis function works backward through a game and adds move suggestions as well as canned commentary as the selected chess engine evaluates each position. Though the English commentary is not always especially informative (for example, comments like \"This is a futile try to save the game\" are common), the comments do add a more \"personal\" touch to the analysis which would otherwise be simply a dump of suggested moves. When the engine finds an especially good move, the commentary is usually a little more helpful.I found an annoying glitch with the Full Analysis mode. After fully analyzing a game, the interface simply chopped the last quarter of the game from the report, even though I could still iterate through all of the moves. I never could get the rest of the analysis on the screen.Another very helpful analysis mode is \"Infinite Analysis\" which takes a single position and continuously analyzes it until the engine is interrupted or the position is changed. This is especially helpful for taking a deep look at a position and trying several what-if scenarios.Deep position analysis is another mode, as is Monte Carlo, though I have used these so little that I cannot really comment on them.The last analysis mode I will talk about is \"Engine Shootout\" which takes a position and feeds it to two or more engines for analysis. These engines evaluate the position and play through, with the intent of determining how the game would proceed and the outcome as a result. Though it's a feature I really don't need, it is something I use occasionally to look at games I have played when the game was unfinished but the outcome wasn't clear. Different engines arrive at different conclusions which makes this even more intriguing.The Fritz package includes a large database of games, which can be used to explore and analyze. Where I find this database to be most useful is in researching specific styles of play. For example, it is easy to track down all of Tal's games and follow his playing style with the database search functions.Also included on the DVD is a set of training videos. To be honest I have never found these to be especially helpful but others may very well benefit from them.The UCI interface continues to improve, so adding in UCI engines is easy and reliable. I have found several weaker engines against which I can play so I have them bound into the interface for playing. I use the Fritz 12 engine for analysis after the fact.Central to the Fritz interface is access to the ChessBase chess server. Through the interface, players can log into the server, play games, read chess-related news, watch seminars, and observe important matches with live coverage.There are a couple of different versions to this package. The version sold by ChessBase and its resellers sports a green box whereas the version sold through Viva Media comes in a black box. I noticed an appreciable price difference and I investigated that difference. The software appears to be the same; the real difference is in the access given to the chess server. The more expensive package offers a 1-year premium membership which gives access to all content on the server such as seminars, elite tournament coverage and other content. The less expensive package also offers a 1-year membership but the access is more limited and excludes much of the premium content. Both offer guest access which allows anyone to log in and play games without hindrance, but as a guest so there is no tracking of progress. Which kind of access you desire should be considered when choosing which package you need.Fritz 12 is a big step forward and is a worthwhile upgrade from previous versions. The engine is stronger and the interface is vastly superior. It is not without its glitches but the problems seem to be few in number.",
      "overall": "positive"
   },
   {
      "reviewerID": "A56X7MQIAQLLO",
      "reviewText": "I enjoy playing Chess with Fritz.  I got it to a draw on one occasion, and can tell you he (Fritz) is a sore loser!  He's also got a dead pan repertoire of comments for moves you make.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3IHVG0MXTQQRW",
      "reviewText": "I gave it an &#34;okay&#34; rating, only because it was a little difficult to figure out how to tone down the playing level.  I've played a little chess all my life, and considered myself to be so-so player.  This game (straight out of the box) handed my @$$ to me in no time flat.  I don't enjoy losing ALL the time.  There's only room to learn, and this program seems to be capable of teaching, so I'm looking forward to that.",
      "overall": "neuter"
   },
   {
      "reviewerID": "AKJS2K12SIBJW",
      "reviewText": "I have been a Deep Fritz user for many years.  I have others in the Deep Fritz 8 era but Deep Fritz is my favorite and I am well pleased with 12.  Fast shipping as well.",
      "overall": "positive"
   },
   {
      "reviewerID": "AYKE9QIBQKRTF",
      "reviewText": "this includes a 1 year membership to playchess.com, lots of tutorials, opening books and huge game database  and you can add a stronger engine like komodo or stockfish  or houdini for free. just google \"stockfish chess engine\"  and hit the download button and then load it up on the fritz gui and it runs smooth as silk.  stockfish even supports multi-core processing!  for 20$  a great deal.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1H5UQFBKE1ZFA",
      "reviewText": "I have been a long time Chessbase user all the way back to Fritz 5.32.  And until Deep Fritz 12 I have been very satisfied with their product.  However Chessbase has decided to release this new version of software without the \"2 Computer Match\" feature.  I used this feature a lot to play my other computers with earlier software against each other.  When I emailed Chessbase and inquired why they removed a great feature they replied that it was too much trouble for them to support.Just lazy German programming.I thought that software evolved to more features not less?  Isn't that what justifies buying upgrades every year?  Hmmmm...  Well Chessbase ceretainly isn't giving a break on the price.  Oh yeah thats another thing, why are they still selling a \"DEEP\" version?  All cpu's today have multi-cores and the programming for parrallel processing is already done.I guess Chessbase just wants your money and not give you any features.  I wonder what they will cut next?The Fritz 12 chess engine is only marginally stronger than Fritz 11.  Rybka 4.1 just mops the floor with Fritz 12 in Engine match, it so embarrassingly bad.  One recent engine match had Rybka winning 24 straight games and no draws.  This was with the same book for both engines.Do to the fact the Chessbase doesn't care to listen to their customers and continue to support features established for over a decade and it's poor showing against Deep Rybka 4.1 I would have to say that Deep Fritz 12 is just not worth buying.  Stick with Fritz 11 and buy from Chess Assistant or use Arena.  At least they value their customers input.",
      "overall": "negative"
   },
   {
      "reviewerID": "A21IT32KPAYMHO",
      "reviewText": "do not know how a real good chess player would do against Fritz, but I can't beat the high levels. Maybe someday .",
      "overall": "positive"
   },
   {
      "reviewerID": "AITD7ZQDTE3NM",
      "reviewText": "Their video tutorials are crappy, user interface not intuitive. In brief if you are looking for some product to learn chess then this is not the right product. I used few times and stopped using it and found windows default chess program is better. Wasted my money.",
      "overall": "negative"
   },
   {
      "reviewerID": "AG0OLNBVH9S80",
      "reviewText": "this game is so so ok---very complicated--without a manual, the game is almost useless and ready for the GARBAGE CANsorry to write this,,but not every one is a  EINSTEIN  or BILL GATES!!!!!!!!!!!!!!!!!!!!",
      "overall": "neuter"
   },
   {
      "reviewerID": "AUO73JW4FJFCN",
      "reviewText": "I am not going to write a book here because a lot of the others have done a good job in explaining the software. What i wanted to say is that this game teaches,is controlable, looks great, and is good for at anyones level. If you are going to buy a Chess Program this is the one to buy. You will learn alot for sure.",
      "overall": "positive"
   },
   {
      "reviewerID": "AJKPN1A71K1PA",
      "reviewText": "Required installation each time the disc was inserted.  This in turn required uninstalling the previous version, reinstalling, and retyping the keycode.  Another reviewer explained this frustrating procedure better than I can.  I gave up and got a refund.  btw, the game wasn't all that great.  Navigation awkward and confusing.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3HM7N3IU0VTIQ",
      "reviewText": "i know how to play allredy what i wanted was stradagy it was of no help the info is theyer but geting to it is a b#$&",
      "overall": "negative"
   },
   {
      "reviewerID": "A2YW4JR64U6143",
      "reviewText": "After I installed the program and played a game and closed the game window there was no way to play again. No icon on the desktop or any play function in the installed game in the computer. Re-installing did not work. Contacted the manufacturer and heard nothing back.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2CCUBQY2AGROD",
      "reviewText": "Fritz is the best there is, that is the short and the long of it. Chess is a mind sport,and so no software can force you to become a better player without you having the right mindset. Having said that, Fritz offers you all that modern software can for chess improvement. Miles ahead of Chessmaster in my opinion. I've owned chessmaster for a while and it is worth the money, if nothing else, with the Josh Waitzin tutorials. Chessmaster has great graphics, but everywhere else, Fritz wins out. Use a combination of Fritz and chessbase light (freeware downloadable online), and use playchess.com for human vs human play and its a win win situation. Great product!",
      "overall": "positive"
   },
   {
      "reviewerID": "A22WTD36WE9YF8",
      "reviewText": "I don't really play chess that much/often. This was a gift for my dad. I think He loves it more than the windows xp chess.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1MPFJPIOKHUD8",
      "reviewText": "This is the real Fritz 12 Single core interface.The boards look great and I love the wonderful remarks the program makes about my play.( I am sure I will turn them off at some point)You can add your own UCI engines and you have a first class chess interfaceHighly recommended",
      "overall": "positive"
   },
   {
      "reviewerID": "A1R3670RDW0Z3S",
      "reviewText": "Plenty of features and I wouldn't be without it. It was easy to install Rybka as my engine of choice. But ... I just wish Apple would buy the company and do its magic on the whole package. For example you just can't double click on \"game.pgn\" on your desktop and expect it to open in Fritz. Instead you get the last game you looked at.",
      "overall": "positive"
   },
   {
      "reviewerID": "A25OPU6DF228PA",
      "reviewText": "I bought Fritz 12 to use with Windows 8, and I could not get it to work, even after I contacted Viva-Media. Note: Viva-Media does not claim on their web site that it will work with Windows 8 or even Windows 7. They only claim it will work with some XP and Vista operating systems. See their website to find out which ones.  Fritz 10 seems to work fine however.",
      "overall": "negative"
   },
   {
      "reviewerID": "A9CAR3DVY0M44",
      "reviewText": "Fritz 12 is an excellent chess program. I'm an intermediate level player (chess club strength) and I find Fritz to be an great companion for analysis, casual play, and finding out about recent activities through the \"Playchess.com\" subscription.The installation process was very smooth and it worked right off the bat. However, the update didn't work at first (update 12). It wasn't until following updates (version 17, I think) that it was able to finally work as it should have. Sometimes the audio features get messed up (the clock continues ticking even when you are not playing, no sound comes when you move a piece, the funny comments don't work, etc.). However, these minor bugs don't affect the important stuff, i.e., the chess playing and analysis.Playchess is a great place to go find out about news, playing with other people, and fiddling around with the tactical exercises.In short, an excellent purchase for the price. I would recommend it 100%!",
      "overall": "positive"
   },
   {
      "reviewerID": "A3MEI0AY88B3VM",
      "reviewText": "I got ripped off. I can't install this program on my computer. I keep getting \"invalidSecurity code\". I did not receive a booklet or other instructions. And the packaging looked \"weird\". I've seen knock-off DVDs and that is kind of what it looks like. VERY PISSED OFF!!! The only reason I gave one star is because I had to give it a rating. The product really deserves -10 stars.",
      "overall": "negative"
   },
   {
      "reviewerID": "AU1G7GPS8N5LV",
      "reviewText": "I went back to my old Chessmaster program.  Fritz is not the easiest to use, and not as flexible as Chessmaster, but it has a stronger chess engine.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2KWYDBE34CTKQ",
      "reviewText": "This DVD is organized with longer introductions to types of pawn structures or general variations (Carlsbad structure, Capablanca structure, etc.) and short discussions of actual games.  Kasparov's take on chess history is fascinating, but his method of presentation is better for strong players than weaker players.  This is definitely NOT the DVD to buy a child who is just learning the game.  To pull a number out of my head, I'd say you should only buy this if you're rated 1800 USCF or higher, and here's why.I learn the most, and I think most people learn the most, from methodical discussion of important games, then trying to apply that into my own games, then trying to figure out where I went wrong.  Kasparov only spends about 4 minutes per game (!!??!!).  He's assuming the viewer already knows how to execute plans in the middle game that arise from the opening.I got this DVD on sale, so it was definitely worth the money, and it includes an annotated game collection, so I'm sure I'll be referring back to it for years.  But I had to purchase a different Queen's Gambit DVD, just so I would have the background necessary to understand this one.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A17SPEC8D1SX85",
      "reviewText": "This is truly a rare treat.  Garry Kasparov, quite likely the best openings expert in the history of chess, and World Champion for about 15 years, has here given a very valuable overview of one of the most fundamentally important openings in chess, the Queens' Gambit Declined.  The DVD is in the form of a games collection, with all of the major variations covered.  Kasparov's presentation is fascinating.  He gives a blend of historical background and fundamental instruction.  His accent is rather strong, but he is quite eloquent, charismatic and in general easy to understand.  You will not get every theoretical variation that you would need to play the Queen's Gambit at a high level with such a general overview, of course, but this DVD is so compelling and well done that any chess player from casual club player up to master (and probably beyond) will benefit from the presentation.  Don't miss the chance to get instruction from the player that many consider the strongest player of all time.  Even if you don't play the Queen's Gambit you will profit from Kasparov's explanations, and you will enjoy yourself as you learn!  Very highly recommended.",
      "overall": "positive"
   },
   {
      "reviewerID": "A15BDAT4GB0LPD",
      "reviewText": "well THE BIGGEST problem, game is not released to us or Canada, so i had to order it from UK. The game-play and graphics are second to none, i have never seen a game quite like The Ashes, graphics are similar to NBA 2K10, with players facial expressions and swatting. you pretty much can play all the shots like in a real game mid-on, off etc....the bowling is also realistic with drift, dusras spin. The one feature, i enjoy the most is the ability to change how old the pitch is, i.e one game old two games old etc. It supports trophies so you will have new trophy every time you complete a challenge in a game.The game is good but needs a patch released for fielding glitches, its very difficult to catch a ball, believe me i have played over 50hrs of it. on my good day i am able to complete only 80% of all catches. its not fully licensed by all cricket boards, so they have purposely misspelled the names of all the counties players except Australia and England. I would expect product like it, to be fully licensed. sometimes its hard to hit the ball but i have realized once you have passed the learning curve it almost becomes second nature.overall, the game is 9/10. i personally feel its a step in the right direction as far as cricket games are concerned for xbox, and ps3. yes even though this game is PAL, format it play with ps3 in united states, you have to make sure you are using HDMI cables and HDTV",
      "overall": "positive"
   },
   {
      "reviewerID": "A1OZ5EU2U9Y2KD",
      "reviewText": "Ashes 2009 could have been better , if not for noticeable glitches in game play . While faulty umpiring occasionally  makes it more  realistic , it is overdone.Another thing is the fielding. The fielding is simply horrific.The appealing,too is overdoneOtherwise, the game was good. The Hawk-Eye technology is good for the game .There is a Legends Coaching .What made me buy this game, however, was the online game play. Although it is sometimes hard to find an opponent , it will all pay off in the end. But beware! Your opponent can quit the match at any time. Yet another downside!Another thing in the game is' The Pavillion' In there , you can see all the trophies and stadia you have unlocked. You can also check out the world records.In the game itself, you can pick one of 12 teams. You can then play a 20 over , 50 over or the longest form, the grueling test match . There are three difficulties.Another 'up' is the customization. You can change the player's name, his appearance,his kit or you can edit his skills. Of course, you cannot edit the Aussies or English.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A1SF615ZY2QZQD",
      "reviewText": "Cricket games have never captured the public imagination like, say, football games, mainly because a more complex sport is bound to breed a less-easily-grasped video game.But Codemasters' Brian Lara-branded games of yore consistently outshone their rivals, and finally, the Britsoft publisher has acquired the plum cricketing licence: the Ashes. It's a big shame that Ashes Cricket 2009 didn't make it to the crease in time for the first Test in Cardiff, but at least it's a classy and thoroughly playable effort.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2DOFZ0HZOOGPY",
      "reviewText": "Love the game, cant stop playing. grt graphic. such games are hard to find these days. would recommend this game. But dont miss ur prayers for games.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1VZFTEZJ88O7N",
      "reviewText": "They called it the ball of the century. Wrist snapping as the ball tore from the young leg-spinner's hand, it swerved improbably through the air. Twisting away to Mike Gatting's leg-side, the bemused England veteran instinctively thrust out his left lag and jabbed the bat against it to create what should have been an impervious shield between man and wicket. But as the ball pitched up from the rough it spun back implausibly, miraculously, wide of man, bat and pad,thundering into off stump. Pandemonium.It was the first Test of the 1993 Ashes series at Old Trafford. And the first ball bowled against England by a cocky 23 year-old with look-at-me hair and pie-in-me paunch. Shane Warne had arrived.Fast forward 12 years. They called it the greatest ever series. Warne, by then the finest spinner the world had ever known, had privately decided this would be his Test swansong: to reclaim the famous Urn on English soil, conjuring victory through an almost superhuman force of will and talent, capping off a glittering career of personal achievement and ruthless international dominance.But on the final day of the final Test at the Oval, one man above all others refused to play to the script. And having been clumsily dropped, with savage irony, by Warne himself at slip on 15, Kevin Pietersen produced one of the great innings, a knock of breathtaking audacity, defiance, skill and aggression against unbelievable pressure, to drive England on to an unforgettable victory.For cricket lovers, there's nothing like a Test match. And on the international stage, there's nothing quite like the Ashes. Making a cricket game is one thing; creating one that captures the unique emotions of this rivalry is quite another. That's the starting point for Ashes Cricket 2009, the latest cricket game from Codemasters, whose last effort in 2007 featured Brian Lara's mug on the box.But last time we checked, Lara wasn't a bowler hat-wearing lager lout or a kangaroo-riding Neighbours extra, so his services have been dispensed with, Codies has snapped up the official nPower Ashes licence, and Pietersen and Warne have been called to the promotional crease.",
      "overall": "positive"
   },
   {
      "reviewerID": "AZJ1ACKWFAP8Q",
      "reviewText": "In terms of game modes there's everything here most cricket fans will want. The Ashes themselves are the main draw, backed up by the proper licence (although we're not sure if player likenesses were part of that deal, as most only vaguely match their real life counterparts). Outside of this test series mode you've got One Day and 20 over matches, although neither is a licensed tournament, so there's no properly named Twenty20. There are numerous challenges to complete too, set by legends Sir Ian Botham and Shane Warne.Although the batting and bowling is solid enough, the on-field presentation is lacking slightly. Player models and stadiums are decent, but the animations are clunky and don't blend into one another well at all. There's also a strange delay when a wicket is taken, meaning you'll know you're out but the fielders won't react. Then a second later they'll all leap into the air to celebrate. For a fairly average looking game the frame rate isn't too hot either, frequently appearing a fraction too slow. Commentary is decent and the voice work by Beefy and Warne is solid, if a little sterile, but on the whole it's not a game to show off to your mates.Ashes Cricket 2009 is a solid recreation of the sport and this summer's big sporting event, but it's lacking spark and feels a little slight in terms of depth. Play with a friend as opposed to the AI and you'll likely be able to have fun up to and beyond the end of the Ashes series, but as a next-gen sports sim it doesn't feel as though Codemasters has done enough to push the series forward.",
      "overall": "positive"
   },
   {
      "reviewerID": "AFVXE1EF2GMWS",
      "reviewText": "Usually play this to calm my nerves after an engaging chapter of any FPS....this is very relaxing and fun. Though option of spontaneous commentary would make this game even more mind blowing.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3SYI5N2C0M5PQ",
      "reviewText": "Got this to go with a Christmas present for my daughter, it works with Disney Sing-It (Family) and Storybook Workshop.  Noticed a little bit of a delay on my parents' LCD tv, but there was a note in the game saying that was sometimes an issue with LCD tvs.  The long cord means my daughter (4) can move around while she sings/talks.  Not the best as far as vocals goes, but it works for what we needed! :)",
      "overall": "positive"
   },
   {
      "reviewerID": "A1VR3WIYC6GKT5",
      "reviewText": "The microphone works well and was a great replacement for my original Rock Band microphone.  My original broke and have been looking all over for a replacement.  This item was a decent priced replacement so we could continue to play.",
      "overall": "positive"
   },
   {
      "reviewerID": "A9BUOIC9O2U4S",
      "reviewText": "This mic is excellent! We thought it didn't work on our Wii, but we tried it on the computer and it was working. So we plugged it directly into the Wii before powering up and made sure the Wii mote was powered up and it worked perfectly. I'm glad we tried a few things before returning it!",
      "overall": "positive"
   },
   {
      "reviewerID": "A5P9GUOMVJNCR",
      "reviewText": "You need a microphone to play Lego Rock Band so we recommend this one!  We also ordered the mic stand so we can play and sing at the same time!",
      "overall": "positive"
   },
   {
      "reviewerID": "A3IXJC1IVW4NWC",
      "reviewText": "i have had no problems with this product at all. it works like i wanted it to. its great. i use it all the time. thank you a lot! its also great becuase the usb cord allows me to use it with all my games that need a mic. the wireless one do not. so thank you again for this wonderful mic.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1KLPDG7MCY9FX",
      "reviewText": "I purchased this mic to use with my Xbox version of Bandfuse and it works perfectly.  Construction is solid and the mic was well packed and timely shipped.  No complaints!",
      "overall": "positive"
   },
   {
      "reviewerID": "A31INJZQMKJUNY",
      "reviewText": "Although the first microphone did not work, Quick Buy's was contacted through Amazon and they quickly sent a replacement which works great.  I would buy again from this supplier.  Great customer service!!",
      "overall": "positive"
   },
   {
      "reviewerID": "A46KHC3VP04N7",
      "reviewText": "I hate being lied to, the pictures for this product are nothing like the actual product i received.  The microphones i received do not work with my xbox 360 either.  Stay away from this product and the retailer Bluemall altogether.  In order to return them you have to email a rep for a rma # and i did not receive my number within their 15 day from shipping return period.  Bad business here peeps, surprised amazon would carry such trash.  Hope this helps :)",
      "overall": "negative"
   },
   {
      "reviewerID": "A1YV04QBOY2TNF",
      "reviewText": "I bought this microphone to use primarily for Rock Band 3, as it is the only game in the Rock Band and Guitar Hero series that will not allow you to use a headset.  After receiving the microphone in question, I plugged it into my USB port, only to find that it didn't work.  &#34;Odd,&#34; I thought and tried a different USB port.  This one worked, and I began playing.Now, to give a bit of backstory.  I have two televisions in my room:  an HDTV and a normal &#34;box&#34; television.  After getting fed up with attempting to calibrate the system correctly, I now move back and forth between the two televisions whenever I wish to play a musical rhythm game.  Obviously, for vocals, an HDTV can be used uncalibrated, as, if you know the song, you do not need to watch the notes go by, so I had had the Xbox plugged into this.  Later, when I decided to switch TVs to play my guitar, I eventually replugged in the microphone in the same USB port that I had plugged it in previously.  It didn't work.  Now frustrated, I retried every port, only to finally find one that worked, which happened to be the very first port I'd tried previously.  I later came to find that the microphone I received had a short in the wire, almost as if it were used (which is entirely possible, as I got no packaging, only a plastic wrapper around the microphone).  As for the performance itself when I actually get the thing to work, it works nicely.  It picks up on my voice fairly well, although you have to keep it at a very precise angle, or it may lose lower volumes.  There is enough cord length that I can sing at my preferred distance (although I sit very close to my televisions, so take this statement with a grain of salt).  It's not a bad mic, and I'm sure the short was just a defect on the part of my microphone.  Not bad, overall.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3DCDUHZTKDZCV",
      "reviewText": "Works great now me n my daughter can sing together it arrived way b4 date was suppose too very happy with purchase",
      "overall": "positive"
   },
   {
      "reviewerID": "A19KILJY6JGPWK",
      "reviewText": "No stress collar for the wire coming out of the mike.  Audio pickup is questionable at times.  Wish I had spent more.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2KSEAK4R5KNRW",
      "reviewText": "I ordered this to use with my Wii and was nervous because some many reviews said it wouldn't work with my systems. I plugged it in and it it worked!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2Y5PRMVHMVVRZ",
      "reviewText": "The voice is delayed, and it doesn't have the volume control on the microphone. I have to use the computer to adjust the volume, not very convenient.",
      "overall": "negative"
   },
   {
      "reviewerID": "A23GS4UGLQBG2V",
      "reviewText": "We plugged this microphone into the Wii and it just worked. We find USB easier to deal with on the Wii than using the microphone jack.With all the noise of the games such as Rock Star, I can't really tell how good the audio quality is, but that also means that it is good enough for Wii.It seems like it is well made, but we have only used it 10 - 20 times, so I don't know how it will hold up over time. The previous two microphones (different manufacturer) didn't last long before we had to start holding the cable in certain positions to make them work.This microphone does what it is supposed to. Nothing lacking.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1MXJIJ1Q9CUCD",
      "reviewText": "As much as they'd like to think it without doing their research, I was sent a Guitar Hero mic that is blatantly NOT compatible with Rock Band 3.  It'd be simpler to spend a few extra dollars to get an official mic than roll the dice with these guys in the hopes that they maybe send the correct model you are looking for.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1VK0NXSULHYXE",
      "reviewText": "This mic has a delayed voice which is driving me crazy! Also, it doesn't have a volume control so it doesn't get loud at all even if I turn up the surround sound. In addition, the mic that I got in the mail is not the mic that is pictured. This mic is supposed to be comparable with sing a long games. However, when I hooked this mic up to my play station 3 game unit and placed my Michael Jackson's (Experience)game in the mic failed at being a half decent mic. I mean I had to unhook it because the delayed voice was just too much to try to deal with. If I wasn't so lazy I would repack this piece of crap and send it back!",
      "overall": "negative"
   },
   {
      "reviewerID": "A20FCDYJBFBHW0",
      "reviewText": "THANK YOU FOR A WONDERFUL EXPERIENCE THANK YOU AND SEE YA AGAIN! YOU ROCK! A+ ALL THE WAY. A+ A",
      "overall": "positive"
   },
   {
      "reviewerID": "A3QOND6HIRCG5W",
      "reviewText": "Not compatible with Wii disappointed as it was advertised that it was.  Looks like a good quality mic but cannot use it...",
      "overall": "negative"
   },
   {
      "reviewerID": "A1MQBK6EBWQ0S0",
      "reviewText": "We use this when we want to vocals on Beatles Rock Band and it's great!!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2NAEPXU8LG5UL",
      "reviewText": "This microphone would be perfect if it was wireless and had buttons so I didn't have to use the PS3 controller.",
      "overall": "positive"
   },
   {
      "reviewerID": "AJ7E4CTV4IJ8Q",
      "reviewText": "Been using this for about a year off and on.  It doesn't get the workout that our guitar and keyboard do, but it's still hanging in there with me, a 7 year old and an 11 year old putting it through its paces.  Still works really well on our Wii.  Surprisingly so, as a matter of fact.  The only thing that is odd is that the microphone had a label on the side that said something or other about a \"Disney\" game.  I forget which one.  It doesn't actually say, \"Rock Band\" on it, but we don't care.  It still works just fine.",
      "overall": "positive"
   },
   {
      "reviewerID": "AL1P28RRVRYZT",
      "reviewText": "Pretty cool works well but don't get to use it  that much but glad I got it really worth it",
      "overall": "positive"
   },
   {
      "reviewerID": "A2ANRQGO477EYG",
      "reviewText": "The microphone I received was used and said Disney on it. It was not compatible with any Rock Band game.",
      "overall": "negative"
   },
   {
      "reviewerID": "A15Q5MSPQUQPEB",
      "reviewText": "they could be a little bit more faster on the delivery but at the end it was good to make bussines with them they are 100% responsable and good quality products if i need something again i wont think it twice on buying from them.",
      "overall": "positive"
   },
   {
      "reviewerID": "A9LHUZ7SNCM49",
      "reviewText": "I bought this mic for the ps3 and i cant complain it worked just like any other mic, but wat i really was surprised by was the quality of the mic when i plugged it in the computer. This mic is good for both a rockband and amateur recording on mac/pc",
      "overall": "positive"
   },
   {
      "reviewerID": "A210LNSZILVP4L",
      "reviewText": "Good mic nothing to spectacular and nothing bad about the mic. Needed this for rockband and is compatible for band hero also.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A2H5J233R00FOV",
      "reviewText": "I got this microphone after my microphone that came with Rock Band fell apart (the wire became loose at the microphone). I like it better than the original. It is a little more sensitive so you don't have to have it right next to your mouth and easier to handle as it is shorter. I am really surprised that it cost so little and works so well.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3IW0J3I6OED3",
      "reviewText": "Probably a fine microphone - but it DOES NOT WORK WITH Wii LEGO ROCK BAND.  It may work with other Rock Band products though.If you need a Microphone for Lego Rock Band, it has to be a Logitech microphone.",
      "overall": "negative"
   },
   {
      "reviewerID": "AY8IYSNK4GF7",
      "reviewText": "This product does not work with the PS3 as advertised. I have not got around to returning it yet. Just don't want anyone else to get rope a doped like I did. I found out the hard way. The ps3 does not read it and their is no way to sync the mic to the ps3 as with the guitar and drums. Do not buy if you have a ps3. Hope this helps.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1OGX00C2ZKHO",
      "reviewText": "This product was advertised as new, I expected it to come in a box since this was a gift, it came wrapped with stuffing in an envelope.  I hope the product works.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1KI9W9SD5163O",
      "reviewText": "Not much to say here, it's a good USB microphone, clear sound pickup, and it easily handles the 'smack against palm for cowbell' action without a complaint.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A2V7RMNAMKRZOC",
      "reviewText": "Used it for one day and then it stopped working.  I was very careful when having to \"tamborine\" and hit it as soft as possible.  Still after one day the arrow stopped showing up in Rock Band 2.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1RFIXJVX5FODR",
      "reviewText": "Good Mic at a reasonable price. So far, So Good! Will see how long it lasts in the hands of 3 and 8 year olds!",
      "overall": "positive"
   },
   {
      "reviewerID": "AL6K1E2MRPVYT",
      "reviewText": "Microphone works fine, although sound quality isn't great.  This was advertised as an official Rock Band microphone.  When it arrived it was an official Guitar Hero microphone.  Is it really that difficult to represent the item correctly?",
      "overall": "positive"
   },
   {
      "reviewerID": "A37M0B3NHDHN9V",
      "reviewText": "Works good, however is not \"like a new\" with a little not important defect in appearance!Really good, and works fantastic!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2BFG0RX306O15",
      "reviewText": "I bought this mic hoping it was as good (if not better) then the Official Rock Band 2 Mic. I found it to be better! It keeps my voice in tune very well and is very sensitive to sound. The transaction with the seller was smooth and fast! Excellent Buy!",
      "overall": "positive"
   },
   {
      "reviewerID": "A3VSJ7W8BSF3HD",
      "reviewText": "Works well but the cord can be a hassle.  The cord is very long so length is not a problem in use, but can be a hassle for storage.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1DG90YENCT13Z",
      "reviewText": "The microphones that I ordered look just like the ones that came with the Rock Band 2 game.  I bought 2 extra microphones because I bought the Beatles Rock Band game and to do the 2 part harmony you need 3 microphones. What I am a little annoyed with is the fact that you need an adapter to plug in the 3rd microphone which I don't have and now have to go buy. Otherwise they work just fine. We are happy with it so far...",
      "overall": "positive"
   },
   {
      "reviewerID": "A3H2SDAUK0S0BX",
      "reviewText": "happy with the mic but,the delivering was very late two weeks late unhappy with shipping.",
      "overall": "positive"
   },
   {
      "reviewerID": "A21AC7Y3QEDGAB",
      "reviewText": "i had read a review here to make sure it works for rock band 3 + ps3 before going ahead with the purchase.  tried this mic today and it didn't work...  the system simply did not recognize the mic and keeps telling me to connect a mic.also tried plugging this in all the different usb ports, with or without the guitar wireless extension.  no combination worked.maybe i got a defective device, maybe not.  disappointed and asked for a refund.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1C5NHDBQR2NI6",
      "reviewText": "But for a microphone cord could be a little bit longer but for the price its just right. Thank you.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2QQ9KSQ44QZSE",
      "reviewText": "I bought this microphone to further enhance my Rock Band experience.  I was not disappointed.  It kept in tune well (which was a problem I saw with other microphones) and was light enough to not be a burden of any kind.  I don't mind that it is not wireless, since I wouldn't move around much anyways.  Also, the fact that it doesn't have buttons didn't bother me, mainly because I don't mind using a controller to navigate.  I do think it could have been packaged better, but I don't fault the microphone for it.  Overall, a very simplistic, yet functional, design that works well.",
      "overall": "positive"
   },
   {
      "reviewerID": "A87XJUWN96VPR",
      "reviewText": "The microphone works on our Wii. We are using it for Just Dance 2014, which includes a Karaoke feature. It was a simple plug in and play. The mic won't work unless an actual song is playing. The sound is also very low, so you will have to turn your TV's volume quite high. Otherwise, it's an OK device. No frills, but still fun for the family.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A3F1JS1Y9I4JDP",
      "reviewText": "I bought two of these so that we could sing the harmonies for Beatles Rock Band for the Wii. They work wonderfully. In order to use 3 mics, 2 guitars, and a drum kit, you'll need to purchase a USB hub.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3ANHQRY48GJM8",
      "reviewText": "So far so good.  We have had it for over 2 years and it still works.  Of course, we don't play every weekend either but it's nice to know that when we want to it is there waiting for us.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A3G6MRTQ7Y2DN9",
      "reviewText": "a microphone is a microphone- I am not sure the sound quality on the Wii would vary from one to another.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A3SAQCF1HACWJ1",
      "reviewText": "No problems to be had with the mic, it's relatively cheap and works perfectly well with Rock Band (all that I have used it for).",
      "overall": "positive"
   },
   {
      "reviewerID": "A3UP8N5GR9Z96Y",
      "reviewText": "I really should have made a video ... We sang Beatle Songs for five hours and we had three microphones...and it was a blast.  Works well!!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2XEHSWM8ECS6M",
      "reviewText": "sing out loud, sing along!This mic worked perfectly, and now my nieces and nephew are rocking out on Rock Band.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2WHQTKHJ85KNC",
      "reviewText": "Bought this as a second mic for our Rock Band 3 game and we love it. We constantly fight over who is going to use it so I think we may need to purchase a second one.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1EYSCSTZ0ZOM1",
      "reviewText": "Arrived promptly with no problems. I have been using this microphone for my rock band game. It works except for cutting out occasionally.  It could be made a little more stable inside. Still a little loose.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2TIPCHRT858SE",
      "reviewText": "Works great now me and my family cab have fun singing songs! We now have the whole set and my kids love it!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2PJOSU5ND84S1",
      "reviewText": "I love it! Use it all the time. Really works perfectly with all games that you need a mic for.",
      "overall": "positive"
   },
   {
      "reviewerID": "A32NGXPUL2TA9U",
      "reviewText": "Works great. Indistinguishable from the one in the original Wii Rock Band 2 bundle and helpful if you get the Beatles game.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1VU5XSPRV24H",
      "reviewText": "Would have given this 5 stars but was not happy with the way it was packaged. Only a plastic bag covered it, no box, bubble wrap or other type of protective covering. Luckily I ordered with a book and Amazon sent with paper to keep it from moving around.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3TG9S7EZ8CXA1",
      "reviewText": "First of all, the product is not what is pictured. I'm a girl, but imagine if i was a guy how humiliated i would be to recieve a High School Musical usb microphone? It doesn't matter to me, but if you care what the mic looks like, it might to you. The quality is good and the durability is good. It works perfectly with my ps3 and rockband 3 game. I've had no issues with it so far, but i would've liked to know what it actually looked like.SUMMARYPros:Good quality soundDurableWorks with ps3/rockband 3Cons:Not what is pictured (High School Musical usb Mic is what i was mailed )",
      "overall": "positive"
   },
   {
      "reviewerID": "A2VDIU6H955TJK",
      "reviewText": "I bought this mic to use with the Xbox karaoke app because the wireless mics have a delay making it hard to sing with the song.  This mic still has a delay, but it's much more manageable.  It does have a nice long cord for the kids to move around and will work for the time being until something better comes along. I've read that USB mics tend to have a delay issue so i'm not sure what the main issue is.",
      "overall": "positive"
   },
   {
      "reviewerID": "AUIKRQAJBQHY4",
      "reviewText": "I bought this for my 13 yr old son.He loves it. Item arrived promptlyand in perfect condition.Thanks!",
      "overall": "positive"
   },
   {
      "reviewerID": "A1CF26Y5TPVK5N",
      "reviewText": "now I can rock for real and as hard as I want, even though my voice is not like steven tyler, but I try and try!! hahahaha",
      "overall": "positive"
   },
   {
      "reviewerID": "A1ZSWJIFOUK3YK",
      "reviewText": "This was one of my first purchases for the PS3 and Rock Band 2. Is very ease to use just plug into a usb port and Play!The package arrive within the estimated date and I would buy from this seller again.",
      "overall": "positive"
   },
   {
      "reviewerID": "AYJXOFPC3XKEW",
      "reviewText": "Great product. Brand new! Ships fast, and EXCELLENT customer service. They will sort out any issue that arises. They have been really helpful, and the product is flawless. Use it all the time.",
      "overall": "positive"
   },
   {
      "reviewerID": "AL9GKE9R1OETE",
      "reviewText": "my granddaughter bought it & SHE USES IT EVERYDAY. She loves the item and it was as described. Really great.",
      "overall": "positive"
   },
   {
      "reviewerID": "ACQOSHNOQ3EE7",
      "reviewText": "Grandson and his friends received two for the holidays and use them frequently.  Lots of fun.  Mics work just fine.",
      "overall": "positive"
   },
   {
      "reviewerID": "A91BVZEDZYEWW",
      "reviewText": "Works great!Another cool thing, even if a song doesn't have \"harmony\" (parts for more than one singer) you can still do fake-harmony as all mics plugged in remain active.  However, the back-up singers will not be rated and will actually mess with the lead as the game doesn't differentiate what mic is being used for lead UNLESS there actually is a harmony part.  Meaning = if you're just singing to party, you can use all three mics on any song and they'll all just be treated as lead.  Pretty cool when you have a room full of mic hogs around the house like we do.  lol  It's just like when people would gang up all on one mic during a song, but now they actually feel like rock stars having their own mics.  For this reason, we just always keep all three mics plugged in and anyone can just pick one up and join in.  Just don't expect a good score ;-)",
      "overall": "positive"
   },
   {
      "reviewerID": "AQTALRXJYC84Y",
      "reviewText": "My microphone stopped working in the middle of playing Rock Band with friends and I was able to replace the microphone with this version for cheap. Product works great with my wii and was shipped fast.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2I7JVHYUZSVRX",
      "reviewText": "Very lightweight. Feels more like a toy but what did I expect for such a price. However it does the  job. A little lag in sound. Doesnt really amplify the sound but it works.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A2M1HPON34GR01",
      "reviewText": "Well, buy this microphone because we have a party soon and need one. Truth I wanted a wireless microphone but I didn't found it but this is very good, has a very long wire and it sounds super good, I recommend it for those that make family holidays!!!",
      "overall": "positive"
   },
   {
      "reviewerID": "A1PH1BOQGD7SCA",
      "reviewText": "my grandkids (and their parents) love playing with the microphone along with the guitar we got.this really is a lot of fun for everyone.  would totally recommend getting this if someone has an interest in music (singing)...",
      "overall": "positive"
   },
   {
      "reviewerID": "A1ZVPEC9L7ASJI",
      "reviewText": "I cannot get this thing to work with my Wii Rockband 3.It might be related to the USB hub that I'm using, but it simply refuses to be detected by the game.Cosmetically, it's a microphone. Bit on the ugly side.I would be wary of compatibility issues with this one.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2PC4YONCMT40X",
      "reviewText": "Works great on  my WII system.  Have a lot of fun with friends doing Karoake!  Buy one and see for yourself",
      "overall": "positive"
   },
   {
      "reviewerID": "A1AM8DSLVMIKQ6",
      "reviewText": "Great buy, Works Perfectly with both rock band and guitar hero, cord is long enough to sing anywhere in the room with out inconvenience.  I was so glad to have found this after buying a rock band set brand new from the store and the mic did not work.",
      "overall": "positive"
   },
   {
      "reviewerID": "AIB5JFWYC50NI",
      "reviewText": "My original Rock Band mic got fried by a static discharge so i had to get a new one.  This guy fit the bill and I always had good luck with logitech products so i gave it a shot.  It does not feel as substantial as the original, but i dare say that the sound quality is a bit better than the original.  Anyway it works just fine and it was inexpensive.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1ZSVWFADITBIG",
      "reviewText": "Excellent product. For those of you stil trying to use a headset as a microphone in GH/RB stop now and order this product. I used to fail out ALL the time on easy difficulty using a headset and now i get 5 stars very easily. Solid quality, good price, fast shipping.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2RHRMYGOOCIND",
      "reviewText": "I was initially worried that this microphone would not be compatible with our Wii Beatles' Rock Band game, but it works great with our system and the kids love it!Now we can have three vocalists, along with the guitar players and drummer. It makes for much more fun when more people can join in the performance. I recommend this microphone with the highest confidence that your family will love it too!",
      "overall": "positive"
   },
   {
      "reviewerID": "A39R6ASTG72JWP",
      "reviewText": "This was a birthday present the rock band microphones worked really well with Beatles and guitar hero. We totally rocked out and it was really fun learning how to get better with every song. Shipping was reqular ground freight and it was fast only 3 days!!!!Highly recommend! Happy Happy Joy Joy!",
      "overall": "positive"
   },
   {
      "reviewerID": "A13S6S2L8WUBCX",
      "reviewText": "I gotten this for my little girl who loves it. She sings all the time. I would recommend. Works great.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3EJCOET85EIQ3",
      "reviewText": "I got this microphone for an extra singer on Beatles Rock Band wii. It works just as good as the original and it's fairly cheap. It arrived quickly and it definitely enhances my Beatle Rock Band experience. Thank you!",
      "overall": "positive"
   },
   {
      "reviewerID": "AR6FVDJP0YFIL",
      "reviewText": "This product did exactly what it should do. Definitely recommended to everyone who needs a USB microphone for RockBand or Guitar Hero. :)",
      "overall": "positive"
   },
   {
      "reviewerID": "AGB3Q209DPF48",
      "reviewText": "Why the false advertising? I thought I was buying a Logitec mic for my Rock Band 3 game (Xbox 360) but what I got was a first generation Guitar Hero mic. Not at all like what was advertised in the picture. But then again, they work, so I can't complain too loudly.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1BAXPTOSKKYM1",
      "reviewText": "The mic is not \"Rockband\" brand. It is a cheap imitation Konami brand that is really lightweight and isn't quite the same quality sound as the Rockband brand.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A20CUB4T27CJU",
      "reviewText": "I bought this for Guitar Hero on the Wii. It won't work for Guitar Hero or Rock Band as the system doesn't recognize it. It does however work for \"Disney Sing It\". Strange, since the Microphone has \"Guitar Hero\" labeled right on it. I would've thought the company would at least check for compatibility before making claims or labels.",
      "overall": "negative"
   },
   {
      "reviewerID": "AR0UOFL6V48QZ",
      "reviewText": "game said I needed this and couldn't use the Konami wireless mic so I bought it but the lag is soooooo bad you cant even play the game :(",
      "overall": "negative"
   },
   {
      "reviewerID": "ANMZOIWDPOVZQ",
      "reviewText": "I've used this for both Rock Band 2 and Band Hero.  My wife loves karaoke and singing, in general, so she naturally loved the idea of singing in games like this while I played guitar.  However, prior to purchasing this microphone, all I had for her to use was my headset plugged into the controller.  It worked, but it was very clumsy, especially in Rock Band 2 for the parts of the song where you're supposed to tap on the microphone in rythym with the beat.So I purchased this as a Christmas present for her and she absolutely loves it.  It took us a few minutes to realize that a controller still needed to be plugged in for her so that she can join in, but after that, it's been smooth sailing/singing.  What's really nice is that the cord is long enough for her to stand back a good distance from the tv.",
      "overall": "positive"
   },
   {
      "reviewerID": "A9U737YAK0K1C",
      "reviewText": "This microphone is better than the original that came with the Disney:Sing it game.  The audio quality may be the same, but the build is noticeably better.  Heavier feel and better cord connection into the microphone.  A definite must if you have more than one kid or if your kid's like to have friends over.",
      "overall": "positive"
   },
   {
      "reviewerID": "A36MDM8ZMFCHVV",
      "reviewText": "This product was awful, we bought it for Rockband on PS3 and it did not work at all. We plugged it into both USB slots and it did not pick up sound at all from either of them. This microphone is completely non functional for at least the PS3 versions of Rockband, including Rockband, Rockband 2, Rockband: The Beatles, Rockband: Metal Track Pack, Rockband: Track Pack 2, and Rockband: Greenday. I will never buy from this seller again. It was a waste of money.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2GSOBCGSM52OM",
      "reviewText": "It works with the system but you need to sing really really loud in order to be heard through the system. It does work though and will register for the game..",
      "overall": "neuter"
   },
   {
      "reviewerID": "AIUSO48W0S8HB",
      "reviewText": "We bought this item for our Wii. It does not work at all for it. :-( So that was a disapointment. We did decide to keep it though because it works wonderfully on our x-box 360.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1RNDA9LGPO1BW",
      "reviewText": "The children love them! They played with them for hours.  We only tried two of them, but I'm guessing it will work just as well.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1SIWLUPTP3LGZ",
      "reviewText": "this is not the brand showen in the picture.......... but it still works  so i guess that ok works on the computer too. this  is not new it is used the cord is rapped with a rubber band and the product itself in a plastic bag .",
      "overall": "positive"
   },
   {
      "reviewerID": "A26WT0V8IKUA5H",
      "reviewText": "I bought 4 of these Mic's for use playing Rock Band 3. So far, so good? While this Mic is not the best USB Mic for sound quality, I believe it to be able to handle the abuse better than the higher performing Mic's like the Logitech's. This is important in Rock Band, since the Mic doubles as a Cow Bell/Tambourine/Hand Clap in game play. In time all Mic's will fail with this kind of abuse, knowing this, I searched the web for the cheapest Mic's made for Rock Band or Guitar Hero & Amazon Delivered!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2V54GHPYD3VI2",
      "reviewText": "The one that I got (the Disney one) didn't work on with any of my electronics. All of them recognized a device though. When it was plugged in there'd be a device listed either on the PC, Mac or PS3 \"Logitech USB Microphone.\" However, none of my devices picked up any sound. After extensive fiddling with settings on all my computers I decided to return it. I think newer OSes as of December 2011, (although my PC has Vista) like Lion and the newer version of the PS3 are incompatible with this microphone... that or it is defective. I also did indeed look for an on/off switch to see if that was the problem but there is no switch.So... if you are looking for an RB3 / Rock Band 3 alternative microphone for you PlayStation 3, don't buy this microphone. Even though they're hard to find, go to Gamestop to get them (only some of them carry them and the nearest ones to me are in Compton, lol).",
      "overall": "negative"
   },
   {
      "reviewerID": "A31GYRH907RH25",
      "reviewText": "Very disappointed. I bought this to go with the Rock Band set up that I bought for my kids for Christmas. Not the same mic that was pictured when I purchased it. Rock Band for PS3 doesn't recognize it. Kids are totally bummed.",
      "overall": "negative"
   },
   {
      "reviewerID": "A2YPFA35GONOJ5",
      "reviewText": "When I ordered the microphones, I don't remember seeing the Disney emblem. I assume this means it's more for children because the quality is not very good. The emblem is clearly there now when I looked up the microphone, so this was most likely my fault. The microphone is good for kids and parents who do not want the singing applified. It's not for adults having some fun with RockBand.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A1WYS1TKOZEC78",
      "reviewText": "I bought the microphone with the cord after two (2) wireless microphone purchases. There is no lag time with the wired microphone.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3T1FH8VVJ6R07",
      "reviewText": "I can not get this microphone to work for nothing. So annoying. I have seen that lots of others have this problem as well. Tried several patches nothing seems to work. I wouldn't buy it again.",
      "overall": "negative"
   },
   {
      "reviewerID": "A17HV28EASOCFA",
      "reviewText": "i got this microphone to rap because it usb and really i felt dumb for buying it cause its for a guitar hero game and its 12 dollars but it works like a pro mic i just needed a op filter and a stand and i go those the same day i bought the mic and i got them all at the same time i was impressed im a rapper and i loved this mic so i recommend this mic for podcasting,vocals,rapping,or even the real use rock band",
      "overall": "positive"
   },
   {
      "reviewerID": "AW7S82TWLKFXK",
      "reviewText": "The product I have recently perched is one of my favorite games that I would one day like to complete. The game is also a lot better then a demo.amazon.com is a great site to shop for slightly used items, I plan to continue shopping on amazon.",
      "overall": "positive"
   },
   {
      "reviewerID": "A22KRTIWDLOA98",
      "reviewText": "Great game! I love the storyline and graphics, as well as the fighting style. Minus the super long time it takes traveling the ocean, this game is a blast, and a must-have for any fan of the Zelda franchise.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1DW08WJP6LIAN",
      "reviewText": "When buying used items, there's always a bit of a gamble, but not in this case. The game was just as the seller described, and it plays perfectly. I recommend them with two thumbs up!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2VLQKC78SZODC",
      "reviewText": "The game works great. I like how you can sail around the world instead of walking or riding Epona everywhere. I love the graphics used in this game. It is another thing that makes Wind Waker unique. It makes the game different from the other 3D Zelda games. I highly recommend this to people who love to play Zelda games.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2Q5ZDVPELFG2U",
      "reviewText": "Unlike some other Legend of Zelda oriented and overall gamers, I truly enjoy this game and find it to be a great addition to the LoZ series. It has a fun art style, no matter how drastic it is from the other games, with fun gameplay. Link gets a version of his traditional gear, plus a few new ones. There's some familiar and unfamiliar places, concepts, music, and faces, but, as always, Link still gets to be the hero. One thing different about the gameplay, though, is some consistent option of sneaky movements like the ability to crawl on any floor and sidle on any wall; Link becomes your little Solid Snake in the making.As with other games of the Legend of Zelda series, if you haven't played one of them before they can be a bit more challenging until you get used to general gameplay, the patterns for where to go, how to solve puzzles, etc. It also can be frustrating/boring to some people because of the amount of sailing it requires for a good portion of the game, but if you can get through that, I have no qualms about the game. Preference of art style is always a factor for some people, so if you really don't like what you see in pictures, I do not suggest this game for you; it's funny and cute through and through.Overall, it's a really fun Legend of Zelda game for practically any age with non-bloody action, adventure, and puzzle solving, one that once completed will still be fun to repeat play again and again.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3TZGPDQNR6MP8",
      "reviewText": "My family used to have this game but we lost it. It is incredible as always. Excellent condition. Recommend if for anyone.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3SVQ324DA8CNM",
      "reviewText": "All my stepson talks about is games for his Xbox. He picked this game cause he'd seen it online and I've got say good picking. Lots of lonnng hours of play and my daughter also loves it!Thanks againdray",
      "overall": "positive"
   },
   {
      "reviewerID": "A4PPZNQF1X2IY",
      "reviewText": "I played the original Zelda as a boy.  I've enjoyed a lot of good times playing this updated version with my 10 yr. old son.  Great adventures and game play, and luckily we can find tips for problems we confront on the internet.  Very well designed game that is user friendly.  Awesome.",
      "overall": "positive"
   },
   {
      "reviewerID": "A19WNCQP01HKG",
      "reviewText": "The game came a little more worn than expected. Other than that it still works perfect, so no real complaints!",
      "overall": "positive"
   },
   {
      "reviewerID": "AZGQXYB4TAODL",
      "reviewText": "The greatest bait and switch betrayal of a fanbase in videogaming history and most hated game of all time.To begin I will provide Amazon's customer base the &#34;tale of the turd&#34; as I call it in relation to this abomination's &#34;quality&#34; or rather lackthereof:Gameplay: Utterly challengeless. A lobotomy patient, a two year old drooling baby in a feces filled diaper or even an individual with a severe case of down syndrome could easily complete this game in a single sitting with minimal effort. Just mash buttons or &#34;spam&#34; the controls as PC gamers would say and you'll eventually complete this atrocious slap in the face Disney level Aonuma dreck.Graphics: Hideous, vomit inducing, ridiculous, teletubbies-esque, bait and switch from what we were originally promised at Spaceworld 2000 (realistic style epic, cool and beautiful graphics with a decidedly Lord Of The Rings style flare) Also there are ugly and gaudy white lines that appear all throughout Wand Wacker indicating Nintendo was not able to polish this turd before release. Oh what a shame.Sound: The only redeemable inspiring thing about this Aonuma dud is the ocean music likely composed by Koji Kondo. The rest is detestable Saturday morning cartoon level kiddy drivel. Soccer moms and grandparents should approve. Real Zelda fans can only vomit at this level of disrespect Nintendo has stooped to in order to insult us.Theme: Near total rip off of Kevin Costner's Water World to such a great extent I fully believe Costner could probably win a lawsuit against Nintendo for royalties if he so desired. Needless to say this watery environment is not what true Zelda fans look forward to when we go to pick up a new Zelda game. No, what we're looking for is the green forests and fields of Hyrule proper, not some watery grave that sits atop it for reasons likely relating to Aonuma's child learning how to bathe for the first time and Aonuma getting inspired to make Zelda into a giant bathing simulator via Wand Wacker. I've said it before and I'll say it again Nintendo needs to fire Eiji Aonuma and his entire Zelda team and get normal people developing the Zelda series again for it to return to health.Commentary: The online game journalists also known as professional liars can attempt to re-write history all they like but The Legend Of Celda: Wand Wacker will go down as the most hated videogame of all time and the greatest betrayal of a fanbase in gaming history.This was Nintendo, Miyamoto and Eiji Aonuma's Vince Mcmahon esque &#34;Screw you!&#34; to the true Zelda fanbase and by true Zelda fanbase I'm not referring to the scumbag sycophants that populate online gaming message forums but the market in general who determines whether videogames become massive successes or massive failures and the true Zelda fans spoke loud and clear not once but twice.Two whole times on that Wand Wacker piece of dog excrement first with its original Gamecube release and second with its Wii U HD re-release that this is not the way that they envisioned the Legend Of Zelda series, this is not the way they wanted it to go and as a result Wand Wacker flopped mightily BOTH times as such a Benedict Arnold or Rosenbergs esque betrayal is destined to do.To rephrase a quote from Ridley Scott's Gladiator: &#34;Marcus Aurelius had a dream that was Zelda and this is not it, THIS IS NOT IT!&#34;We were lied to and led to believe that the epic, cool, badass, Spaceworld 2000 realistically presented Zelda would be what we would soon be getting on the Gamecube but then much later the bait and switch hideously deformed Celda Wand Wacker made its debut to boos and hisses worldwide and massive hate on the internet was poured it and Nintendo's way (before the damage control brainwashing took effect which has left a dishonest internet forum gaming community in its wake who pretends to love Wand Wacker in order to shill and run damage control for Nintendo while real Zelda fans have abandoned Nintendo due to its betrayal of them for the other consoles or PC gaming if they haven't simply upped and left gaming in disgusting over this nasty unnecessary debacle and betrayal of Zelda's true fans.Eiji Aonuma the hack no talent Jimmy Fallon Of Japan enabled by the out of touch Shigeru Miyamoto has been ruining the Zelda series since he took up its reigns to create the embarrassment known as Majora's Mask.Aonuma's first game &#34;Marvelous&#34; failed (MARVELOUSLY!) and he had no credentials at all to be given the Zelda series but insanely Nintendo gave it to him and ever since he's been driving Zelda along with it's sales figures into the ground making one boring puzzle filled bad NPC filled faux Zelda game after another.When the truth of the matter is Zelda is supposed to be an arcade action adventure sword and sorcery game with light RPG elements thrown in for good measure.Aonuma completely butchers this formula in favor of the boring garbage gameplay elements he prefers and the market lets him know what it thinks of his efforts by making sure his version of Zelda ends up in the bomba discount gaming bins where such low quality trash belongs.In anycase to re-iterate so as to set this very important point in stone once more:Wand Wacker offers up literally no gameplay challenge whatsoever and can be completed by a lobotomy patient (as is typical of Aonuma offerings).Conclusion: My rating of this turd is 1 star since I can't give it lower due to how Amazon's system is set up.",
      "overall": "negative"
   },
   {
      "reviewerID": "AVLQ31I1SBFF7",
      "reviewText": "I was worried that it would not work. Took it out the package , the game works wonder ful. would use this buyer again",
      "overall": "positive"
   },
   {
      "reviewerID": "A1NH2K8N77S5RY",
      "reviewText": "lookin for a rpg? this is the game for you. filled with many hours of gameplay to find all the hidden items. casual gameplay, unless you try to collect everything, then it's hardcore. good controls and challenging puzzels give this game its rateing.",
      "overall": "positive"
   },
   {
      "reviewerID": "A385NYWKN3CGEK",
      "reviewText": "this is my favorite zelda game . even though it is cell shaded dont let that get in your way . it has great music graphcs and gameplay . probably my favorite feature is how you can pick up some enemies weapons . overall i give Legend of Zelda : Wind Waker a 10/10 .",
      "overall": "positive"
   },
   {
      "reviewerID": "AWLK1A2TC9N9T",
      "reviewText": "it looks like i got it brand new from a store this is awesome to see that is this well taken care of",
      "overall": "positive"
   },
   {
      "reviewerID": "AY29B250YNL9S",
      "reviewText": "Ocarina was almost beyond word. But this is a cruising, powerful, and fun rival! The worst thing about it is the seemingly endless confusing ocean. I do not look forward to trying to finger out witch Island I have to go to in which order (as I think there is an order). But I ignore all that for now and just enjoy the wonderful game. cruising blue waters, mystery, dungeons... And I still enjoy exploring the Islands.",
      "overall": "positive"
   },
   {
      "reviewerID": "ASPK9YH445G30",
      "reviewText": "I loved this game when it first came out and I still love it. It was a gift for my daughter and after receiving one that didn't play, I was more than ecstatic to get one that did function.",
      "overall": "positive"
   },
   {
      "reviewerID": "ADWOL6I0LUUGN",
      "reviewText": "well worth the wait in finally getting the last zelda game i havent beat. i would recommend this to anyone that wants a time killer game",
      "overall": "positive"
   },
   {
      "reviewerID": "A3G0NI0HL8DWYE",
      "reviewText": "You give it 5 stars. If you haven't played this game, you should be ashamed. Buy it or don't buy it, I don't really care.",
      "overall": "positive"
   },
   {
      "reviewerID": "A60I5RDJ2NPL",
      "reviewText": "If you are a Zelda fanatic like me, then you will be interested in Zelda: Wind Waker. Overall, this game is fun, but not the best Zelda yet(Until Twilight Princess). The graphics are better and Link, well, he is a cartoon figure. The music in the game is the best since Ocarina of Time. It still brings the Zelda tradition to life again. Link, you are Nintendo's Indiana Jones. Go Legend of Zelda. Try this game and you will be transported to another world of Hyrule. Heh, heh, heh, heh, heh. Is a me, Mario... Momma Mia!!! Mario is being attacked by the evil forces of Link.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1LQCPONG96R1Z",
      "reviewText": "I absolutely LOVE Wind Waker. The copy I received was in excellent condition and I have already completed the game three times lol. I highly recommend this game!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2I8LVI8932PD9",
      "reviewText": "This is an AWESOME game, I strongly recommend it to everyone! while other Zelda games seem to have a lot of side quests, this games seem unlimited.....and just when you think you've beaten it, you get to play a whole new way!!!",
      "overall": "positive"
   },
   {
      "reviewerID": "A2D33E7EBW17YD",
      "reviewText": "I have been an avid player of Zelda games since childhood. In this game Hyrule is a lost and forgotton kingdom and begins at your home... an island in a world covered with water. You, of course, must become the hero in times of peril. Your story begins when your sister is kidnapped on your birthday. You will learn how to command \"the power of the winds\" and obtain the triforce of courage to save your sister and return her home.  On your journey you will seek sunken treasures, solve puzzles, navigate mazes, fight sea monstors, Gannon's minions, and finally Gannon himself.I give this game:4 stars for graphics. The cartoon charactors faces show cute animated emotions.4 stars for challenge. Finding hidden treasures is very challenging, there are so many worlds you will want to take your time and check out everything. (It will take forever to backtrack.)3 stars for navigation. During boss fights I found this game hard to navigate in the 3d world. It felt like I had one of my eyes closed during the fights. If you run to evade the enemy or neglect to press the aim button you can easily loose track of your position.",
      "overall": "positive"
   },
   {
      "reviewerID": "A7XFJB7SQ56A1",
      "reviewText": "My grandson was thrilled with his Zelda. I was afraid he wouldn't like the fact that it was used, but when it worked fine, he didn't mind at all.  Marge B",
      "overall": "positive"
   },
   {
      "reviewerID": "A2UOHFR8DBQGGE",
      "reviewText": "Are 9 out of 10 GAMECUBE games like this little kid's game terrible? Answer: YesI bought the game, and I regret it so much!",
      "overall": "negative"
   },
   {
      "reviewerID": "A31R5JAIEV3L71",
      "reviewText": "Got this game for my brother for his birthday.  He is very much enjoying it.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2YI2I6116AAK0",
      "reviewText": "I bought this game for my son because he is really into all the Zelda games and for the longest time kept asking for it. The game has more of a cartoon look. It is pretty easy to play. Only thing I found hard to do is the wand but my son who is 12 seems to find it a little easier. I don't like the way you have to travel between areas on the boat my son loves it. I do love it when you battle someone and they drop a weapon you can pick it up and use it. Overall if you like the Zelda games this one won't disappoint you.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1OHKYCHQSBDBI",
      "reviewText": "So, it's definitely original, and true to formula, but there are a few aspects about this game that just don't make sense to me. The cell-shaded graphics take some getting used to, but I like them.My biggest complaint is that sometimes I'd be sailing somewhere, and could leave, make a sandwich, eat that sandwich, and come back, and still not be at my destination. Also, not including the side-objectives, it's a relatively short game.Is it better? No. Is it a Zelda worthy of the title? Yeah. I recommend at least playing it before making judgments or assumptions.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2JAF44LZDOAFV",
      "reviewText": "My oldest grandson loves this game. I can remember playing it when I was young and it was good back then but even better now.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1PLVUFF7JM9IT",
      "reviewText": "COME ON guys its Windwaker AND WINDWAKER IS AWESOME if you are looking the for the original Experience look no further if you want it in hd pretty pretty go get a wii u if you only have a wii buy this its cheaper then buying a wii u and Windwaker hd",
      "overall": "positive"
   },
   {
      "reviewerID": "AHG2EE6W4HNAA",
      "reviewText": "This game is one of my few regrets in gaming. That is, I regret missing the chance to preorder it. This is easily the most controversial game in the Legend of Zelda franchise. People were looking forward to another Zelda with the look, feel, and design of the N64 masterpieces. Instead, we got a much more cartoon-like look and feel, with numerous differences in design, including Link's own abilities (i.e. sidling against a wall) and a wide, open ocean world that seemed too much like the real ocean: mostly empty. However, after giving it a fair chance, I'm happy to say that Wind Waker more than stands out as a classic game. Link's facial expressions can be hilarious, the story is mind-blowing, the gameplay and design are fantastic. If you don't like exploring the world as much, for the most part you can breeze right through if you want to (there is a good chunk nearing the end of the game where you have to explore various islands, and spend a hefty sum of rupees as well). However, if you do like to explore, this Zelda is overflowing with opportunities, as the more you look, the more you find. What stands out in my mind is that, being as naive as I am, this was the first game that had a major plot twist that I never saw coming. My jaw was agape for several moments. That's what puts this game near the top of my all-time favorites.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1764MPM47OK88",
      "reviewText": "One of the best zelda titles ever! I recommend anyone who hasn't played this game get it as soon as you can.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2BN1GBNIWMMPX",
      "reviewText": "Zelda never disappoints, this game is a perfect. The graphics are unique, and the game play is addictive in a good way.",
      "overall": "positive"
   },
   {
      "reviewerID": "A22WMR7A90JFE4",
      "reviewText": "I......loved it. It was like jumping back to the nes version but portable. I also love the way the made it where you can choose what game.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2PCC8AE73T9GL",
      "reviewText": "The game is challenging.  I had a lot of fun with it. Had no problems with the actual product itself.  Arrived on time and in good condition.  Enjoyed playing it.",
      "overall": "positive"
   },
   {
      "reviewerID": "AAULDIG3U3FZ9",
      "reviewText": "He likes the game a lot, it just took a while to get there because hes in South Korea, so it was understandable that it took so long.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1IK1WOYMYZWG7",
      "reviewText": "My son plays it all the time.  It must be a good game.  I don't play the games, so it is just my observation.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3KZX3XJJXQFQY",
      "reviewText": "My nephew asked this for Christmas and I know he will be excited!  Very good price - very good service!",
      "overall": "positive"
   },
   {
      "reviewerID": "A1VIGYNY7MP036",
      "reviewText": "My grandsons love the game they can't stop playing it.  They start early in the morning and go all day.  They love the action and the game components.",
      "overall": "positive"
   },
   {
      "reviewerID": "AO2C4ZH1WXN17",
      "reviewText": "If you're a Sonic fan, this is a game you'll enjoy.Beware though, it's very challenging at the same time.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3BUTITT7VH8TK",
      "reviewText": "This was a great game then, and it is still.  ...pretty fun multiplayer mode too!",
      "overall": "positive"
   },
   {
      "reviewerID": "A1DM6ESSL9VZ24",
      "reviewText": "remote works just fine ......... from less than 5 feet away.....other than that it doesn't work at all, waste of money",
      "overall": "negative"
   },
   {
      "reviewerID": "A36S4GZIXTJ9B0",
      "reviewText": "I actually bought this product new from a video game store and it has worked just fine for me. It is excellent if you just want to watch a movie and not have to mess with the normal xbox 360 game controller. Plus it is nice because now everyone in my family can use it (because it is as basic a normal remote control) while before not everyone knew how to work an xbox 360 game controller. It has all the buttons that you need to work your xbox 360 and not too much else. I recomend it.",
      "overall": "positive"
   },
   {
      "reviewerID": "A102XAY1719I61",
      "reviewText": "Can I give ZERO stars??!! You get what you pat for. I should have known it was a bad idea when the shipping is 3X more than the product itself. Do not get ripped off ... simply do not but this product. Does not work with my XBOX.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3QGL4W4KC6I45",
      "reviewText": "I got tired of using the 360 controller for video, because it kept turning itself off and the control scheme was sort of a mystery at first. This looked simple and well priced, but I've gone back to using the game control. You have to point it very carefully and press the buttons firmly. I use it for DVD's but for Netflix or Zune I use the old reliable. A light touch and no aiming to speak of with the game controller.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A1SWGOFRM4X8LO",
      "reviewText": "recived first remote could not get it to work. Got in contact with seller via e-mail they just sent me a new one. I got it to work 2x and would not respond to commands most the time. Awful product would not recommend to worst enemy. The customer service was excellent, no hassle and didn't have to even return the first remote. Didn't want to deal with it so just tossed them both in garbage.",
      "overall": "negative"
   },
   {
      "reviewerID": "A13OUH254Y2OZ1",
      "reviewText": "i bought it expecting to use it as a universal remote but it didnt have # buttons, but overall it was okay",
      "overall": "neuter"
   },
   {
      "reviewerID": "A3MCK7EQ07JRDF",
      "reviewText": "This product arrived today- I put brand new batteries in it and it doesn't even work. This thing is a piece of junk. Serves me right, you get what you pay for. Word to the wise, just buy the one from Microsoft.",
      "overall": "negative"
   },
   {
      "reviewerID": "A3Q1VZJ8LLMPZU",
      "reviewText": "I need a remote for my Xbox 360 so I can watch movies properly. When I see a good priced remote. I got it. The picture showed what it looks like. But when I received the remote, I was angry. This remote that I got was a joke! It was not what it looked like on the picture. I wanted a refund, but said no. I threw the remote away because it was a piece of crap.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1ECYPMSVD2ONZ",
      "reviewText": "This is a good component cable for Wii. The picture is much improved. Connected to Sony 46inch 1080p LCD. I would recommend this product.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2TNDVUGHRJPA4",
      "reviewText": "The video quality is fine but if you have your hdmi plugged directly into your tv and have a separate receiver for audio, the cables are way too short to fit in both, so right now if I want to use the better video signal, I have to use the tv audio. I'll try to rip open the cables to make them reach but this is really a design flaw, although many newer receivers have hdmi connectors on them, there are a lot that don't.",
      "overall": "positive"
   },
   {
      "reviewerID": "A29YSA56JGVBR5",
      "reviewText": "love the price and i saw a big change on my wii. everything is more clear on the games and on netflix movies.",
      "overall": "positive"
   },
   {
      "reviewerID": "APIEMCSJGVTB5",
      "reviewText": "This was cheaper than I found in my local stores and works wonderfully.  Delivers nice sharp picture on my TV.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2PI76DIG6V3NI",
      "reviewText": "Great alternative to 1080 Tvs. I upgraded my TV but the old connectors made the connection look fuzzy. With this cable I can get 480p which makes games and netflix look great (dvd quality) on my 50 inch HD Tv.",
      "overall": "positive"
   },
   {
      "reviewerID": "A37LN4UN41CEVY",
      "reviewText": "I was looking for a cheap way to take advantage of the system's 480p capability.  I found this after looking on line and it arrived reasonably fast.  The cable preforms fine except that when ever anything kicks on, ie dishwasher, refrigerator, furnace, in our house I get flicker on the television set.  Now it isn't enough to return the product as I bought cheap and received cheap.  I may go back to the cables that came with the system and live with 480i.Just beware that when buying cheap you have to remember that you get what you pay for.",
      "overall": "neuter"
   },
   {
      "reviewerID": "AO4N4DHEQKPML",
      "reviewText": "The Wii wasn't meant for Hi-def, but the 480p with the component cables makes the picture much crisper. It definitely worth the value.",
      "overall": "positive"
   },
   {
      "reviewerID": "A54VV4EOD0BS3",
      "reviewText": "If your looking to upgrade from the standard belive me it's a big differance. Atleast on my LCD with the wires nintendo gave the screen was blurry and so unattractive :) I ordered these (because the price was unmatched...how do u beat 5$) and can honestly say it was one of my better purchases. Really \"changes the game\" for me!! Very pleased",
      "overall": "positive"
   },
   {
      "reviewerID": "A1F4G84URSWJPI",
      "reviewText": "This made it possible for me to have both my Wii and my DVD player connected to TV at the same time, rather than switching the connections every time I wanted to use one or the other.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2AT1RTGDT8GNQ",
      "reviewText": "when i hooked it in i encountered buzzing and visual problems, the quality was fuzzy and the standard wii cables look better. i would be more mad but i guess i got what i payed for.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A3IICEM9MET7UE",
      "reviewText": "Fits the wii perfectly, nice and tight.  The rca jacks are little cheap, but they the grab and hold just fine.",
      "overall": "positive"
   },
   {
      "reviewerID": "A371YLCQTZJQOY",
      "reviewText": "This cable is well made and designed to last. The cable is better then the product it is used to attach as WII does not support 1080p.",
      "overall": "positive"
   },
   {
      "reviewerID": "AGW03EU5NASI2",
      "reviewText": "Very happy with this AV Cable -- it works very well & I'm so happy to play my old Sports Wii again on our HDTV -- I did have to move a few cables around - till I had the best picture with sound etc; -- all is well & we are thankful that we don't have to buy a whole new Wii Package. I would highly recommend this cable!!!! :)",
      "overall": "positive"
   },
   {
      "reviewerID": "A1SP8LEP85ENNV",
      "reviewText": "...that Nintendo (or Sony, Monster Cable, etc.) can ask so much for things that don't cost nearly so much to manufacture; the name brand cables are probably made in China right alongside these third-party counterparts. $30 was out of the question for me right now, so I figured I'd take a chance on this. 5 or 6 bucks, WITH shipping. It does come in a clear plastic bag with no labeling or instructions, but it's a high-quality cable that performs perfectly. No problems whatsoever (grant it, I've only had it a day, but I don't forsee anything changing as sturdy as it is). The colors are noticably brighter, and to my surprise, everything does appear crisper! As mentioned, just remember to go to Wii Settings and change TV resolution to 480p.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1P5JY2RNICG8F",
      "reviewText": "While the product is what it is described as, it unfortunately will give me no signal whatsoever. I believe it is a fault of the a/v cable side, as plugging that in, unplugging it, blowing on it, hissing at it, calling it names, then plugging it back in seems to make it work again. I did check and have the problem across more than one tv, so it's not the tv's fault. I have no way to determine with confidence if it is a fault of the Wii, but I doubt so, as the Wii has no problem with its standard definition cabling that it came with (why, Wii, did you not include component/hdmi cabling by default? HD isn't that rare). Ah, but it is the most inexpensive version of this cable I could find, and the picture is markedly better using this than the original cabling.",
      "overall": "positive"
   },
   {
      "reviewerID": "A21LDZBJI7V90L",
      "reviewText": "Worked perfectly. This is exactly what I needed to get my Wii to connect to my high definition television. Thanks!",
      "overall": "positive"
   },
   {
      "reviewerID": "A3M3LFFBM2WQCS",
      "reviewText": "I didn't notice much of a difference on my hd tv with this cable. Even though I changed the setting to 480 p. I tried Netflix streaming and it was ok. The price is great! So it's an ok cable that doesn't make much difference, but I would still recommend it, so that you can use a component input on your tv, instead of composite.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A3EE2JXVXYHMJ8",
      "reviewText": "I'm glad I purchased this cable, it doesn't necessarily make your games look amazing, but it does allow you to do 480p instead of just 480i, so for how inexpensive they are I think it's a worthwhile investment! I've also read that it makes movies look noticeably better, but I haven't played any to confirm/deny that.",
      "overall": "positive"
   },
   {
      "reviewerID": "AOS2A9LDAP1ZJ",
      "reviewText": "I needed this to connect to my LCD LED VIZIO. It works.  Not much more to say than that. I found no fault with it.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2ZYJOZO6BPV6K",
      "reviewText": "This product is very good and works fine. Buy it if you want it. it lets your we display in HD format of 480p which looks alittle better than normal Av cable it comes with. To the untrained eye you might not even notice the diffrence.",
      "overall": "positive"
   },
   {
      "reviewerID": "A28KXHCVAG53N9",
      "reviewText": "This cable is something Nintendo should include when buying brand new Wii. Product is made well, easy to connect and works great!",
      "overall": "positive"
   },
   {
      "reviewerID": "A3T6JK9R2939LN",
      "reviewText": "I am currently emailing Eforcity about the product, but there does seem to be a lot of corruption in the picture. The overall picture looks fine just some flickering and lines appearing throughout the screen. I hope this is just a problem with mine but if you see any more reviews talking about something like this I would stay away from this product.Side note: This is as close to HD as the Wii will ever get, buy an Xbox or PS3.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A1KDD36CUFACLQ",
      "reviewText": "I got this Item about a month ago. I have not had any problems and it works just fine, but the cables feel a little on the flimsy side. In the long run it really does not matter, and for such a cheap price I really should not complain.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2RRD7CXKIZ3NN",
      "reviewText": "I agree with other reviews that the video for gaming is not improved in \"HD\" using a component video cable with your Wii console.  I looked at the bowling game before and after switching, and it looked the same.I got the disc from Netflix for watching movies on the Wii.  I compared by starting a movie with the original video cable.  The video was fuzzy and just blah on my HD TV.  Paused the movie and switched cables.  Restarted the movie and it looked the same.  Then I realized that I have to go to the Wii set up menu to change from 480i to 480p.  After that the picture was much better.  Netflix \"Instant\" streaming movies now look as good as playing the DVD.  The image is sized to fill my wide screen HD TV.The cable itself has full sized plugs for video and audio.  On my TV the jack spacing leaves no gap between plugs, making plugging it in tight.  Make sure every plug is fully inserted if you have picture or sound issues.",
      "overall": "positive"
   },
   {
      "reviewerID": "A3C54VY4P1RCE8",
      "reviewText": "then wii is not hd it only has standard def out on it (for now) so buying this item for an hd tv is very pointless use your a\\v cables people!there is a rumor of a hd wii in the making but no offical word as of yet,so before you some totally insane item do your research people.",
      "overall": "negative"
   },
   {
      "reviewerID": "AKNJEKE16A3AZ",
      "reviewText": "I purchased this HDTV cable for my Wii because I recently converted from my 26 inch tube TV to a 46 inch LCD TV, and I had noticed that the Wii wasn't looking so hot on a screen designed for HD. Upon using the cable, I noticed a change in the image. I thought it was clearer and sharper, and though still not the same as X-Box or PS3, it is good enough for me. The cable is a little short, so I can imagine this could be a problem for some. With the price I would definitely recommend purchasing this!",
      "overall": "positive"
   },
   {
      "reviewerID": "A210S3XM4U4CZP",
      "reviewText": "can't judge the cable in this review, so i gave it three stars. I bought this cable erroniously, needed VGA connectivity. I've kept it because, well, you never know what cable you might need in the future.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A26USTOZVJXLKM",
      "reviewText": "for the record, ive only had these cables for about a months or so.just to address the immediate concern:the cables are of a quality physical buildthey give a much more crisp picture than composite cables, and the quality is just as good as expected.there are a few problems i have with this item though...the heads of each wire are FAT. the component ports on my tv are spaced pretty close together, so its hard to fit all the wires into each port. (thats what she said!)my final gripe with the product is that the packaging it came in was pretty cheap looking. it came in a white box that totally said \"hey...were third party and we know it.\" its not that i really care what the stupid packaging for cables looks like, but it just sort of made me question the quality of the product right out of the box.i will not take off any points for the things i dont like, because i know that peoples real concern when buying cables is picture quality.YES, these cables are very sufficient in that aspect. i just hope they STAY a good quality and not deteriorate over time. oh and they where affordable too! ;D",
      "overall": "positive"
   },
   {
      "reviewerID": "A2EMGZYAC3OMTI",
      "reviewText": "I rated this product as I have because it exceeded my expectations. Also, I would recommend this product to others.",
      "overall": "positive"
   },
   {
      "reviewerID": "A24S4PQTXO18B5",
      "reviewText": "This was exactly what was needed and has worked flawlessly since being received. I recommend it, if you need one.",
      "overall": "positive"
   },
   {
      "reviewerID": "AK1YGBVLQYQSG",
      "reviewText": "I purchased this thinking that I had to have it with my HDTV. When I went to use this cable instead of the basic one included with my wii, mario was blue/green and the top of the screen flickered with red and white stripes. However, the basic cable worked perfectly.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1GVT623LJS4XS",
      "reviewText": "the cable is of good quality, and the package came quickly.  no complains here.  it also gave the tv a better picture compared to the standard AV cables.",
      "overall": "positive"
   },
   {
      "reviewerID": "A24AXRRSYGYCTG",
      "reviewText": "I got a new TV and the WII has red/yellow/white, but the TV has green/blue/yellow so I got this cord to connect the WII to the TV.  It makes a clear picture and works fine",
      "overall": "positive"
   },
   {
      "reviewerID": "A3ECLAWGNCSQKR",
      "reviewText": "its a good product it does the job . not the best but a good cable !!! u cant get any better deal then a couple of dollars for this cable .",
      "overall": "neuter"
   },
   {
      "reviewerID": "A1S9GY3E0U9QM6",
      "reviewText": "This component cable was exactly what I was looking for and was a great price! Instead of having to get an A/V component box for my gaming systems, I was able to find this. It was a great buy :)",
      "overall": "positive"
   },
   {
      "reviewerID": "A2YN7JG3GHA4NH",
      "reviewText": "cable arrived in timely manner. Hooked it up to TV but did not work properly. Wii picture was close to black and white only. Appears that the leads were mislabeled or misaligned as sound only came on when the green video connection was plugged in. Would suggest buying different cable. Not sure if will return, cable very cheap relative to cost of shipping return",
      "overall": "negative"
   },
   {
      "reviewerID": "A1AVIXEZTD3D1R",
      "reviewText": "Original:The cord arrived quickly and just comes in a plastic bag inside the box. I bought this cord to have a spare cord and decided to try component cords instead of composite.  The cord works and does help make the picture a little crisper than the regular Nintendo Wii cord. Between the cheap price and the picture quality I get I'm definitely happy with my purchase.Update May 7, 2013After using the cables for a while I occasionally get a green tinted screen when I load my Wii, although I've been able to get it to go away restartig the Wii and replugging in the cords. Also after using my Wii to watch Netflix more I can say that the color hasn't bee great and is not very accurate to when the show is watched on my laptop or through original broadcast. I also can't really say that its the cords or the Wii that is going bad and making the color go bad. At some point I'm going to try to borrow cords for a friend and test it out. Ultimately though the cords were dirt cheap compared to other I looked at and I would not be surprised or even mad if they went bad after being used for a while.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2C8113TLLNP4X",
      "reviewText": "The image quality seems to be leagues better than it was before.When I first hooked up my Wii we (my girlfriend and I) had a 27 inch Sanyo tube television.  The picture looked great because of the aspect ratio; video game systems were built around televisions like this.  We soon decided we wanted a bigger and better image and upgraded to a 37' Vizio LCD.  We were saddened to see picture quality decrease exponentially and quickly became confused as to why our Wii didn't look great on what we knew to be a much better television.  We found these cables online and after applying them noticed the picture was 100% better in quality.Long story short:  Researched component cables, found them on Amazon for a great price. Ordered cables, arrived very quickly and they worked as described.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2SER92481Y23O",
      "reviewText": "I agree with most other reviewers on this cable in that it helps with the Netflix viewing, but not so much with the gaming. I think this is because of the way the games are made (I could totally be wrong on this). Certain games like Donkey Kong Country Returns look better with this cable, but Black Ops looks the same. There is a noticeable difference in my Netflix streaming though. So, for six bucks this is what I got, and I'm happy with it, but not over the moon.",
      "overall": "neuter"
   },
   {
      "reviewerID": "A1IZGZFO1W4UX0",
      "reviewText": "I was very disappointed in this item.  We thought we would get a better picture than the standard WII video cables, but definatley took a leap in the wrong direction.  I would not recommend.",
      "overall": "negative"
   },
   {
      "reviewerID": "A8413OQPUAF9P",
      "reviewText": "After hooking this up to my Wii, I encountered buzzing audio and slight video glitches. At first I thought it was simply a connection problem, or else a problem with my television, but after purchasing the far more expensive Nintendo brand component cables, I came to the realization that my bargain brand cable was either defective or simply too sensitive to other devices electro-magnetic interference. Your mileage may vary.",
      "overall": "negative"
   },
   {
      "reviewerID": "A1YXSS15C11VJX",
      "reviewText": "The cable does what is intended for and I am happy with it.  Not sure what else to write but there is a minimum amount of words required.  Seriously though, no problems with the cable.",
      "overall": "positive"
   },
   {
      "reviewerID": "A22O9ZL4GI6LUK",
      "reviewText": "Se nota la diferencia de inmediato cuando usas este cable y lo mejor es el precio que tiene. Me costo mas el envio que el mismo cable, pero vale cada Dolar que pague.",
      "overall": "positive"
   },
   {
      "reviewerID": "A20II3SKFEYW4P",
      "reviewText": "I purchased this Wii HDTV cable to hook up to my brand new HD TV. Easy installation and I wanted to get the most out of my gaming unit.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2SNTFPRD3IV87",
      "reviewText": "If you need an rgb interface this really works good. My new tv didn't have the yellow video hookup. Just use it for Netflix I only play xbox",
      "overall": "positive"
   },
   {
      "reviewerID": "A1YBGCEU62FPPN",
      "reviewText": "After few months of use cable flicker and video goes off as i watch my netflix online using component cable. Picture quality is very accurate on my LCD. I don't know if flickering is due to cable or my nitendo but some online site suggested it could be cable.",
      "overall": "positive"
   },
   {
      "reviewerID": "A1MHBOYUTH9F8R",
      "reviewText": "Cheap solution to improve video quality for the Wii on HDTVs. The picture quality is better than what we get from component cables from our DVD player.",
      "overall": "positive"
   },
   {
      "reviewerID": "ART9F6VXV58CJ",
      "reviewText": "great component cable for the Wii.  makes hookup easy and can be used for other components...heavy duty...quality...shipped fast and was a great price...",
      "overall": "positive"
   },
   {
      "reviewerID": "A3LY4W91R3S5D3",
      "reviewText": "This item was shipped quickly. Also so far working well. I do have 1 idea to share, it does'nt come with any type of install or information data. I believe that all products such as this should. I give it 4 stars",
      "overall": "positive"
   },
   {
      "reviewerID": "A30LVC3YMGFE0K",
      "reviewText": "It has been over 1 year since I bought this cable.  No problem at all. Quality is very good. There is no difference between this cable and Nintendo branded ones, except for the price.",
      "overall": "positive"
   },
   {
      "reviewerID": "A2KQYVYOJNESEY",
      "reviewText": "First, this is a low cost cable, and so is built.  The RCA ports are easy to get loose and slip out of the tv connector.  Also is not well shielded , you will have to route the cable away from RF interference or power lines, or you'll notice flickering video.  Overall in a simple connection it should work fine, but in a entertainment system where are some other devices, as home theater, networking equipment, etc, the cable will pick a LOT of Noise.  Also it should be a permanent installation, since it is not sturdy enough to resist multiple pulling in / out of the connectors.  Otherwise it will do the trick, and having your WII in 480P will not make it a HD console, that the wii is not capable of, but picture will be clearer, sharper (I don't know, but in my 40\" LCD image out of the standard cable seems a bit blurry)and with more defined colors",
      "overall": "neuter"
   },
   {
      "reviewerID": "A2OE9KQOOMFO9R",
      "reviewText": "This pair of component cables are great! Affordable and works just as good as those $30.00 Nintendo Wii branded component cables! Save yourself some money and buy these if your needing some component cables for your Wii!",
      "overall": "positive"
   },
   {
      "reviewerID": "A1JMWS5GJVF76P",
      "reviewText": "This is exactly what I needed.  And I got it cheaper than in a store and that is if you can even find it in a store.  Would have had to wait a week for them to order it, but got it in just two days and my boys and I were off battling dragons.  :)",
      "overall": "positive"
   },
   {
      "reviewerID": "AOYEO5AIEZ7IF",
      "reviewText": "Works just as well for $3.02 as the component cable that WII sells for $27.99.",
      "overall": "positive"
   }
]